[
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-07T14:50:34.185000+00:00",
    "content": "**📅 NS Events for March 8, 2025** (4 events)\n\n**Daily Mental Reset (Morning) - Aum (Om) Chants** [↗](https://lu.ma/wnkodk3e)\n10:00 AM - 10:30 AM | Swimming Pool Area - Level 1 | By Kritika & Network School\n\n**Hackathon № 1 | AI-Empowered** [↗](https://lu.ma/auifgm9n)\n12:00 PM - 6:00 PM | Level 13 | By Teya & Eden & Network School & Stephane Laurent Villedieu\n\n**IWD Dinner in JB** [↗](https://lu.ma/86kasgxg)\n7:00 PM - 9:30 PM | Vanakam India Eko Botanic Johor Bharu | By Dawn Musil\n\n**Tarot Reading On The Beach** [↗](https://lu.ma/y85zjvwh)\n7:30 PM - 11:30 PM | Light Bar Forest City | By Leonardo Manfrini\n\nSee you at the hackathon!"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-07T08:46:07.725000+00:00",
    "content": "@everyone **The first NS Hackathon starts at 12pm tomorrow in the Ping Pong Room** 💻 \n\nHackathons used to be reserved for hardcore computer scientists and engineers — but not anymore. The rise of generative AI is changing the game and ushering in the era of the *vibe-coder*. 🏄‍♂️ 👨‍💻 ✨ It doesn’t matter if you're a beginner or a cracked 100x engineer — tools like Cursor, Replit, Windsurf, and Lovable can help you go from idea to MVP in just a few hours.\n\nSign up [here](https://lu.ma/auifgm9n) and reach out to @undefined @undefined for any logistical questions.\n\nThe NS Core team will be judging. And the winning team walks away with [Nucleus DNA tests](https://mynucleus.com/product). 🏆"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-06T19:40:45.499000+00:00",
    "content": "**Friday**\n- 7a Starship flight watch party (Ping Pong Room)\n- 7:30a Volleyball practice (coordinates are in the Luma event https://lu.ma/sxdd5hqx)\n- 9a Join NS on Strava\n- 10a Daily Mental Reset Aum/Om Chants\n- 10:30a Himalayan Kriya Yoga (ask @undefined for the event location)\n- 12p Farcaster Frames Schelling Point (Ping Pong)\n- 2p D/Acc Cypherpunk Futurism (Ping Pong)\n- 4p Unlocking China Part 1 of 4 (Coworking)\n- 5p Junto: History as Trajectory (FULL)\n- 6p Poker Night (Ping Pong)\n- 7p Friday Drinks (Talk to @undefined for location) \n- 8:30 Vipassana meditation (Talk to Andy for the location)\n\n**Saturday**\n12p-6p The first ever hackathon at NS! \n7:30p Tarot Reading on the Beach\n\n(Side note - let me know if you have a script that can help automate these kinds of messages. Bonus points if you can build this without needing Discord admin access or oversight from a team member to make it.  Scope would be to scan Lu.ma/ns for the day's events at 11:59pm every night and then send a message with something resembling the above format, ie. [TIME],[EVENT NAME],[LOCATION][LUMA LINK])"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-06T16:49:30.281000+00:00",
    "content": "@everyone **Poker Tournament at 6pm tonight** \n\nThe first poker tournament of this cohort will be at 6pm in the Ping Pong Room — hosted by @undefined.\n\nIn addition to the cash prize from the entry fees, the winner will also get a [Nucleus DNA test](<https://mynucleus.com/product>) worth $399! 🧬\n\nSign up here: https://lu.ma/qkwng46x."
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-06T07:02:28.207000+00:00",
    "content": "@here Use code #nsmar6 on [sli.do](https://app.sli.do/event/a5ZjosarpZRD4ztTkHXfwW) to ask questions for today's talk."
  },
  {
    "userName": "balajis",
    "timestamp": "2025-03-05T18:16:01.945000+00:00",
    "content": ""
  },
  {
    "userName": "balajis",
    "timestamp": "2025-03-05T18:15:34.330000+00:00",
    "content": "Btw, here are some images of the new  [ns.com/profile](https://ns.com/profile) (which gets updated as you complete quizzes) and [ns.com/learn](https://ns.com/learn) (with the book list)."
  },
  {
    "userName": "balajis",
    "timestamp": "2025-03-05T18:14:23.643000+00:00",
    "content": "@everyone **The Network School Book Club**\nThe Network School Book Club is now live at ns.com/learn! Here’s how it works:\n\n1) _Read books at ns.com/learn._ There’s a weekly list of books at ns.com/learn, all on various aspects of building startup societies, with links to get them on Amazon.\n\n2) _Discuss books on Tuesday afternoon._ Each week, we’ll hold a book club in the NS Cafe right before dinner time on Tuesday from 4-6pm. The first hour prior to dinner will be silent reading, and the second hour will be live discussion, which you can continue during dinner at 6pm. We’ll group you for book club as we did for the mixer.\n\n3) _Optionally, quiz and Warpcast review._ Each book has an optional quiz to self-test your understanding and get an NFT for your ns.com/profile. For extra credit, write a book review (whether full post or tweet length) and post it from your warpcast.com account.\n\n**The First Three NS Books**\nMost books on our list relate to startup societies, but the first week's curriculum is focused on self-improvement:\n\na) _Atomic Habits_ is James Clear’s guide to programming yourself\nb) _Navalmanack_ is my friend Naval’s guide to building wealth\nc) And _Tools of Titans_ is Tim Ferriss’s collection of successful heuristics from the successful\n\nWhy assign these three first? We're front-loading these three in particular so you can keep going back to them in the weeks/months that follow to keep getting value out of them. These types of books generate compound interest. Think of this as the \"win\" part of \"win-and-help-win\", the individual self-improvement part that's a daily part of the Network School Curriculum.\n\n**Next Steps**\nOK. As next steps, all you have to do is:\n\na) get the books on Kindle via [ns.com/learn](https://ns.com/learn) and \nb) sign up for the first book club from 4-6pm on Tuesday via [lu.ma/61pn7tfw](https://lu.ma/61pn7tfw)\n\nWe'll assign groups like for the mixer prior to Tuesday at 4pm. See you then!"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-05T09:49:54.590000+00:00",
    "content": "**Talk by Network School co-founder Donovan Sung**\n\n@everyone Tomorrow at 1:30pm in NS Coworking we'll have a talk by Donovan. He'll share stories from his time at YouTube (~$400B), Spotify ($100B), and Xiaomi ($200B) working at three hectocorn companies across three continents. \n\nDonovan will be sharing unfiltered insights and personal experiences, so this session will be off-the-record with no photography/videography allowed.\n\nSee you at NS Coworking: https://lu.ma/v0cnzbg9."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-05T08:37:20.438000+00:00",
    "content": "@everyone The NS Content Studio is open for business🎥 🎬\n\nThe studio is located on the 3rd floor of the South Tower. It’s equipped with tripods, studio lights, a microphone, acoustic sound panels, high-speed WiFi, and phone tripod adapters. You can also bring additional personal equipment. Additionally, I have my own DSLR that you can use if you ask nicely 🙂 \n\nYou can reserve the content studio for 30 minutes at a time at cal.com/nscontentstudio for up to four consecutive slots (2 hours). Please do not book the content studio as a phone booth for regular meetings.\n\nCan't wait to see what everyone makes!"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-05T00:34:17.442000+00:00",
    "content": "**Network School Content**\n\n@undefined, @undefined, and many other NS members have been creating awesome content. \n\nCheck out their 🔥 Reels [here](<https://www.instagram.com/reel/DGtRGeBSV6I/>) and [here](<https://www.instagram.com/p/DGx8JvsP2M9/>) showing day in the life of a Network School member. \n\nIf you have high quality photos and videos from your time at the Network School, please upload them to this Google Drive: <https://drive.google.com/drive/folders/1t5g-kQvQXYDfiM6rKUHjdFIqcbC6ndjU?usp=sharing>."
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-03T19:15:15.360000+00:00",
    "content": "@everyone **Mixer in NS Cafe downstairs at 4pm**\n\nOur new NS Cafe is open 6am to midnight, and we're holding a mixer at 4pm to celebrate the grand opening. For the mixer, we’ve clustered everyone that submitted this [form](<https://forms.ns.com/t/kkWHmxcsBVus>) into [groups](<https://docs.google.com/spreadsheets/d/1u4Eua9Psk7u8srZ_wBpFa2xkvAbweAjPq8atwBg-K9E/edit?usp=sharing>) of four to discuss your goals at NS. @undefined and I will be there to help facilitate. \n\nCome get a coffee and meet other NS members: https://lu.ma/g4xgz77z."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-03T18:08:45.987000+00:00",
    "content": "**Tuesday:**\n- Vinyasa Flow Yoga (11AM with @undefined - will be capped at 18 people)\n- AI Mind Meld Office Hours (1:30 PM with @undefined )\n- Startup benefit societies open conversation (1:30 PM with @undefined )\n- AI Agents SOTU (3PM with @undefined )\n\n**Wednesday:**\n- AI Weekly Recap (4PM with @undefined )\n- Atomic Scaling (5:30PM with @undefined \n\n**Thursday:**\n- Morning pages (10 AM with @undefined )\n- Systems thinking (6:30 PM with @undefined )"
  },
  {
    "userName": "balajis",
    "timestamp": "2025-03-03T08:12:50.720000+00:00",
    "content": "@everyone See you all at NS coworking in 15 minutes. We have the first investor in Bytedance (which you might know as TikTok!) on campus to give an overview of the current Chinese tech ecosystem."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-02T17:07:45.457000+00:00",
    "content": "**Monday:**\n- @undefined is hosting a 7am run club (nice way to pregame Burn!) \n- @undefined is leading Burn at 8, 9, 10, and 11am.\n- @undefined @undefined and @undefined are doing an \"introduction circle\" in the ping pong room at 1PM\n- An AI mind meld with @undefined (tentatively on the first floor of coworking) at 3pm\n- Jason Wu is our first guest speaker - that's at 4:30pm\n- @undefined will be leading a DeSci 101 event at 7:30pm in the ping pong room\n\n**On Tuesday, **\n- @undefined is bringing back Vinyasa Yoga at 11am in room 1215\n- @undefined will lead the State of the Union re: AI Agents\n\nYou can view these events at any time at lu.ma/ns \n\n**PRO TIP FOR HOSTS:** Make sure feedback is turned on so we can see how enthusiastic the community felt about your event 🙂  Good night!"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-02T10:05:43.577000+00:00",
    "content": "@everyone if you missed yesterday’s logistics orientation, please come to room 1215 at 6:15pm (in 10 minutes)\n\nNo need to join if you already went yesterday"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-02T09:42:58.334000+00:00",
    "content": "**Talk by Jason Wu (first investor in ByteDance)**\n\n@everyone Tomorrow at 4:30pm in NS Coworking we'll have Jason Wu from Source Code Capital, the first investor in Tiktok parent ByteDance ($400B). He'll talk about the latest tech trends in China across AI, robotics, drones, and more!\n\nSee you at NS Coworking: https://lu.ma/oe34u8a5"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-02T07:40:30.289000+00:00",
    "content": "If you have not done your combine yet, please come within the next 2 hours. To get to the gym, take the elevator on the third floor of the south tower. turn left. Walk outdoors along the stone path until you get to the giant white pavilion tent"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-02T07:29:50.838000+00:00",
    "content": "Hey @everyone! [here's](https://discord.com/channels/900827411917201418/1278081837780041749/1345597613944340512) a quick food update from @undefined who's taking care of NS Food 🍽️ We'll have 3 meals every day that are included in the NS membership: \n\n- Breakfast 🍳: On level 1 from 7:00am to 10:00am\n- Lunch 🍱: Served in grab-n-go boxes at 11:30am along with nutty puddings on level 13. \n- Dinner 🍛: Buffet style on level 13, available starting 6:00pm.\n\nFeel free to check in with Jasmine if you have any questions or feedback! 😊"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-02T05:42:40.130000+00:00",
    "content": "Or just click on this [link](https://app.sli.do/event/r8rSBuckaA49y5ACrSYCNF/login?clusterId=eu1&redirect_url=https://app.sli.do/event/r8rSBuckaA49y5ACrSYCNF)."
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-02T05:41:08.707000+00:00",
    "content": "@here Use code #nsv2 on [sli.do](https://sli.do) to ask questions for today's talk."
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-02T04:16:33.063000+00:00",
    "content": "Great seeing @everyone getting their Burn in at the gym today 🔥 Don't forget to claim your proof-of-workout by scanning the QR code on the TV after your Burn session. \n\nIf you didn't get your welcome bags yesterday, come to NS Cafe on level 2. I'll be here till 12:30. \n\n**The opening address by Balaji will be at 1pm at [NS Coworking](https://maps.app.goo.gl/KwyHqDZ8q6xiFeGx5). **\n\n@undefined and I will lead a walk to NS Coworking from the the lobby at 12:40."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-01T15:04:35.531000+00:00",
    "content": "Great first day @everyone . Awesome to meet many of you and can't wait to have more substantive chats in 1:1/small group settings.\n\nHere's the schedule for tomorrow:\n- Breakfast is served every day from 7a-10a on Floor 1 of the North Tower\n- First burn classes of the year at 8, 9, 10, and 11am with @undefined . Please secure a spot at cal.com/ns/burn\n- Lunch boxes and nutty puddings are usually made available to go around 11:30am/noon on Floor 13.\n- @undefined will be available in the NS Cafe (the main lobby cafe) starting from 11:30am - 12:30pm to give folks their welcome packages (SIM cards, t-shirts, bags).\n- Yash will then lead a walk from the hotel to NS Coworking at 12:35pm (you don't have to wait for him if you want to try doing the 15 minute walk on your own. Directions are below).\n- @undefined will give his opening address at 1PM at NS Coworking. Please don't be late.\n- For those who missed them, Sam and I will lead make up NS Combine sessions beginning at 3:30 PM. Sign up at cal.com/ns/combine . This will be the last combine until April 1. \n- For those who missed it today, we'll give another logistics orientation overview in 1215 at 6:15. You do not need to come again if you already came to the orientation today. \n- From now on, dinner will always be served at 6pm and will be available for two hours. \n\n\nWhen you walk to coworking, there are two ways to get there:\n1) There is the way on the street, which Google Maps can tell you if you search \"Network School\"\n2) There is another way to walk there which takes 2 minutes longer but is much more pleasant. It's a little complicated but very nice and free from cars. There is a guide here: https://youtube.com/shorts/aUC6Rwx5IO8?feature=shared\n\nGet some good sleep. Start good habits now 🙂"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-01T11:19:09.740000+00:00",
    "content": "@everyone here's a digital version of the welcome letter if you haven't received the physical copy yet. \n\nIf you checked in late and haven't received your welcome kit, come to NS cafe (at hotel lobby on level 2) at **11:30am tomorrow**. \n\nI'll be there with ns.com t-shirts 👕, wristbands <:nsvisitor:1282286427115229277>, SIM cards 📶, and NS bags 👜 ."
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-01T07:32:43.986000+00:00",
    "content": "@everyone we just completed our check-in for the group that arrived at 2pm. \n\nIf you're arriving later in the week, just call me at [+91-74054-59775](https://wa.me/917405459775) or Jackson at [+1-919 491-1947](https://wa.me/19194911947) on Whatsapp when you reach the Marina Hotel.\n\nIf you're arriving outside 8am to 8pm, please let us know at least 24 hours in advance."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-01T06:43:51.262000+00:00",
    "content": "The combine is in the gym on the third floor of the South Tower. When you exit the elevators it's to your left. \n\nSee the first batch there soon!"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-03-01T04:22:10.581000+00:00",
    "content": "@everyone once you check-in at NS Lobby, head up to the 13th floor to grab lunch. \n\nVegan bowls on the left 🫑, meat bowls on the right 🥩, and nutty puddings at the bottom<:nutty_pudding:1275475283201233047>."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-03-01T02:54:26.224000+00:00",
    "content": "For the bus folks, I’m at the T1 bus stand near MaMum to go. Look for the white hair and black shirt."
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-02-28T18:12:21.894000+00:00",
    "content": "@everyone A few quick to-dos for the first day of Network School 🏫 \n\n1) **Check group details** 🤝 \n\nYou should be in a channel with your group lead. Make sure you've friended your group lead on Discord. They are your point of contact on the NS Core team and can help with any queries. If you don't a see group channel, DM me @undefined and I'll get you added to the right group. \n\n- <#1344208833064603678>: Justin \n- <#1344208954414075905>: Jackson \n- <#1344209034454241301>: Sam \n- <#1344209082155929650>: Yash \n\n2) **Sign up for fitness measurements and daily workouts** 💪\n\nSign up for [NS Combine](https://cal.com/ns/combine?month=2025-03) to measure your baseline fitness. Then pick a slot for your [daily workouts](https://cal.com/ns/burn). The workouts will be accessible to all so don't worry if you haven't been to the gym in a while — @undefined will help you get started on your fitness journey.\n\n3) **Review the orientation guide** 📒 \n\nTake a look at the orientation guide at [ns.com/wiki](https://ns.com/wiki). It has information to help you get settled in. We'll update the wiki periodically to answer FAQs. \n\nSee y'all soon in just a few hours!"
  },
  {
    "userName": "balajis",
    "timestamp": "2025-02-27T13:23:42.304000+00:00",
    "content": "@everyone Network School v2 kicks off in just a few days!\n\nHere's the schedule for March 1 by the hour:\n\n- 11am: Check-in with NS staff at Changi Airport if opting for group transport by DMing @undefined\n- 12pm: Depart for Network School with the bus\n- 2pm: Arrive at Forest City Marina Hotel, check-in to your rooms, relax for a bit (NS Lobby)\n- 3pm: Measure baseline fitness at the NS Combine — sign up for a slot between 3-5:30pm [here](https://cal.com/ns/combine?month=2025-03) (NS Gym 3)\n- 6pm: Learn how to make the most of your NS experience (Room 1215)\n- 7pm: Enjoy healthy dinner (NS Cafe 13)\n\nThe opening address will be at 1pm on March 2 at [NS Coworking](https://maps.app.goo.gl/sKdrVb4ZHKmVaiqo7). \nThe NS core team has been working hard to upgrade the facilities for v2.\nWe're looking forward to welcoming you!"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-02-26T09:49:31.866000+00:00",
    "content": "Hi @everyone\n\nIf you answered \"yes\" to our [poll](https://discord.com/channels/900827411917201418/1278081815139188817/1339949766552850584) about needing a bus from Changi Airport to Forest City on March 1 at 12pm, then this message is confirmation that you have secured a free seat on the bus.\n\n**In order to board the bus, you MUST complete the following steps:**\n1) Send me a message ASAP on Whatsapp +1 (919) 491 1947 with your name and Discord handle. \n2) Fill out the onboarding form that has been emailed to you\n3) Bring your passport\n4) Complete the [Malaysia Digital Arrival Card](https://imigresen-online.imi.gov.my/mdac/main), which you will be able to do beginning tomorrow. Our bus number is PD206M when the form asks you.\n5) Respond in [this thread](https://discord.com/channels/900827411917201418/1284425829387862087/1342733437466841118) if you need additional documents to enter Malaysia (based on your passport)\n\nOnce you've done all that, meet me at the [T1 Coach Stand](https://maps.app.goo.gl/FdTcZNPVNBoHRjSp9?g_st=aw) no later than 11:45am on March 1 (come a little earlier if you can). I'll be wearing a black NS.com t-shirt and am the palest person in Asia, so you can't miss me!\n\nSo excited to meet you all and start the v2 year off strong 😎\n\nIf you did not fill out the poll prior to this message, there MIGHT still be space on the bus for you. You must message me on WhatsApp to find out. Spots will be allocated allowed on a first-come, first-served basis."
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-02-22T05:43:18.273000+00:00",
    "content": "@everyone please complete the requirements below to ensure smooth travel to the Network School. Excited to see everyone irl in a week!  \n\n1) 📩 **NS Onboarding**. We emailed all confirmed admits an onboarding form link. Complete this form at the earliest so we can prepare for your arrival. \n\n2) 🚌 **Group Transport**. Complete this [poll](https://discord.com/channels/900827411917201418/1278081815139188817/1339949766552850584) if you plan to join the group transport from Changi Airport to Network School on March 1 at 12pm. You must submit the onboarding form to be able to check-in to the bus. \n\n3) 🇸🇬 **Singapore Arrival Card**. If you are transiting via Singapore, complete the [Singapore Digital Arrival Card](https://eservices.ica.gov.sg/sgarrivalcard/) within 3 days of your planned entry into Singapore. You must also ensure that you meet the [entry requirements](https://www.passportindex.org/country/singapore/) and have a Singapore visa if necessary based on your passport.\n\n4) 🇲🇾 **Malaysia Arrival Card**. All members must complete the [Malaysia Digital Arrival Card](https://imigresen-online.imi.gov.my/mdac/main) within 3 days of your planned entry into Malaysia. You must also ensure that you meet the [entry requirements](https://www.passportindex.org/country/malaysia/) and have a Malaysia visa if necessary based on your passport. Note: 99% of the world can enter Malaysia visa-free but everyone is still required to submit the arrival card. \n\n5) 📜 **Additional Documents**. Check with online resources and your local Malaysian embassy If you require additional documents to enter Malaysia. Some nationalities may require hotel booking and/or invitation letter. Respond in this [thread](https://discord.com/channels/900827411917201418/1279113199509180447/1279113200662610018) if you need these documents. \n\n6) 🎫 **Return Tickets**. We recommend having a copy of your return tickets handy. Malaysian Immigration asks for return tickets and additional documents only some times (depending on the port of entry and the officer) but you may be denied entry if you can't provide them. Some websites and airlines that allow booking fully refundable tickets if you want to keep your travel plans flexible. \n\n7) 🛂 **Digital Nomad Visa**. If you're planning to stay at the Network School long term, learn about the Malaysia Digital Nomad Visa and start your application soon because it may take up to 8 weeks to hear back. More information in the [Network School Wiki](https://ns.com/wiki). \n\nFinally, as you get ready for the Network School, turn on notifications for ⁠the <#1284425829387862087> channel to stay in the loop 🔔 And as always, DM me @undefined or @undefined if you have any private questions."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2025-02-21T17:54:17.485000+00:00",
    "content": "For v1 folks who were here last fall:\n\nNucleus will be releasing the results from the DNA tests we did during the week of March 10 (likely on March 10th itself, exact time/day to be confirmed).\n\nWe will also set up a global Zoom call (for v1 members only) with a rep from the Nucleus team immediately after results are released so that they can share pro tips on understanding your results and so that we can all reflect on results/implications together (sharing results is, of course, optional as results will obviously may include some private information).\n\nI'm psyched! 🧬"
  },
  {
    "userName": "yashluna",
    "timestamp": "2025-02-15T17:14:13.622000+00:00",
    "content": "@everyone Balaji just sent an important email about Network School v2.\n\nThe TLDR is that Network School v2 is frontier, not fancy. Our goal is to build a startup society that bootstraps other startup societies. And our governance is technodemocracy. \n\nWe have two onboarding Zoom calls to talk through the details including potential testnet cryptoeconomics — one at [11:59 PM SGT on Feb 17](https://zoom.us/meeting/register/-zbHSkT1TcepG6fXviiLfA) (Americas, Europe) and another at [1 PM SGT on Feb 18](https://zoom.us/meeting/register/pYuqR_8KTRuYCImensYjxQ) (Asia).\n\nSign up using the links above for the time slot that works best. We're looking forward to seeing you."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-12-24T09:44:53.965000+00:00",
    "content": "@everyone Thank you all for coming to the first Network School. You were pioneers, and helped build something great. In due course, we'll post a recap and an update on v2. For now, please enjoy a very Merry Christmas and Happy New Year!"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-19T10:29:25.179000+00:00",
    "content": "Win forum is in the ping pong room in 5 min"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-19T07:53:01.726000+00:00",
    "content": "Submit your win forum slides before 6:30 please"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-18T07:42:24.716000+00:00",
    "content": "Hey @everyone , just a reminder that our final talk of the cohort is at 6pm today in the ping pong room with AI researcher Rich Sutton.\n\nWe will still have win forum tomorrow too."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-16T04:56:32.351000+00:00",
    "content": "@undefined ‘s event with Longhash Ventures has been moved to the ping pong room!"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-12-15T13:46:53.712000+00:00",
    "content": "@everyone I hope everyone enjoyed the closing dinner last night! A good number of folks are heading home for Christmas and New Year’s, so we have no lectures on Monday or Thursday. Our last talk for the quarter will be a fireside chat on **Wednesday the 18th at the 13th floor club room** with eminent AI researcher Rich Sutton, tentatively at 6pm. See you then.\n\nPS: please book a feedback interview with Jackson if you have not already done so at https://cal.com/jackson/ns-exit-interview"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-14T19:05:23.133000+00:00",
    "content": "Please book an exit interview with me here https://cal.com/jackson/ns-exit-interview"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-13T09:59:37.769000+00:00",
    "content": "📣🎈Join us for the NS Closing Dinner tomorrow night! 🎈📣\n\n**When: **12/14, at 6 PM in the floor 1 restaurant space (where we did Thanksgiving)\n\n**What: **Dinner and awards followed by games, dance, pool party! \n\n**What to wear: **Dress code: Fancy -> Funtier (dress fancy for dinner and change later for pool party dance ready)\n\n@everyone  Don’t forget to submit your votes for superlatives and photos for the slideshow (links are in my announcment above)!\n\nMessage Dawn, Alyssa, Hanna, Aaron, Mitch, Agastya, Nastya, or myself if you'd like to contribute to making the night special"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-12T10:58:04.071000+00:00",
    "content": "Hey @everyone \n\n1) Please use this form to vote for superlatives: https://docs.google.com/forms/d/e/1FAIpQLSe7_Qt-x3kKbv8uDIo4O1YkRY25Ff6YtalHU84ZtX-iFpYKRg/viewform?usp=sharing\n\n2) Please share your NS photos here: https://drive.google.com/drive/folders/1djmr_CctPRJCI3CJ56ewGpf4FFr4GSRn?usp=sharing"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-12T10:26:22.690000+00:00",
    "content": "See you in 1215 in 5 minutes"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-12-12T06:26:21.272000+00:00",
    "content": "Many of you have asked, so please go to https://bit.ly/nsextend if you want to stay beyond Dec 23 and/or come back for cohort 2."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-12-11T17:26:48.963000+00:00",
    "content": "@everyone We will have Zach Milburn, the founder of NOMAD speaking at 1pm at NS Coworking today. Here are some of the amazing renders of his buildings. You can see more at https://nomadnation.co and at **1pm at NS Coworking**."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-09T14:23:02.132000+00:00",
    "content": "Hey @everyone - we're shipping the rest of the genome kits tomorrow at 11a. If you haven't given yours back to me yet, please Whatsapp me at +1 919 491 1947 asap"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-12-08T20:45:50.056000+00:00",
    "content": "@everyone Hi all, today at 1pm we’ll talk about the last two weeks of this cohort and what we plan to do for the next one. By popular request I’ve also opened up office hours afterwards at https://cal.com/ns/officehours as well.\n\n**Agenda**\n\n•  1-2pm at NS Coworking for a talk\n•  2-3pm for informal discussion at coworking\n • 3-9pm at hotel lobby for office hours by appointment (cal.com/ns/officehours)\n\nSee you there."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-05T09:52:31.143000+00:00",
    "content": "See you at room 1215 at 6:30 for the win forum @everyone"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-04T16:32:12.990000+00:00",
    "content": "A reminder for @everyone that tomorrow’s lecture is earlier than usual - at 11am. \n\nAlso submit your slide for the win forum at ns.com/wins"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-12-02T17:55:08.594000+00:00",
    "content": "A few extra special one-time events this week to highlight!\n\n1.  Glady (Dec 3) and Dawn (Dec 4) are having a birthday party tomorrow! https://lu.ma/h8uue3sy\n\n2. Em is back in town for a few days to lead a one-time session about how to identify and use your super powers: https://lu.ma/3h9gcvji\n\n3. @undefined is hosting an epic Malaysian ⚽️ experience on Sunday, complete with a hummer tour of the stadium 🤯 before dinner and a game. Definitely going to be an epic event for those who are able to make it. Read more about the details here https://lu.ma/3fn0eder"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-12-02T01:44:33.823000+00:00",
    "content": "@everyone We have no talk today given the long Thanksgiving weekend. But on Thursday at 11am we have Ryan Petersen, the founder of $8B Flexport, coming to speak. **See you at NS Coworking on Thursday at 11am!**"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-28T11:23:25.972000+00:00",
    "content": "Win Forum moved to Ping Pong room at 8. Please help clean up from Thanksgiving"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-28T09:33:31.016000+00:00",
    "content": "@everyone \n\nThe hotel has generously offered us the Floor One (not 2) restaurant space for our special friendsgiving tonight at 6pm.  This is the restaurant space next to the swimming pool - it’s under where we have breakfast. \n\nPlease submit your slides for the win forum at ns.com/wins\n\nWe'll start the win forum closer to 7:15 in the ping pong room after Friendsgiving in the floor one restaurant."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-27T17:16:14.393000+00:00",
    "content": "@everyone We have a guest talk on Thursday at 1pm by Alexander Cortes (https://x.com/aja_cortes) and Preethi Kasireddy (https://x.com/iam_preethi). They have hundreds of thousands of followers for their health content, and are building a new health startup that I think is pretty cool. **See you at NS Coworking at 1pm!**"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-11-25T06:29:18.063000+00:00",
    "content": "@here Use code #nsnov25 on [sli.do](https://sli.do) to ask questions for today's talk."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-24T15:50:05.762000+00:00",
    "content": "@everyone See you all tomorrow at 1pm at NS Coworking. We will talk through scenarios for the future, cryptocredentials, and ideas for the next year."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-22T07:21:26.574000+00:00",
    "content": "Here's the tank top for the top NS Burners in the 30 day sprint 🙂  Thanks to @undefined @undefined @undefined @undefined and everyone for their effort here!"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-22T07:20:15.062000+00:00",
    "content": "Scroll all the way down to ns.com/profile to see your personal leaderboard"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-22T07:19:31.518000+00:00",
    "content": ""
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-22T07:18:47.816000+00:00",
    "content": "**NS Burn: Sprint to December 23 **\nSo far we’ve collected 1788 proof-of-workout NFTs, completed 300+ classes, and had 10 people with very significant before-and-after transformations from NS Burn. Now, for the last 30 days of this Network School cohort, we want to finish strong.\n\nSo here’s what we’re doing.\n\n1) First, we have a new fitness leaderboard thanks to @undefined. It’s accessible here (https://ns-burn-ef7091de383b.herokuapp.com) and also at your NS profile. Just log in to ns.com, go to ns.com/profile, and scroll down to see it.\n\n2) Second, you can get a workout buddy to drag you to workouts. Just ping @undefined  and she’ll get you one.\n\n3) Third, we have a limited edition NS Burn tanktop that we’ll be awarding to the people that finish strongest in the next 30 days, starting today. That means the highest rate of NFT completion from Nov 22 to Dec 23 🙂\n\nWe’ve attached some photos below. Let’s finish strong!  @everyone"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-21T10:28:20.810000+00:00",
    "content": "Hi @everyone , due to some light rain, we are moving to the ping pong room for the win forum"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-21T05:46:19.816000+00:00",
    "content": "@here you can use #nsnov21 on sli.do to ask Parag questions"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-20T18:06:12.885000+00:00",
    "content": "@everyone We will have a talk by 3-time bestselling author Parag Khanna at 1pm Thursday at NS Coworking. He’s collected a large amount of data on digital nomads, remote work, and the changing world. **See you at 1pm at NS Coworking.**"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-20T05:40:24.744000+00:00",
    "content": "Submit your slides for this week's Win Forum by 6PM tomorrow. Instructions at ns.com/wins"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-18T18:32:49.249000+00:00",
    "content": "@everyone One more slight change: we will start the fireside at 12pm Tuesday at NS Coworking as the Base team needs to get to the airport after.\n\nSee you at **12pm at NS Coworking!**"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-17T18:27:46.103000+00:00",
    "content": "@everyone Slight change of plan. Coinbase’s whole Base team including the head of USDC will be coming out *tomorrow* (Tuesday) at 12:30pm to NS Coworking. They just crossed 1B transactions and are one of the leading chains in the world so there is much to learn from.\n\nSo, we will cancel the Monday 1pm talk and instead see you on **Tuesday at 12:30pm at NS Coworking.**"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-17T12:06:41.150000+00:00",
    "content": "@everyone See note below. We have the full Base team coming to NS Coworking on Tuesday at 12:30pm so will move the talk to then. Your Monday is now clear. See you on Tuesday at 12:30pm.\n\n~~Ok folks, we have a new talk tomorrow at 1pm at NS Coworking. My friend Jesse Pollak, lead developer of Coinbase’s Base is also in Singapore and will be coming by this week for a fireside chat (time for that is TBD and will confirm soon).\n\nWe are going to power up now that devcon is over. We want to focus in particular on getting max effort out of NS Burn and finishing strong over the last 30 days. We also have new tutorials. More tomorrow at 1pm!~~"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-14T05:13:25.621000+00:00",
    "content": "@everyone Ok, one more change of time. Olaf’s flight has been delayed further so he’s only going to be on campus this evening.\n\nSo, no event at 2:30pm. \n\nInstead we will combine the win forum and fireside when he arrives, and move it all to **8:30pm** in the ping pong room.\n\nSo, see you at 8:30pm in the ping pong room."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-14T03:49:25.707000+00:00",
    "content": "@everyone ~~Slight change of timing; we will do the fireside chat with Olaf at 2:30pm (not 1:30pm) at NS Coworking. See you then.~~\n\nOlaf flight has been further delayed so we will do it this evening at 8:30pm in ping pong room. See below."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-13T16:05:24.906000+00:00",
    "content": "@everyone At 2:30pm (not 1:30pm) at NS Coworking we will have a fireside chat with me and my friend Olaf Carson-Wee, employee #1 at Coinbase and founder of Polychain, the first billion dollar crypto hedge fund. Come by."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-12T05:13:32.029000+00:00",
    "content": "Submit your wins for the week at ns.com/wins !"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-10T10:19:30.255000+00:00",
    "content": "@everyone New talk tomorrow at NS Coworking at 1pm. Lots of new tutorials, discussion of election aftermath, and guest appearance / fireside chat with my friend Haseeb Qureshi, GP of a billion dollar crypto fund named Dragonfly."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-11-08T03:29:09.239000+00:00",
    "content": "Good morning @everyone, a quick Burn update from @undefined https://discord.com/channels/900827411917201418/1278081815139188817/1304274649114214450.\n\nThe VO₂ Max Test has been rescheduled to November 20 (Wednesday) because many members are traveling this week for Devcon. \n\nSign up here: [cal.com/ns/vo2-test](https://cal.com/ns/vo2-test)."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-07T08:10:42.898000+00:00",
    "content": "Hey @here, use #nsnov7 on slido.com to queue your questions for Shaleish"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-06T17:51:02.069000+00:00",
    "content": "Hey @everyone , don't forget to submit a slide to the Win Forum this week!\n\nMeet at room 1215 at 6:30 - you can bring your food if you'd like.\n\nCreate a slide based off of this template ns.com/win-template\n\nSubmit a link to your Google Slide at ns.com/wins\n\nEvent: https://lu.ma/sm26dl1i"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-06T14:13:19.574000+00:00",
    "content": "**Sequoia India / Peak XV talk on Thursday at 4pm**\n\n@everyone  We will have our talk tomorrow at 4pm (not 1pm) at NS Coworking. The talk is by Shailesh Lakhani, my friend and a partner at what was formerly known as Sequoia India (now Peak XV). Come by to learn about the frontiers of Indian tech!\n\nhttps://www.peakxv.com/people/shailesh-lakhani/"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-06T05:00:49.090000+00:00",
    "content": "Hey all, please help @undefined out. \n\nIf you have a Xiaomi brand dehumidifier and/or Xiaomi air purifier in your room, can you snap a pic of the serial number(s) and send to Jonny Bates along with your room number? \n\nXiaomi dehumidifier - serial number is inside the slot for the water tray (good reminder to empty the tray daily)\n\nXiaomi air purifier - serial number is on the bottom."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-11-04T12:32:50.536000+00:00",
    "content": "**NS Burn: Focused Workouts and Endurance Benchmark**\n\nIt's time to turn up the heat 🔥\n\n1) **Weekly Workouts.** Starting tomorrow, we're rolling out a weekly workout schedule focusing on specific muscle groups to zero in on those gains. Check it out at [ns.com/burn](https://ns.com/burn).\n\n2) **VO₂ Max Test.** But that's not all. After 6 weeks of working out everyday, we'll add a new benchmark to our fitness journey: the VO₂ Max Test. Let's see how our endurance stacks up. Schedule your test for Friday, Nov 8 at [cal.com/ns/vo2-test](https://cal.com/ns/vo2-test) @everyone.\n\nLet's keep the momentum rolling!"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-11-04T05:33:10.061000+00:00",
    "content": "New format for our town halls that we are trying this week: Introducing the Win Forum 🏆\n\n1. On Thursday, we'll meet on the balcony of room 1215, assuming there is no rain (otherwise we're back to the ping pong room).\n2. Inspired by Elon's \"What did you get done this week?,\" submit a win that you had personally or a win that you made happen for NS.\n3. Create a slide based off of this template ns.com/win-template\n4. Submit a link to your Google Slide at ns.com/wins\n5. Share about your win for about 1 minute during the forum."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-11-03T15:02:41.931000+00:00",
    "content": "1pm Monday at coworking: new talk with new tutorials and new bounties. We'll also award some prizes. See you then."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-30T16:39:21.298000+00:00",
    "content": "**1pm: Ryan Johnson, CEO of Culdesac ($30M raised from Khosla, Rabois, me)**\nThe CEO of Culdesac (culdesac.com) will be speaking tomorrow at 1pm at NS Coworking. They've raised $30M from me, Founders Fund, Khosla Ventures, and the cofounder of Lyft to build a from-scratch walkable community in Arizona. @undefined will be introducing Ryan and also holding the community forum later in the day at 6:30pm.\n\nPS: more about Culdesac: https://culdesac.com/blog/post/announcing-our-30m-series-a"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-29T02:58:18.739000+00:00",
    "content": "**NS Interviews**\nOK, holding NS interviews for the next few days to figure out how people can contribute, mostly as volunteers (1h/week). They're at https://cal.com/balajis/interview. I opened up a few more slots."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-29T02:40:57.529000+00:00",
    "content": "Also if you have an extra room key, can you please bring it to the lobby at 11?"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-29T02:18:21.550000+00:00",
    "content": "Almost done. NT Floor 11 - please leave your rooms with your things packed"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-27T21:22:18.456000+00:00",
    "content": "**The Network State is About Real Estate** \n1pm today: important talk at NS Coworking. We'll recap the last month and describe the path forward. See you then."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-27T03:10:02.085000+00:00",
    "content": "The water disruption has been rescheduled @everyone. \nhttps://discord.com/channels/900827411917201418/1284425829387862087/1298933982557376542\n\nIt was previously supposed to be on October 28. Tentatively, it is now planned for November 13. \n\nWe'll send out an announcement a few days prior to the planned water disruption so members are aware and can plan accordingly."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-24T10:23:17.752000+00:00",
    "content": "We will be starting the community forum at 6:30pm in club13"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-24T08:59:54.468000+00:00",
    "content": "Hey @everyone, we have an important notice:\n\n**Water supply in Forest City will be disrupted from Monday 9am (Oct 28) to Tuesday 8am (Oct 29).** \n\nOur reserve tank will be prepped so we'll have water supply during the disruption. But please channel your inner cactus during these 23 hours and use water judiciously 🌵 \n\nWhen water supply is back to normal, any yellowish water is temporary and will clear after a quick tap run."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-24T05:50:10.732000+00:00",
    "content": "🚨 $10k in new prizes available now at https://ns.com/learn"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-24T01:51:14.038000+00:00",
    "content": "We’re on the first floor of coworking with oz today\n\n🧬 genome test reminder for later: don’t eat or drink water for 45 min before your test at 8pm 🧬"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-23T17:26:09.840000+00:00",
    "content": "🧬  Hey @everyone - for folks who still need to do their genome sequencing test, we'll do it tomorrow in Cafe 13 at 8pm. If you have already done your test and need to bring me the sample, please bring it at 8pm tomorrow as well. Thanks! 🧬"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-23T14:00:25.982000+00:00",
    "content": "1) Tomorrow’s talk in NS Coworking at 1pm will cover bounties, tutorials, maintenance, and more.\n2) We’ll then hand the floor over to Ozan Onay for the next session in his amazing computer science tutorial till 3:30pm or so.\n3) Next I will hold walking office hours at 4:30pm in the NS Lobby which you can book at cal.com/ns.\n4) At the end of the day we will have a community forum at 6:30pm in the club room on floor 13.\n\nSee you then 🙂"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-23T01:44:04.177000+00:00",
    "content": "“Do 10x engineers exist? How about 1000x engineers?” Lecture is underway with @undefined 🔥"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-23T01:43:08.154000+00:00",
    "content": "**OCT 23 — DAILY DOWNLOAD**\n\n__CS Workshops__\n\nThe interactive CS workshops with Oz Nova of csprimer.com are starting now at NS Coworking @everyone. See the full schedule here:https://discord.com/channels/900827411917201418/1284425829387862087/1296691526063099944\n\nHere's what @undefined says about his experience with these workshops: *\"I highly recommend y'all to go to Oz's session. He is probably one of the best CS educators you will ever run into in your whole life, online included.\"* https://discord.com/channels/900827411917201418/1278081837780041749/1297123788881657856"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-21T07:36:09.668000+00:00",
    "content": "For those who were not at lecture, today's surprise was a free genome sequencing test from mynucleus.com ! Huge shoutout to their CEO, Kian (who was here on opening day). Each test is normally $399 but he sent us 150 of them for free because he's a legend and because he is so bullish on NS.\n\nIf you were NOT at lecture, please DM me your email and DOB for your kit. Please do this ASAP.\n\nIf you were at lecture but you did not get a kit, you should have come to me in line with that same information. DM me if you didn't do that ASAP\n\nIf you have any photos/videos of your Nucleus sampling experience, please send them to me!\n\nWe will set up another session for those who still need to do their sequencing. I need to wait to schedule this until the Nucleus team can ingest the 20 or so people who need new tests. We'll probably do something tomorrow night or Wednesday morning."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-21T03:58:43.861000+00:00",
    "content": "@everyone Hey folks, today's talk will start at 1:15pm at NS coworking (not 1pm). We will also have a special surprise, so do come 🙂"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-18T04:29:11.177000+00:00",
    "content": "**NS Learn: CS workshops with Oz Nova**\n\nCalling all devs! \n\nOz Nova of csprimer.com is running a series of intensive interactive workshops, designed for software engineers to level up on systems-focused computer science. Participants are expected to be confident programmers (in any language) but no formal computer science background is required. We'll be solving real systems problems and packing as much useful CS knowledge as we can into five high energy sessions.\n\nJoin this thread to say hello to Oz who is joining us in person next week: https://discord.com/channels/900827411917201418/1278081837780041749/1296691392558661735. You can also ask him any clarifying questions as you warm up for the workshops. All sessions will be at NS Coworking 2 on Oct 23 and Oct 24.\n\nSign up using the links below @everyone. It's time to code. \n\n__Wednesday__ (Oct 23)\n- 9:30-11:30am: https://lu.ma/ahjq1uxq\n- 1-3pm: https://lu.ma/f310u0pm\n- 4-6pm: https://lu.ma/i34qtbdm\n\n__Thursday__ (Oct 24)\n- 9:30-11:30am: https://lu.ma/10glzot9\n- 1-3pm: https://lu.ma/n9ksy4gv"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-17T07:14:09.454000+00:00",
    "content": "Hey @everyone ! \n\nThanks for all your good questions and feedback regarding food and the meal plan 2.0! \n\nGive us a bit to process some of your good ideas and try to implement something that works for everyone by Sunday night. My favorite suggestion was \"public lashing for people who haven't paid for meals\" but we're constrained by international law and a commitment to non-violence as a fundamental principle 😉 \n\nMy DMs are open if you have further suggestions/feedback on food v2 plan. Regardless of final implementation, do get excited for the lunches - they're getting a serious upgrade and are very yummy!  We'll find a way to make the offering types work for everyone as we continue to iterate from v1 to v2 to v3. Our priority is to feed you healthy, tasty food without losing money indefinitely 🙂 \n\nIf you're ready to buy a all-inclusive meal plan, you can go to ns.com/food \nMeanwhile, you can pay for food for the rest of this week at https://ns.com/food-v1"
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-17T05:48:37.888000+00:00",
    "content": "Hey @here , to ask questions today, visit slido.com and use the code #nsbalaji"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-17T05:26:42.861000+00:00",
    "content": "**NS Burn: Meal Plan v2 **\n\nWe're rolling out meal plan v2 starting Monday (Oct 21):\n\n1) **Weekly subscription model.** We've transitioned to a weekly meal plan subscription priced at $175, running from Monday to Sunday. This promotes a default healthy lifestyle by providing consistent access to nutritious, Blueprint-compatible food for all your meals and supports your fitness goals by taking out the hassle of daily decisions.\n\n2) **From fridge to fresh.** We've updated the meal plan to offer hot boxed lunches and hot catered dinners, replacing some of the previous refrigerated grab-and-go options. The daily menu includes a nutty pudding at 10:30am, a hot lunch at 12pm, and a hot dinner at 6pm.\n\nSubscribe at https://ns.com/food for next week's meal plan by 12pm on Sunday (Oct 20) and get your meal plan wristband from @undefined at 5pm at the gold desk outside NS Club 13.\n\nBefore the meal plan v2 kicks off on Monday, use https://ns.com/food-v1 to buy food from NS Cafe 13."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-17T03:41:47.314000+00:00",
    "content": "**OCT 17 — THE DAILY DOWNLOAD**\n\n__Thursday Lecture__\n\nBalaji will give a talk and share more tutorials today at NS Coworking at 1pm @everyone. \n\n__Bottles and Mugs__\n\nIf you ordered NS bottles or mugs from https://ns.com/store, collect them from NS Core team after the lecture at coworking. Choosing reusable bottles and mugs means less microplastics in our bodies and a cleaner environment."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-15T23:59:20.857000+00:00",
    "content": "**OCT 16 — THE DAILY DOWNLOAD**\n\n__Movie Night__ \n\nThis week's movie night features *The Lives of Others* — a gripping drama set in 1980s East Berlin that explores the impact of state surveillance on human relationships and individual conscience.\n\nIt will be at 7pm this Saturday in Club 13, Room 1 (aka ping pong room). Sign up at https://lu.ma/l4uy4v8d.\n\n__Room Cleaning__ \n\nTo minimize your environmental impact, you can choose to not have your room cleaned on certain days. Simply leave the *Do Not Disturb* button on to indicate you don't need cleaning. When you want your room cleaned, you can turn it off."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-15T09:32:10.791000+00:00",
    "content": "**NS Burn: Weekly Progress Tracking**\nWe’re moving into our fourth week of NS Burn and about to pick up the pace. Two quick notes from @undefined:\n\n1) **Weekly progress tracking.** We’re now setting up _weekly_ progress tracking, beginning with progress photos, weigh-ins, and waist measurements. The first one will be on Thursday Oct 17, right after your cal.com/ns workout. So if you’re coming at 8am, work out till 8:45am, and then line up for your progress photo and weigh-in in the back corner of gym3.\n\n2) **High intensity and low intensity workouts.** We will keep higher intensity workouts in gym3, with sprints on Mondays/Thursdays and lifting on the other five days. And we also began low intensity workouts last week, led by Trish in gym1 on Wednesday/Fridays at 8:30am and 9:30am, for stretching and recovery.\n\nSo, come by on Thursday for your progress tracking!"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-14T18:38:08.819000+00:00",
    "content": "**More tutorials on Tuesday but no NS talk**\n\nHi all, hope you are enjoying the new tutorials at https://ns.com/learn \n\nWe will drop more content at 1pm on Tuesday Oct 15 but we will not have another talk after all (I felt it would be overkill after Monday).\n\nHowever I will be in Discord to discuss. And then the next talk(s) will be on Thursday Oct 17."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-14T08:37:47.783000+00:00",
    "content": "Friendly reminder to pay for your meals at ns.com/food (this includes dinners and any grab&go blueprint options).\n\nWe can see who has and who hasn't been paying for meals.\n\nSoon we will roll out a more comprehensive meal plan. Until we have that infrastructure ready, please don't make us chase you down for payment 🙂"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-14T04:58:23.319000+00:00",
    "content": "Hey folks. We will start the talk at 1:10pm. See you soon. Be careful in the rain!"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-14T02:57:10.653000+00:00",
    "content": "Balaji's lecture today will be at NS Coworking at 1pm @everyone."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-12T01:40:21.668000+00:00",
    "content": "**OCT 12 — THE DAILY DOWNLOAD**\n\n__Community Forum__ 🏛️ \n\nNS Core will host a weekly community forum on Thursdays at 6:30pm in NS Club 13, Room 1 (aka Ping Pong room). Sign up for the first instance here: https://lu.ma/zta02wc0 @everyone. \n\n__Laundry Pickup Rescheduled __ 🧺 \n\nAngie’s Laundry is scheduled for pickup today at 1pm instead of at 10am. This time change is just for today. Starting Monday, Angie will resume daily pickup at 10am Monday through Saturday."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-11T08:32:36.790000+00:00",
    "content": "**OCT 11 — THE DAILY DOWNLOAD**\n\n__Blueprint Products__ <:DontDie:1177808633032097902> \n\nNS members get a 10% discount on Blueprint products listed at https://blueprint.bryanjohnson.com. \n\nFill out this form if you're interested: https://forms.gle/PrLW5PE1Fs3VLjXW6. And DM @undefined if you have any questions.\n\n__Movie Night __  🎬 \n\nCome get some healthy snacks and watch *Limitless* tonight at 9pm at NS Coworking 2."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-10-10T08:28:30.897000+00:00",
    "content": "@here If you have a question for eli, please add it to slido.com with the code #nseli"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-10T07:44:10.494000+00:00",
    "content": "@everyone Please come to NS coworking today at 4pm. In addition to our talk by Eli Ben Sasson we have Arifah Sharifuddin the head of Malaysia digital nomad visas here in person. Come say hi!"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-10T00:23:55.927000+00:00",
    "content": "**OCT 10 — THE DAILY DOWNLOAD**\n\n__Guest Lecture__ \n\nEli Ben Sasson, co-founder of Starkware, will give a guest lecture today on zero knowledge at 4pm at NS Coworking @everyone.\n\n__Proof-of-Fun__ \n\nMembers who hosted community events with an average rating of ≥4 stars from ≥4 attendees received their proof-of-fun NFTs yesterday. Check out event hosting tips at https://ns.com/host and organize events to get your Fun NFTs.\n\n__Lost and Found__ \n\nThe gold desk across the \"Network School\" sign on the 13th floor has a lost-and-found bag. You can also post about items you find or lose in the lost-and-found thread https://discord.com/channels/900827411917201418/1290337644924112988."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-09T10:11:42.565000+00:00",
    "content": "**4pm tomorrow: Eli Ben Sasson, cofounder of Starkware ($8B) and coinventor of zkStarks and Zcash**\n\nTomorrow at 4pm we have a talk by my friend Eli Ben Sasson, one of the world leaders in zero knowledge. ZK is perhaps the most important development in cryptography over the last ten years and is worth learning about if you haven't heard of it. Vitalik and I think of it as comparable to the transformer in AI, just a foundational technology that keeps delivering new unlocks.\n\nCome to NS Coworking tomorrow at 4pm to hear from him!\nhttps://lu.ma/2dpee5ow"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-08T02:31:42.506000+00:00",
    "content": "**OCT 8 — THE DAILY DOWNLOAD**\n\n__Updated NS Coworking Hours__ ⏲️ \n\nStarting today, NS Coworking will be open from 8am to 10pm daily @everyone.\n\n__NS Weekly Movie Nights__ 🍿 \n\nWe're kicking off weekly movie nights at Network School with *Limitless*. \n\nRegister at https://lu.ma/cd25w7tc to glimpse a future where humanity pushes its limits through technological enhancement. \n\nLocation: NS Coworking 2\nTime: Friday 8pm (Oct 11)"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-07T01:00:58.496000+00:00",
    "content": "**OCT 7 — THE DAILY DOWNLOAD**\n\n__Weekly Lecture__\n\nBalaji's lecture will be at NS Coworking at 1pm @everyone.\n\n__Burn Leaderboard__\n\n Burn Leaderboard v1 is on display at NS Gym 3. Great work @undefined. Workout and get your proof-of-burn NFT to get on the leaderboard. \n\nThere are still 3 sessions today — 9am, 10am, and 11am. Schedule your burn workout at https://cal.com/ns/burn-workout.\n\n__Community Events__\n\n- 4:00pm: Investment & Trading Club (NS Club 13 Room 1) https://lu.ma/12l4ksde\n- 5:30pm: Vipassana Guided Meditation (NS Lobby Conference Room 2) https://lu.ma/v6ho2g89\n- 5:45pm: Animal Flow (Meet by Marina Hotel Pool) https://lu.ma/l12bwp9p\n- 8:00pm: Poker Night (NS Club 13 Room 1) https://lu.ma/vhfwfxjo"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-07T00:03:58.541000+00:00",
    "content": "Will be giving a talk today at 1pm at coworking. See you then."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-04T00:57:48.551000+00:00",
    "content": "**OCT 4 — THE DAILY DOWNLOAD**\n\n__Color-coded Weights__\n\nThe NS Gym 3 dumbbells now have stickers to easily identify the different weight types @everyone.\n\n- Light: green, blue \n- Medium: orange\n- Heavy: white \n\n__Community Events__\n\n- 11:00am: Animal Flow (NS Gym 3) https://lu.ma/803bbv6w\n- 2:00pm: Cursor Coding 101 (NS Club 13) https://lu.ma/h5vqcx84\n- 2:30pm: NS Playgroup (NS Club 13) https://lu.ma/h7ca9twd\n- 3:00pm: DeFi Workshop (pt.2) (NS Cafe 13) https://lu.ma/9ti5pfkg\n- 4:30pm: Battle of the Minds: Sci-Fi & Futurism Quiz (NS Club 13 Room 1) https://lu.ma/gs466uu8\n- 5:30pm: Vipassana Guided Meditation (NS Lobby Conference Room 2) https://lu.ma/2i81adom\n- 6:00pm: Beach Run (Marina Hotel, Floor 1 Pool) https://lu.ma/nkam6fzm\n- 8:00pm: Karaoke Friday (NS Club 13 Room 1) https://lu.ma/nxpd5um7"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-03T00:43:38.479000+00:00",
    "content": "**OCT 3 — THE DAILY DOWNLOAD**\n\n__Guest Lecture__\n\n- Topic: Building a Country-Scale Economy\n- Faculty: Kevin Aluwi, Founder of Go-Jek\n- Time: 1:00pm\n- Location: NS Coworking 2\n\n__Community Events__\n\n- 4:00pm: Fundraising 101 (NS Coworking) https://lu.ma/wme3qd2r\n- 5:30pm: Vipassana Guided Meditation (NS Lobby Conference Room 2) https://lu.ma/e2w6k2w6\n- 5:45pm: Animal Flow — Sunset Golden Hour (NS Gym 1) https://lu.ma/o8ul8s52\n- 8:00pm: GitHub and hosting your personal website (NS Club 13 Room 1) https://lu.ma/qw0urtb5"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-02T14:07:48.298000+00:00",
    "content": "**MOVED BOOKING TO CAL.COM/NS**\nWe moved our NS Burn booking URL to https://cal.com/ns\nGo there to book your slots!\n\nNOTE: bug fixed, try now at https://cal.com/ns\nPS: you can also now book slots 1 minute before, not 1h before 🙂"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-02T12:19:28.738000+00:00",
    "content": "**FAST FACTS: FREE FOOD AND FACILITY UPGRADES**\n\n__To-go Food at Cafe13__\n\nPlease help yourself to leftovers from dinner at Cafe13 @everyone. We have to-go boxes if you want Spicy Carrot Chicken or Baked Sweet Potatoes. \n\n__New Outlets at Coworking __\n\nAll desks at NS Coworking 2 are getting universal outlets. The work is still underway and planned to complete tonight. \n\nIf you'd like to see other features at NS Coworking, reach out to NS Staff."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-02T09:53:42.053000+00:00",
    "content": "**PLEASE RACK YOUR PLATES AND DUMBBELLS**\n\nIt is BAD to leave plates or dumbbells standing up in the air like the first two photos. It is GOOD to put them back on the rack."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-10-02T05:33:45.958000+00:00",
    "content": "**Founder of multibillion dollar company Go-Jek speaking tomorrow**\n\nKevin Aluwi is the founder of Go-Jek, one of the largest companies in Southeast Asia. He'll be speaking tomorrow at 1pm at NS Coworking about how he built Go-Jek into a country- scale economy from very modest beginnings. See you there!"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-02T00:54:27.667000+00:00",
    "content": "**OCT 2 — THE DAILY DOWNLOAD**\n\n__Fun__\n\nTo qualify for proof-of-fun NFTs, hosts should invite ns@ns.com as a co-host on Luma which allows us to access the attendee rating of the event. If the event has an average rating of higher than 4 stars and was attended by more than 4 people, hosts get an NFT. \n\n__Community Events__\n\n- 11:00am: Animal Flow (NS Gym3) https://lu.ma/78bjq8iy\n- 1:00pm: Network Histories Talk (NS Coworking) https://lu.ma/50ijr4xx\n- 2:30pm: Intro to Farcaster (NS Cafe13) https://lu.ma/h8eoxjn1\n- 3:00pm: Fast Video Content Creation (NS Club13) https://lu.ma/7upsmss6\n- 4:00pm: Lightning Talks (NS Coworking) https://lu.ma/gowvgqfs\n- 5:00pm: Basics of crypto (NS Cafe13) https://lu.ma/rbt5i069\n- 5:30pm: Vipassana Guided Meditation (Marina Hotel Function Room) https://lu.ma/e2w6k2w6\n- 6:00pm: Beach Run (NS Lobby) https://lu.ma/jcs6ofob\n- 7:00pm: Decoding the Brain (NS Club13 Room1) https://lu.ma/iyg4osox\n- 8:00pm: Why Public Goods Are Good (NS Club13 Room10) https://lu.ma/hadedjp6"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-01T09:53:22.674000+00:00",
    "content": ""
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-01T09:52:49.155000+00:00",
    "content": "**FEEDBACK, FIXIT, AND FOUNTAIN**\n\n__Feedback__ 🗣️ \n\nIf you haven't filled out the v2 feedback form at https://ns.com/feedback, we'd appreciate if you can take 30 seconds to complete it @everyone.\n\nIt's super short and only has two mandatory questions.\n\n__Fix it__ 🔨 \n\nThe fix it form is live at https://ns.com/fixit. Use it to submit maintenance requests for NS spaces like Coworking, Gym3, Cafe13, and others. NS Core team will triage and resolve these ASAP. \n\nFor requests regarding Marina Hotel rooms and non-NS spaces, first contact reception. But if the issue isn't resolved in a timely manner, submit the fix it form. \n\n__Fountain__ 🚰 \n\nWe have brand new water dispensers (v1) in Cafe13 and Club13 thanks to @undefined. More dispensers (v2) coming soon for Gym3 and Coworking. \n\nTo complement the dispensers and offer alternatives to the plastic bottles, we also have NS bottles and mugs that can be pre-ordered at https://ns.com/store."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-10-01T02:04:22.249000+00:00",
    "content": "**OCT 1 — THE DAILY DOWNLOAD**\n\n__Wristbanding__\n\nMajority of the NS Members have been verified and have their wristbands. If you didn't get verified yesterday, DM me at @undefined to coordinate and get your wristband.\n\nOnce verified, wear your wristbands in all NS spaces. If they need replacement, come with your old wristband and we'll replace it.\n\nRemember: Black wristbands identify NS Members and yellow wristbands are for NS Core. These correspond to Discord roles. \n\n__Community Events__\n\n- 11:30am: Non Scary Explanation of Crypto - Talk 2 (NS Cafe13) https://lu.ma/8mp81g4x\n- 1:00pm: Network Startup School - Week 1 (NS Coworking) https://lu.ma/4mnq6xvx\n- 3:00pm: Beginner Defi Workshop (NS Cafe13) https://lu.ma/j6h49rmt\n- 5:00pm: NFTs - How It's Made? (NS Cafe13) https://lu.ma/azpoo8id\n- 5:30pm: Vipassana Guided Meditation (NS Club13) https://lu.ma/zmtr0ku8"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-29T17:23:36.135000+00:00",
    "content": "**TALK: 1PM AT COWORKING ON MONDAY (9/30)**\nWe'll talk about Scaling the School, Proof-of-Fun, Wristbanding, and many other fun things at the auditorium in the coworking space. See you in 11.5 hours."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-09-28T18:29:39.428000+00:00",
    "content": "Hey everyone - loved seeing some of the awesome sessions you hosted today 🔥I saw stuff on AI filmmaking, animal mobility, some boxing, some hacking on NFTs, and an \"exploring Forest City for families\" session (bummed I missed this!).\n\nLet's keep it going 💪There are a bunch of events available on the calendar. I want to call out one right now:\n\n@undefined (maybe with help from @undefined @undefined and others) is going to start hosting weekly ⚡️ Lightning Talks ⚡️ on Wednesdays to better surface all of the amazing passions, skills, and hobbies that the many talented folks here have.  \n\nIf you would like to give a 5 minute talk (or just watch!) on anything, you can sign up here: https://lu.ma/gowvgqfs?tk=nfWAXJ"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-28T12:18:00.927000+00:00",
    "content": "**TRAINERS BACK ON SUNDAY! Gym is now open 7 days per week.**\nOk folks, the trainers are back on Sunday (9/29) and will be back every day going forward. Just like the internet or the roads, our gyms are open seven days per week. Because many people really do want that daily workout, including me.\n\nBut wait. What about rest days? What about people who are sore?!? Well, the key concept here is _maximum sustainable intensity_. Here are your options each morning:\n\n1) Feeling good? Go to gym3 for a high intensity workout.\n2) Feeling a bit sore? Go to gym1 for a low intensity workout.\n3) Feeling sick, or very sore, or injured? Take a rest day for yourself.\n\nThat is: health is incredibly personalized. It's not true that everyone needs the same amount of rest days. It's just like work: some people can only work 40 hours per week and others can do 80. Similarly, some people are out of shape and can only tolerate 3 workouts/week at first, while others want 7 days/week. So, if you really need a rest day, of course you should take it, but that doesn't mean the gyms shut down. It's just like the internet — if you need to log off, you can, but that doesn't mean the internet shuts down.\n\n*Gym1: low intensity workouts*\nI mentioned low intensity workouts in gym1. How does that work? Well, we will soon turn gym1 into a lower intensity workout studio for yoga, stretching, and mobility with classes from Cloudfit. And of course you can also do a gym3 workout with lower weights, or lower speed, thereby dialing back the level of intensity as you see fit.\n\nBut of course it's easy to dial intensity down to zero. That's the default in the outside world. What's more interesting is an environment where you can maintain _maximum sustainable intensity_. That's what we're building here. And so the gyms will be open 7 days a week, and the trainers will be present, so that those who prefer an intense daily morning workout will be able to get it. 💪 👟\n\nPS: Go book your slot at https://cal.com/networkschool if you haven't. See you tomorrow 🙂"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-27T15:25:35.619000+00:00",
    "content": "**NS.COM/DIRECTORY IS NOW LIVE**\nJust in time for the weekend, @undefined has shipped the directory. Logged-in NS members can use it to contact other NS members.  Go check it out at https://ns.com/directory"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-27T06:24:40.700000+00:00",
    "content": "To support rest and recovery, Blueprint Longevity Tests have been rescheduled to the 1pm-4pm window on Sep 29 (Sunday). Sign up for a session here @everyone: https://cal.com/networkschool/longevity-test. \n\nMeanwhile, if you want an active rest day tomorrow, help setup the NS sports equipment (https://discord.com/channels/900827411917201418/1288898718312960020), and play ping-pong, volleyball, football, pickleball, or go for a swim.\n\nHere are some tips from @undefined to boost recovery — https://discord.com/channels/900827411917201418/1278081837780041749/1289084112233041940, \nhttps://discord.com/channels/900827411917201418/1278081837780041749/1289082069258866792\n\n1) Load up on protein \n2) Go for walks on the beach or swim \n3) Hydrate with lots of water throughout the day\n4) Hot showers"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-27T04:58:07.777000+00:00",
    "content": "**UPDATES — SEP 27**\n\n**Blueprint Longevity Test**\n\nThe longevity tests are NOT happening today to allow rest and recovery. We will share a new cal.com link for scheduling soon.\n\n**Share Feedback**\n\n\"Frontier, not fancy\" doesn't just indicate that we're not fancy and luxurious. It also emphasizes that we move fast because frontiers are for building and innovating. Help us improve the NS experience by sharing your feedback: https://ns.com/feedback\n\n**New Store Items**\n\nNow you can pre-order NS Water Bottles ($35) and NS Mugs ($30) at https://ns.com/store. Lead time is 3-4 weeks. If you have ideas and designs for more NS merch, reach out to  our supply chain magician @undefined. \n\n**Help Build Network School**\n\nLot of people have expressed interest in volunteering and we love seeing the passion and enthusiasm. Check out <#1288895278367117344> to see the initiatives we need help with and coordinate with NS staff to help build the Network School."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-26T10:31:32.310000+00:00",
    "content": "**CATERED DINNER TODAY AND SURPRISE LECTURE TOMORROW**\n\n**Talk**\n\n*1pm*: Zuzalu and Popup Cities by Vitalik Buterin at 1pm (NS Coworking)\n\n**Dinner**\n\n*When*: Our caterer CGB will serve Blueprint compatible dinner at 7pm for $7\n\n*Base*: Choose from (1) garden salad with chickpeas and pomegranate, (2) brown rice with chili roasted broccoli, roasted fennel, rainbow capsicum, or (3) quinoa with paprika roasted pumpkin, fennel, and rainbow capsicum. \n\n*Protein*: Choose from (1) curry tofu, (2) pesto chicken breast, or (3) lemon and herb baked fish. @everyone"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-26T04:25:39.221000+00:00",
    "content": "New $1000 prize at https://ns.com/earn"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-26T02:50:03.406000+00:00",
    "content": "DO NOT USE SAFEPAL\n\nHello folks, it came to our attention that there was someone handing out these Safepal hardware wallets in the lobby during registration on 9/23. We’re not sure if this is just an overzealous marketer or an actual scammer, but you shouldn’t use these wallets as we haven’t vetted them. Anything official will come from ns.com. Also, we will be implementing QR codes and wristbands to start screening members from non-members soon."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-25T17:09:02.575000+00:00",
    "content": "NS Agenda — Sept 26\n\n**Talk**\n\n*1pm*: Don't Die session by @undefined at 1pm (NS Coworking)\n\n**Burn**\n\n*Progress photos*: If you didn't get your \"before\" photos on Wednesday, DM @undefined to take one at NS Gym 3 today (Sep 26). Don't forget to put on your NS t-shirt.\n\n*Blueprint Longevity Physical Test*: @undefined and @undefined will be leading sessions from 3pm — 6pm on Sep 27 to help you calculate your baseline longevity measurements. This is another dimension for a before/after comparison to see your fitness transformation over time. Book your slot here: https://cal.com/networkschool/longevity-test. \n\n**Store**\n\n*New items*: By popular demand, we got more white NS t-shirts that we just added to the store. \n\n*Hours*: Your orders from can be picked up at Room 1215 in Marina Hotel from 11am-12pm today (Sep 26).\n\nAlso, if you checked-in recently and haven't received your welcome bag, come to 1215 during the store hours tomorrow. @everyone"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-25T09:42:14.466000+00:00",
    "content": "**Dinner will be served at 7pm for just $7**\n\nWe heard loud and that NS members loved the catered dinner on Monday so we're planning for more frequent dinners. \n\nThese dinners not only provide a change from the grab-and-go refrigerated meals but also facilitate community bonding. Very importantly, they offer willingness-as-a-service by making the healthy the default option. \n\nThat being said, we're still working on the communal kitchen space and updated meal plans that feature catered dinners. It's time for a v2 ns.com/food and it's coming soon.\n\nOrder dinner ahead of time or at the door for just $7. \n\nThe food will be prepared by CGB (the team that served dinner on Monday) and features quinoa, curry turmeric cauliflower, sautéed mushrooms, almond flakes, sunflower seeds, marinara dressing, and a choice of parsley garlic chicken thigh or chickpea curry. @everyone"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-25T04:15:02.763000+00:00",
    "content": "**BROADCAST, CONNECT, RECRUIT**\n\nWe've received questions from people that are wondering how to represent Network School on social media. Here's a good framework to follow.\n\n1) *Broadcast*: Share stories and insights from your Network School journey\n\n2) *Connect*: Engage with fellow members and other netizens to expand your network \n\n3) *Recruit*: Invite passionate, aligned individuals to join our mission to build Silicon Valley without San Francisco\n\nNote: Don't post anything that reflects negatively on other NS members or yourself. And don't dox or post about other members without their consent. @everyone"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-24T15:59:17.676000+00:00",
    "content": "And the first prize is also live at https://ns.com/earn. You can view that if you're logged into your ns.com account, and also here on Bountycaster: https://warpcast.com/balajis.eth/0x983ad3e3"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-24T15:29:36.490000+00:00",
    "content": "The first quiz is live at https://ns.com/learn. You can view if you're logged into your ns.com account."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-24T14:14:16.031000+00:00",
    "content": "**We are upgrading to NS Gym 3**\n\nAt the frontier, things move at lightning speed. Our brand new gym which is exclusive to the NS community is ready for the Burn workouts tomorrow. \n\nHere's a video that shows the path to the gym from the hotel lobby. If you haven't already, sign up for the daily mandatory workouts: https://cal.com/networkschool/burn-workout.\n\n*And don't forget to wear your NS t-shirts because we'll be doing the \"before\" photos right before the workout. At the end of 90 days, we'll do \"after\" photos that show the fitness transformation that positive peer pressure can bring about.* @everyone"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-24T11:25:44.227000+00:00",
    "content": "**Dinner is served **\n\nHey everybody, we have some leftover Blueprint food in Cafe 13 which you can come and get right now.\n\nIn the medium run there will be two options for food: (a) community kitchen where you cook your own food and (b) meal plans that include a hot dinner like last night (as distinct from the grab-and-go meals from the fridge).@everyone"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-24T05:01:06.032000+00:00",
    "content": "Talk will start at 1:10. Before then @undefined will present ns.com/store and all the other new pages above."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-24T01:51:00.110000+00:00",
    "content": ""
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-24T01:50:55.916000+00:00",
    "content": ""
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-24T01:49:13.185000+00:00",
    "content": "As we ramp up, here are the key talks for today and a few important links @everyone \n\n**Talks**\n\n*1pm*: First Network School lecture at 1pm at NS Coworking (with Balaji and Bryan)\n\n*2pm*: Community discussion at week 1 town hall at NS Coworking\n\n**Links**\n\n*Food*: Pay for your food in NS Cafe 13 at https://ns.com/food. NS is a high trust community so we'll start with self-policing and request everyone first pay using the QR codes and then take food from the fridge. \n\n *Store*: Buy universal extension plugs at https://ns.com/store. More products coming soon. If there's something you'd really like to see on the store, let the NS crew know."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-23T16:48:34.384000+00:00",
    "content": "Here's the path from Marina Hotel lobby to NS Gym 1 @everyone \n\nThis should eliminate the \"I couldn't find the gym\" excuse haha. See y'all tomorrow for the first Burn 🔥 It's mandatory — positive peer pressure to build a healthy community.\n\nWe've switched things up a bit so it'll be a group workout led by our jacked instructor @undefined 💪 And we'll do the Blueprint Longevity Physical Test a different day (sign up slots for that coming soon)."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-23T09:28:31.938000+00:00",
    "content": "@everyone Ok, get some water and refreshments at the first floor of the hotel and then @undefined and @undefined will escort you to the coworking space about 1km away.\n\nI will be giving a short talk there with the schedule and overview. And then we come back for dinner at 7:30pm at the 13th floor cafe. And then you are free for the evening.\n\n*FOR TOMORROW*\nMake sure to book your mandatory workout for tomorrow at cal.com/networkschool\n\nWe will be giving the first lecture tomorrow at 1pm at coworking with all the tutorials, prizes, and plan for the next 7 days."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-23T08:50:06.186000+00:00",
    "content": "@everyone put on your black t-shirt and get ready to walk over to the beach for a cool drone shot."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-23T04:29:31.173000+00:00",
    "content": "Today's the day. If you've already arrived at Network School, hang out in the lobby and introduce yourself to fellow Network Schoolers.\n\nWe'll start checking people in around 2/2:30pm. Meanwhile, take a look at today's agenda: https://ns.com/checkin."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-20T18:30:08.911000+00:00",
    "content": "The Network School kicks off in just 60 hours ⏲️ Here's day 1 schedule by the hour for our official kickoff:\n\n- 11:30am: Check-in with NS staff at Suntec Convention Center\n- 12:00pm: Depart for Network School with your bus groups\n- 2:00pm: Arrive at Forest City Marina Hotel, check-in to your rooms, relax\n- 4:00pm: Meet at NS Cafe (Marina Hotel — Floor 13) and go to beach for a drone video shot\n- 5:00pm: Walk to NS Coworking for ribbon-cutting\n- 5:30pm: Kick things off with Balaji's Opening Address\n- 7:00pm: Return to NS Cafe (Marina Hotel — Floor 13)\n- 7:30pm: Enjoy Blueprint dinner\n\n*Note: if you're arranging your own transport to Network School, please plan to arrive at Forest City Marina Hotel at 2pm.*\n\nThe NS team has put a lot of blood and sweat into preparing the facilities for our attendees, and we're excited to welcome everyone to the frontier. Because it's time to build! 🏗️"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-19T03:56:01.095000+00:00",
    "content": "A few quick to-dos as we approach the first day of Network School 🏫 \n\n1) **Check bus details** 🚍 \nYou should be in a bus channel and have received a DM from your bus lead *if* you opted for group transport from Singapore to Network School on Sept 23. The bus will leave Suntec Conference Center at *12pm sharp* so please arrive by *11:30 latest* because we need to verify passports before people can board the bus. \n\nMake sure you've friended your bus lead on Discord:\n- Bus 1: @undefined \n- Bus 2: @undefined \n- Bus 3: @undefined \n- Bus 4: @undefined \n\n2) **Send us your roommate preference** 🛏️ \nWhether it's your spouse, coworker, or a Network School friend you made on Discord, if you have a roommate you'd like to share rooms with, DM me so we can pair you up accordingly. If no preference is indicated, our team will match you with someone great. \n\n3) **Sign up for the first Burn workout** 💪\nPick a slot for the mandatory workout on Tue, Sept 24 that starts with the Blueprint Longevity Physical Test: https://cal.com/networkschool/burn-workout. The workout will be accessible to all so don't worry if you haven't been to the gym in a while — our instructors will help you get started on your fitness journey.\n\nIf you have any questions, my DMs are always open."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-14T08:19:04.312000+00:00",
    "content": "An <#1284425829387862087> channel has been a popular request from Network Schoolers so important updates aren't lost in the other more active channels.\n\nSo I'm re-sharing The Network School Orientation Guide here 📚 https://docsend.com/v/jqp2n/ns-orientation-guide.\n\nIt's available for those who signed the contract and filled out the onboarding form.\n\nIf you haven't completed both, please do so ASAP (links below) and DM me @undefined to get access to the guide.\n\n1) **Contract**. Sign this contract: https://app.hellosign.com/s/GToebbSg\n2) **Onboarding form**. Fill out this form: https://forms.ns.com/onboarding\n\nTurn notifications on for <#1284425829387862087> and stay in the loop 🔔"
  }
]
