[
  {
    "userName": "unclebezadh",
    "timestamp": "2024-09-21T07:05:03.307000+00:00",
    "content": "gotchu gotchu"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-21T07:04:44.472000+00:00",
    "content": "We're planning for cohort 1 to be around Dunbar's number (~150)."
  },
  {
    "userName": "unclebezadh",
    "timestamp": "2024-09-21T06:59:33.378000+00:00",
    "content": "Curious, how many people will be at the school?"
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-21T06:39:51.908000+00:00",
    "content": "https://www.bbc.co.uk/news/articles/cwyl171lyewo just one reason why this policy is relevant. Mainstream media has already decided on how to report on this topic and you’ll just give them quotes to use out of context."
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-21T05:42:45.457000+00:00",
    "content": "You can try the local libraries that are closest to you, can search National Library Board.\n\nhttps://www.nlb.gov.sg/main/visit-us/our-libraries-and-locations"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-21T05:27:21.763000+00:00",
    "content": "Anyone already in SIngapore that has found places to work with good wifi and outlets to plug in?"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-21T03:23:25.595000+00:00",
    "content": "🇸🇬 CY Singapore Tips 🍛 · Camellia\nhttps://maps.app.goo.gl/BCz3AnWfeUR4PKKn9?g_st=i"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-21T03:23:22.432000+00:00",
    "content": "For people who are looking for yummy Singaporean food, here is my list based on local’s recommendations and my 5 times here haha"
  },
  {
    "userName": "oferrotem",
    "timestamp": "2024-09-21T01:10:37.148000+00:00",
    "content": "I look like this today, in case anyone's here and recognizes me - say hi 🤠\nDark red pants."
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-21T01:09:28.059000+00:00",
    "content": "I’ll be there in <10"
  },
  {
    "userName": "oferrotem",
    "timestamp": "2024-09-21T01:09:00.739000+00:00",
    "content": "Who's here? I just arrived"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-21T00:51:16.639000+00:00",
    "content": "Omw"
  },
  {
    "userName": "eliasmarshall",
    "timestamp": "2024-09-21T00:34:52.778000+00:00",
    "content": "can’t make it unfortunately , running later than I thought"
  },
  {
    "userName": "oferrotem",
    "timestamp": "2024-09-20T23:29:00.096000+00:00",
    "content": "GM! 🌻 \nSee y'all soon!\n@ Common Man Coffee Roasters - Martin Road"
  },
  {
    "userName": "fakedavinxi",
    "timestamp": "2024-09-20T19:01:37.344000+00:00",
    "content": "https://warpcast.com/fakedavinxi"
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-20T17:07:20.241000+00:00",
    "content": "In case anyone arrived Singapore 1 day ealier before the Network State Conference, besides Breakpoint and F1, compiling a small list of other Sept 21 events found from various sources  (non-exhaustive list, post is not an endorsement for any particular event):\n\nSept 21 at 11 am — Memecoin Frenzy: What’s Driving Speculation, and How Will It Evolve? Event link: https://lu.ma/qv8ts0s0\n\nSept 21 at 4pm - 5:15 pm - A Guided Tour of Kwai Fung Hin Art Gallery’s Debut Exhibition in Singapore. Event Link: https://harvard.sg/event/tourkff/\n\nSept 21 at 5 pm — Infinex x MegaETH Rooftop F1 Viewing Party. Event Link: https://lu.ma/0uoi43gl\n\nSept 21 at 6 pm - 9 pm - Regenerative Network State Social. Event Link: https://lu.ma/mkn4mazw\n\nSept 21 at 6 pm - 10 pm - F1 X APE Live Party. Event Link: https://lu.ma/xq59ujjg\n\nSept 21 at 8:30 pm - Sentosa K-POP Random Play Dance. Event Link: https://www.sentosa.com.sg/en/things-to-do/events/kpop-random-play-dance/\n\nSept 21 at 9 pm - 12 am - HBFS Breakpoint Afterparty. Event Link: https://lu.ma/tb0cu055\n\nSept 21 at 10 pm - 3 am - Dark Room at Apollo Livehouse Club. Event Link: https://www.eventbrite.sg/e/dark-room-tickets-981191238407?aff=ebdssbcitybrowsenightlife\n\nSept 21 at 10 pm - 3 am He.She.They. ft. SYREETA (UK) and Jarred Baker (AUS) - SINGAPORE. Event Link: https://www.eventbrite.sg/e/heshethey-ft-syreeta-uk-and-jarred-baker-aus-singapore-tickets-982914292107?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T16:34:43.400000+00:00",
    "content": "Happening tomorrow - https://lu.ma/mkn4mazw?tk=SSlLV7"
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-20T14:57:25.587000+00:00",
    "content": "i would also like to propose @undefined the possibility of something like a #curriculum room that would work as follows:\n\n- people can tag links shared in <#1278081837780041749> with @curriculum and if they are accepted by you, they are posted in that group, that only you and potentially selected staff have write access to.\n\nthe reasoning is that if there is something like an accepted unofficial curriculum, there can be an implicit assumption/expectation that everyone has stayed up to date on what the community leaders consider to be important. \n\nthat way conversations can go past explaining the essays/videos and instead to discussing the contents and implications of such.\n\nthe downside of this idea is that it obviously puts more on the plate of the person tasked with curating. otoh the upsides as a community good are quite large over time imo.\n\nmy first submission @curriculum: \nhttps://www.youtube.com/watch?v=y2OuJZlUugY"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-20T14:15:14.194000+00:00",
    "content": "Reaching Sunday morn"
  },
  {
    "userName": "milimaxian",
    "timestamp": "2024-09-20T11:40:50.114000+00:00",
    "content": "Im living in chinatown and otherwise at the ethglobal hackathon, in sands convention center"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-20T11:19:44.778000+00:00",
    "content": "Im going to Bing Bong tn"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-20T11:18:39.844000+00:00",
    "content": "Having dinner with friends now and will head out to ethglobal opening later"
  },
  {
    "userName": "aneesh.mov",
    "timestamp": "2024-09-20T10:24:39.482000+00:00",
    "content": "I’ll be there late tonight so down for hangs"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-20T10:16:33.460000+00:00",
    "content": "Adding other folks to the thread that I believe are in Singapore:\n@undefined, @undefined, @undefined @undefined @undefined"
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-20T09:21:22.615000+00:00",
    "content": "Around 4.8 billion people in Asia-Pacific (around 60% of total Earth human population), so hard to reach absolute consensus. From what I see from some headlines and social media networks, there is arguably some perception in certain corners that Harris could be seen by some as the one with less volatility (more predictability and policy continuity) as far as the region is concerned. That said, with a population this big, there is always the issue of questionable sample size. (Btw NOT writing this as endorsement of Harris)"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T08:28:38.581000+00:00",
    "content": "On web3 community building"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T08:28:26.816000+00:00",
    "content": "Was a lot of fun"
  },
  {
    "userName": "wwwelsa0511",
    "timestamp": "2024-09-20T08:22:08.084000+00:00",
    "content": "Cool, how was it?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T08:04:34.752000+00:00",
    "content": "Ok I’m at the aptos event n this is coming up - https://lu.ma/nrupygoy?tk=OndAXp"
  },
  {
    "userName": "wwwelsa0511",
    "timestamp": "2024-09-20T07:57:29.488000+00:00",
    "content": "I'm around the Lavendar area"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-20T07:00:19.889000+00:00",
    "content": "You say that people are following the USA election in the Asia Pacific region. Is there consensus about which candidate is most likely to prevent conflict?"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-20T06:44:15.333000+00:00",
    "content": "Yes, it's going to be weird when people start calling me Max (not my name). I'd rather change my name to my preferred handle."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-20T06:29:23.613000+00:00",
    "content": ""
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-20T06:15:33.806000+00:00",
    "content": "The concern about escalations in nation state superpower conflict is arguably wide. @undefined. Here in the Philippines, there are many who support expanded US military base access due to South China Sea tensions and then there are also those who worry that expanded US military base access would make the ASEAN country -- close to Taiwan island -- an unfortunate proxy / pawn in any conflict. Many in ASEAN arguably are worried about being collateral damage or unintentional proxy to superpower nation state conflict. If the most recent pew surveys are reliable, ASEAN opinion is arguably pretty even, about slightly over 50% favoring PRC versus around 49% favoring US. I am guessing many in Malaysia, Singapore etc are actually fairly pro-PRC compared to the mainstream opinion in North America (in some ways due to infrastructure Belt and Road investments etc), grab a periodical like Lian He Zao Bao in Singapore to take a look.\n\nIn any case, I only brought up this topic due to the earlier mention of November 5 election. It is a super relevant election (and people follow it nervously) -- many in the ASEAN region feeling like being on the knife's edge are hoping for at least sensible leadership on all sides so that tensions are managed responsibly and escalations do not occur."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T06:05:54.967000+00:00",
    "content": "At the Irish pub"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T06:05:42.474000+00:00",
    "content": "Yup! There’ll be that Meetup in the evening too for us"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-20T05:56:59.904000+00:00",
    "content": "in Singapore now. Would be nice to grab some lunch tomorrow or coffee?"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-20T05:56:05.704000+00:00",
    "content": "wow looks so cool!"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T05:54:43.041000+00:00",
    "content": "Going here soon - https://lu.ma/y8j7jlwf?tk=EYVxXs"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-20T05:48:06.313000+00:00",
    "content": "the NS feels like a doorway to immense new knowledge. I would want to be like an empty vessel and collect as much of it as i can - while building on my personal goals. from that lens, keeping my mind open for more new goals. will figure!"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-20T05:45:55.376000+00:00",
    "content": "@undefined mentioned a pub meetup tomorrow 5 - 7pm\n> If you are in Singapore on the evening of the 21st, we have a reservation at Molly Malone's pub from 5:00-7:00 if you would like to meet up for sundowners https://www.molly-malone.com/"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-20T05:45:06.657000+00:00",
    "content": "I'm here, between Novena and Whampoa areas! Mostly working today but hoping to jump into some meetups."
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-20T05:43:07.820000+00:00",
    "content": "Creating this thread so people can broadcast that they're in Singapore and any hangouts."
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-20T05:43:02.403000+00:00",
    "content": "My obstacle was that my goal is too BIG ...thanks to reading The Network State, totally blame that book 😅"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-20T05:42:58.605000+00:00",
    "content": "**In Singapore already? Broadcast meetups & let folks know you're available to hang.**"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-20T05:41:17.675000+00:00",
    "content": "Yes, when I get to NS I intend to get the goals out of my head and into a framework with objectives and milestones."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-20T05:31:54.527000+00:00",
    "content": "i dream about such worlds all day:\n\nhttps://x.com/electrik_dreams/status/1783570853810131413"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T05:31:26.343000+00:00",
    "content": "How bout taking a stab at building a similar NS Virtual world in 3 months, learning and creating through unreal engine in 90 days?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-20T05:29:58.274000+00:00",
    "content": ""
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-20T05:13:54.694000+00:00",
    "content": "https://www.dropsitenews.com/p/pakistan-promised-china-new-military-base\n\nThis seems related to those worries"
  },
  {
    "userName": "superolly_",
    "timestamp": "2024-09-20T04:13:47.866000+00:00",
    "content": "I think an interesting prompt for one of these could be to create short films set inside of worlds where network states/longevity have succeeded, highlighting what it’s like to live in them and how they solved problems in legacy states"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-20T03:56:17.473000+00:00",
    "content": "+1 \n\nToooo many goals has always been an obstacle."
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-20T03:45:50.130000+00:00",
    "content": "A lot of folks in the Asia-Pacific region around Singapore are also nervously following this November election. After Russia-Ukraine European theater and Gaza Middle East theater, any escalated conflict in Asia-Pacific theater featuring superpowers along the first island chain would make the two former theaters feel like appetizers to the main meal -- in a not so good kind of way. This broader region hosts arguably over ~60% of world's trade passage, nearly over ~60% of the world's population, and possibly over ~60% of the world's military firepower arsenal. Hopefully whoever comes out on top on November 5th has the sensilbility to not rock an already unsteady boat.  To peace (or at least detente or some kind of mutual understanding to not escalate).\n\nThat the US Indo-Pac Command and the PRC Southern Theater Command just spoke recently...is a welcome sign for stability.\n\nOn side note: this feeling of being in an intensely divided era and living on the knife's edge of intense nation state rivalry makes the peaceful alternative global network initiatives Balaji is leading even more relevant -- for us, for our families and communities, and also for future generations."
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-20T02:35:55.644000+00:00",
    "content": "I'm just getting overwhelmed and end up staring into space. I'd like to make those space-staring times more productive."
  },
  {
    "userName": "babybelugaa",
    "timestamp": "2024-09-20T01:18:49.535000+00:00",
    "content": "my popcorn is ready"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-20T00:57:45.013000+00:00",
    "content": "oh wow weird sticker.\nI am planning to go to see some art today, anyone in Singapore (wow what a city)"
  },
  {
    "userName": "velvetdoctor",
    "timestamp": "2024-09-20T00:48:05.402000+00:00",
    "content": "Coming to skills, I am confused on which path to take (we can say Unclear goals):\n1) Learning coding, developing new apps, and building a company?\n2) Continue running the YouTube channel which I started to teach people about crypto currencies (in Telugu language)?\n3) Continue with reading and researching about new startups in crypto and investing in them?\n4) Learn about AI and build apps using AI and no code tools?\n5) Or do all of them? \n\nMy monkey mind keeps shifting from one to the other from time to time  😂"
  },
  {
    "userName": "ash2234",
    "timestamp": "2024-09-20T00:40:18.515000+00:00",
    "content": "US elections watch party on November 5th?  I can't resist myself from looking at a trainwreck  😆"
  },
  {
    "userName": "velvetdoctor",
    "timestamp": "2024-09-20T00:35:44.863000+00:00",
    "content": "Also physical injuries from time to time whenever I feel like I am doing well with the consistency 😂. For example: I have been working out for the last 4 months but last week I injured my shoulder and the doctor advised me to stop lifting weights for a couple of weeks. Today here I am slacking off 😀"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-20T00:27:07.593000+00:00",
    "content": "Could take inspiration from Runway's AI film festival, https://aiff.runwayml.com, which has pushed the boundaries of filmmaking with AI. It's hard to even tell the movies use AI."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-19T23:51:44.346000+00:00",
    "content": "All kinds. Our whatever kind of self improvement you’re focused on."
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-19T22:41:09.469000+00:00",
    "content": "Are we talking about physical self improvement? Or our skills and entrepreneurial potential?"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-19T20:12:49.558000+00:00",
    "content": "@undefined"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-19T19:38:31.657000+00:00",
    "content": "here's the link shared on the announcements channel https://cal.com/networkschool/burn"
  },
  {
    "userName": "blackmajic5000",
    "timestamp": "2024-09-19T19:21:51.605000+00:00",
    "content": "Can you link to the schedule please? Not seeing it on discord"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-19T19:08:31.648000+00:00",
    "content": "I would like to maybe 3D print statues of esteemed visitors. Would be a fun photo op."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-19T19:07:36.716000+00:00",
    "content": "Yes, this is likely. We have a large LED screen that we will likely screen movies on"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-19T18:21:17.820000+00:00",
    "content": "And 3d print our own NS Oscars 😄"
  },
  {
    "userName": "velvetdoctor",
    "timestamp": "2024-09-19T17:26:56.060000+00:00",
    "content": "Sleeping late at night and getting up late in the morning with less motivation to workout."
  },
  {
    "userName": "jacksonofalltrades",
    "timestamp": "2024-09-19T16:57:04.066000+00:00",
    "content": "We could also create our own film festival and do a \"film hackathon\" where we have 48 hours to make a short film using AI. Then we host a screening with a 4K LED screen that we have here 🙂"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-19T16:16:18.226000+00:00",
    "content": "We would do a lot of movies fests at my varsity - fondest memories!\n\nWorld cinema fests was the closest it got to _really_ understanding foreign cultures"
  },
  {
    "userName": "shasan",
    "timestamp": "2024-09-19T15:46:24.154000+00:00",
    "content": "had the same thought earlier too! would be a lot of fun <a:pepoPopcorn:860696454087573524>"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-19T15:44:43.325000+00:00",
    "content": "I wonder if we'll watch movies/podcasts as a group, or have a day-long film festival sometime 🎥🎬"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-19T15:42:25.647000+00:00",
    "content": "Consistency. The mysterious waxing and waning of motivation, when all you want is for it to stay constant."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-19T15:42:23.735000+00:00",
    "content": "Obstacles to Self-Improvement"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-19T15:17:16.842000+00:00",
    "content": ""
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-19T14:04:04.795000+00:00",
    "content": "Cool thank you 🙏"
  },
  {
    "userName": "shasan",
    "timestamp": "2024-09-19T14:03:30.178000+00:00",
    "content": "don't recall any special waiting, it was quite smooth from what I remember. on the polygon network"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-19T14:01:40.914000+00:00",
    "content": "Ah this is a good solution, and was the NFT mint instantaneous or you had to submit and wait for it to be sent to the \"submitted wallet\" ?"
  },
  {
    "userName": "erin.steele",
    "timestamp": "2024-09-19T13:58:31.436000+00:00",
    "content": "Hey everyone! I saw some folks asking about possible meetups before the NS Conference. This is an open invite for all you NS School Admits: \n\nIf you are in Singapore on the evening of the 21st, we have a reservation at Molly Malone's pub from 5:00-7:00 if you would like to meet up for sundowners https://www.molly-malone.com\n\nI will be there with my husband and partner in crime, Shem.Klimiuk, and we'd love to meet some of our fellow Admits before we start  school on the 23rd, so swing by if you can!"
  },
  {
    "userName": "shasan",
    "timestamp": "2024-09-19T13:55:52.867000+00:00",
    "content": "Just found this thread!\n\nI'm a part of a gaming group called Wolves DAO, and last year they had a soul bound badge mint for about 150 members in the group on a platform called Carv.io Essentially they had 150 unique Wolf PFPs (such as my pfp rn) and the eligible members could pick and mint whichever of the 150 they preferred, on an fcfs basis. Here's how it worked: https://onyx-resonance-77a.notion.site/WolvesDAO-SBT-Claim-be32a4fd228243dd8d1281c40a1dd0ec  \n\nNot sure if this part has already been figured out, hope this can be of any help 🙂"
  },
  {
    "userName": "erin.steele",
    "timestamp": "2024-09-19T13:48:10.055000+00:00",
    "content": "Exactly. Please, anyone contacted by the corporate press, just ignore it. Do not give them anything to \"feed the beast,\" they are almost certainly going to spin anything NS-related in a negative light"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-19T12:30:10.723000+00:00",
    "content": "This sounds like perfect timing. Two sessions: 7am and 7pm and we catch both the sunrise (6:54am) and the sunset (7:02pm)\n\nThough I just checked the poll results and can see most folks are in favour of 5am-7am slot, so I'll go with the common consensus.\n\nQuestion: are we planning one session per day or two?"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-19T12:16:30.856000+00:00",
    "content": "interesting, can you DM me a screenshot please"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-19T11:59:13.925000+00:00",
    "content": "I checked but the last one was 21h ago and can't find it, I believe you are being shadow banning. You should tag linda there as well, she is working on bountybot"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-19T11:51:27.312000+00:00",
    "content": "That's weird, just tried on 2 different clients 🙂\nTry just going to my profile \"@undefined\" it should be the last post..."
  },
  {
    "userName": "donovansung",
    "timestamp": "2024-09-19T11:49:02.484000+00:00",
    "content": "Hi @undefined and everyone else, please ignore journos and all representatives from media corporations. Anything you say can and will be used against you by media corporations. Thanks!"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-19T11:48:46.622000+00:00",
    "content": "Alright! In that case I'll try and scout it out during the day, haha. Thanks!"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-19T11:48:45.911000+00:00",
    "content": "It says 'Cast not Found' like this"
  },
  {
    "userName": "donovansung",
    "timestamp": "2024-09-19T11:48:17.222000+00:00",
    "content": "You can certainly stay at Suntec after the conference, but I don't think it will have the best view of F1. Will need to see if one of the nearby bars has any good views of F1! Unfortunately I'm not the most knowledgeable on this!"
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-19T11:33:02.201000+00:00",
    "content": "i am so happy to have people here that share similar experiences.\n\nalso big fan of 10% fat greek yoghurt @undefined - hope we can source some 😄"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-19T11:25:29.817000+00:00",
    "content": "it's still there"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-19T11:18:09.459000+00:00",
    "content": "We should just ignore journos. Anything you say can and will be used against you by media corporations."
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-19T11:07:09.289000+00:00",
    "content": "Yes, I think at least several of us got this type of message already"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-19T11:05:07.764000+00:00",
    "content": "Who else is being contacted by reporters? I had to laugh at getting one from Wired mag, which has published such nonsense disinfo about Bitcoin lately.  🙃 Should I reply to be polite, or ignore?\n\n(I've been interviewed for accounting industry magazines but they're just interested in the concepts I'm sharing, and not probing on NS specifics. 🙂)"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-19T10:33:09.100000+00:00",
    "content": "@undefined I know you said there's an MRT right at the conference place - do you happen to know whether we can also stay there and see the race after 8pm?"
  },
  {
    "userName": "vikhyatsapra",
    "timestamp": "2024-09-19T10:28:16.451000+00:00",
    "content": "favourite thread 🥳"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-19T10:17:53.405000+00:00",
    "content": "💯"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-19T09:59:52.452000+00:00",
    "content": "@undefined I can see you are a foodie ❤️ don't miss this street food exploration for Sunday evening in Singapore: https://discord.com/channels/900827411917201418/1280943175028047903"
  },
  {
    "userName": "bradfordcross_08556",
    "timestamp": "2024-09-19T09:05:22.747000+00:00",
    "content": "It’s hardest when I go for sushi. The Sapporo and Sake calls to me. Same for champagne and oysters. If I’m shopping in Milan I must have a lunch of caprese, pasta and a bottle of vino. Some of these combos evolved together over millennia and are therefore superior and must be consumed. 😇"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-19T09:01:22.125000+00:00",
    "content": "I'd love to watch after the conference as well"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-19T08:57:20.674000+00:00",
    "content": "Alcohol is tricky. I try to keep the consumption low nowadays. But still averaging at 2-4 portions a week most often. Maybe NS will be a good opportunity to eliminate it from my \"diet\" for 3 months?"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-19T08:52:05.045000+00:00",
    "content": "I guess 7am is a good time for meditations."
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-19T08:51:19.169000+00:00",
    "content": "Hi! The workout schedules are up, the earliest one is at 7am, meaning we could easily do our early morning group meditation before that"
  },
  {
    "userName": "bradfordcross_08556",
    "timestamp": "2024-09-19T08:43:21.845000+00:00",
    "content": "This is great I’m similar but I do use whey because I’m 91kg and it’s just hard to get enough whole food protein.\n\nIt’s pretty dialed in now so I don’t track anymore or count macros, as I know the portion sizes and frequency by heart now.\n\nI also cycle bulk and lean alongside my workout regime. I do 2xDay training. Morning mountain run and afternoon weights. When I’m doing longer runs or I’m in a bulking phase with heavy weights, I will eat more carbs — rice, pasta, even quality breads.\n\nWhen I’m not burning as many calories on the runs or I’m trying to lean out more, then I try to get very restrictive on carbs and rice only or replace all fast carbs with salads.\n\nLastly, I try to do a lot of probiotic stuff for gut health like kefir, kombucha, picked stuff, Greek yoghurt, fresh fruits and veggies, sauerkraut, kimchi, etc, and I try to eat a ton of raw fruits and veggies.\n\nAnd of course try to mostly abstain from alcohol. Some studies show the body can’t even burn fat at all for up to 48 hours after consuming alcohol, as the system shifts to processing the alcohol."
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-19T06:01:38.429000+00:00",
    "content": "I’m in 😄"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-19T05:01:58.002000+00:00",
    "content": "unable to like or re-cast because the post is not available anymore."
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-19T04:44:12.132000+00:00",
    "content": "Not sure if this was posted earlier or not, for those who will be in Singapore in Sept 21, saw that V DAO is hosting a social 6-9 pm Sept 21. https://lu.ma/mkn4mazw"
  },
  {
    "userName": "mattburman",
    "timestamp": "2024-09-19T03:33:33.038000+00:00",
    "content": "I made it to DDC but not sure if they will let me in!"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-18T23:26:34.887000+00:00",
    "content": "I am on board."
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-18T23:14:49.381000+00:00",
    "content": "I aim for High protein, probiotic foods, some fruits and veggies, no seed oils. \n\nBut I also fail sometimes"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-18T22:43:13.654000+00:00",
    "content": "I'm new to Farcaster and will need to get used to it (and remember to check it!)"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-18T21:55:48.365000+00:00",
    "content": "💯 agree. I'm also a weird one who travels with a folding yoga mat in my bag, for spontaneous stretching. I also like standing desks, or sitting on the floor, and squatting ... which is far more normal in Asia than Australia 😅"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-18T21:41:37.003000+00:00",
    "content": "Thank you @undefined 🙏❤️🫡"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-18T20:59:25.504000+00:00",
    "content": "Let's support our buddy @undefined 's awesome Farcaster data project. This would make your life 10x when trying to do anything with Farcaster data, like analyzing trends or building apps\n\n> @undefined : I am trying to get a grant from bountycaster to make my dataset publicly available on GCP Big Query and Dune, please support the initiative by liking and recasting, it costs money to run a hub and data pipelines so some funding will help a lot 🙏 \n> https://warpcast.com/randombishop/0x04839229\n\nhttps://discord.com/channels/900827411917201418/1282669934970802268/1285989309228384267"
  },
  {
    "userName": "eliasmarshall",
    "timestamp": "2024-09-18T18:32:44.762000+00:00",
    "content": "I was thinking of doing mike chang's flow 60 everday alongside the workouts, even just the first 30 mins of mobility has a huge positive effect 🙂"
  },
  {
    "userName": "alta_81554",
    "timestamp": "2024-09-18T17:14:01.269000+00:00",
    "content": "High protein (I only eat meat when I go out to eat as I rarely cook meat myself), low/medium fat, and loads of vegetables"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-18T15:42:23.846000+00:00",
    "content": "I am trying to get a grant from bountycaster to make my dataset publicly available on GCP Big Query and Dune, please support the initiative by liking and recasting, it costs money to run a hub and data pipelines so some funding will help a lot 🙏 \nhttps://warpcast.com/randombishop/0x04839229"
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-18T14:41:36.812000+00:00",
    "content": "https://www.youtube.com/watch?v=zkDk91RQ3qU"
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-18T14:41:33.842000+00:00",
    "content": "i would like to propose that we normalize stretching while hanging out and potentially also while listening to lectures. i am often the weird one stretching at airport gates or at the back wall of conferences etc and i feel like i may have finally found the group of people who also thinks this should be **FAR** more normal than passively sitting in chairs"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-18T13:38:16.737000+00:00",
    "content": "who all into pub-style quizzes on any topic under the 🌞"
  },
  {
    "userName": "mattburman",
    "timestamp": "2024-09-18T11:44:10.317000+00:00",
    "content": "I didn’t buy a ticket because I land at 8:30am and wouldn’t make the start. But now I’m feeling FOMO and it’s sold out 💔"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-18T11:12:56.307000+00:00",
    "content": "Macrobiotic most of my life, raised that way, mostly plant based, basic staples."
  },
  {
    "userName": "superolly_",
    "timestamp": "2024-09-18T11:09:11.032000+00:00",
    "content": "Of course, just edited the original message 🙂"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-18T10:51:30.709000+00:00",
    "content": "Thanks, @undefined!"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-18T10:44:52.343000+00:00",
    "content": "Been shilling Network State Conference and NS to ppl I met today, they all seem very interested! <:pepeinkz:925090146951495790>"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-18T10:42:57.664000+00:00",
    "content": "Nice! just had supper with him earlier today 🙂 but unfortunately I have another commitment tomorrow…so on my way to the airport now 🛸"
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-18T10:31:10.596000+00:00",
    "content": "Malaysia RM too, always safer to carry some cash. Could just change them at airports or for larger sums, could shop for better rates around your hotel/hostel area if you are near bugis or little india. \n\nOtherwise Revolut / other payment apps allow free withdrawal from the local ATMs usually with no fees and almost spot rates."
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-18T10:27:36.694000+00:00",
    "content": "Yes, agree with @undefined\nTry to use mobile with your cards added for most of your payments. Occasionally the drink stalls and hawker food require local payment methods for digital payment like PayLah, PayNow as they do not have the payment terminals. So thats where cash comes in handy."
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-18T09:47:48.827000+00:00",
    "content": "I usually withdraw local money from a cash machine when I need it. I will check fees for that in my bank. If it is crazy I will bring some cash for exchange."
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-18T09:46:01.249000+00:00",
    "content": "Thank you my friend! Hoping to get plenty of sleep on the flight!! 🤞"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-18T09:42:10.806000+00:00",
    "content": "So change money when you get here, probably not at home"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-18T09:41:57.654000+00:00",
    "content": "Even the ones at the airport aren't too bad"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-18T09:41:45.629000+00:00",
    "content": "Money changers have low percentage exchange rates here"
  },
  {
    "userName": "carlb",
    "timestamp": "2024-09-18T09:23:56.232000+00:00",
    "content": "if you have longer summaries please share those also (but perhaps outside the sheet)"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-18T09:08:55.892000+00:00",
    "content": "@undefined / @undefined any chance you can allow us to change our names in this server? I'm visible as Senatus here since that's what I'm known as on most Discord's, but would prefer to just use my real name here."
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-18T09:01:14.498000+00:00",
    "content": "Ha! Yes! 😁👍🙏"
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-18T09:00:15.146000+00:00",
    "content": "https://www.dontdiesummit.com/singapore"
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-18T08:59:42.257000+00:00",
    "content": "Who else will be at DDS tomorrow?"
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-18T08:59:14.555000+00:00",
    "content": "Watching Bryan preach 😊👍"
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-18T08:58:53.316000+00:00",
    "content": ""
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-18T08:55:39.498000+00:00",
    "content": "In my case: low carb, avoiding sugar, two meals, animal proteins included (red meat, seafood / fish, Greek yoghurt and white cheese). Lots of greens and veggies. Olive oil. Berries."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-18T08:54:12.891000+00:00",
    "content": "Awesome! please do!"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-18T08:53:44.285000+00:00",
    "content": "@undefined I'm having some LLMs write up a short summary of each book for myself and having it explain how it relates to the Network School - want me to add that into colums as well or prefer nto to?"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-18T08:47:00.870000+00:00",
    "content": "https://docs.google.com/spreadsheets/d/1VwSM6wmgKNj_tWYhkG4eNaoBzpKRddg5YiFMf7wFPiI/edit?usp=sharing\n\ni like curating stuff and shall be putting up all recommendations in this open sheet (till i figure a better form for this)\nit's an open list - inviting you all to be fellow curators. \n\nright now only one sheet is populated: book recommendations from the NS book thread."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-18T08:45:07.214000+00:00",
    "content": "https://docs.google.com/spreadsheets/d/1VwSM6wmgKNj_tWYhkG4eNaoBzpKRddg5YiFMf7wFPiI/edit?usp=sharing\n\nthru my time at NS, i will curate the recommendations here - its an open list, inviting you all to be fellow curators!\n\nmy recos:\n\nLIfe 3.0 by Max Tegmark\nFuture of Humanity by Michio Kaku\nSingularity is Near by Ray Kurzweil\nChildhood's End    by Arthur C. Clarke"
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-18T08:42:32.227000+00:00",
    "content": "I am very grateful for the opportunity to listen to and learn from so many talented folks here. I wish I could stay longer beyond a visit. Looking foward to meeting everyone, grabbing a coffee together, and learning about alternate futures in which our existence is not tied to a national ID card/national passport, in which being accused of \"unpatriotic\" is not looked down upon, in which McCarthyist finger-pointing is no longer a thing.  Nationalism is on a hyperdrive in parts of this Asia-Pacific/Indo-Pacific region (where many political and civilizational/cultural boundaries often match) and at times it feels like nation-state fueled superpower rivalry could put the entire region on a knife's edge."
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-18T08:42:17.515000+00:00",
    "content": "Ideally: low carb, max 25g sugar/day, 3 real meals per day as a base proper breakfast, lunch, dinner. Carbs and sugar only before endurance exercise (road biking). 2x grams per kg bodyweight protein from real food (fish, eggs, meat, dairy, chickpeas, etc.) not shakes, 2150 calories base per day (500g weightloss per week). Track everything in myfitnesspal. Most important utilities: kitchen scale + airfryer.\n\nStrategy for network school: follow vegan blueprint meals, supplement as needed using the small kitchen."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-18T08:32:27.272000+00:00",
    "content": ""
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-18T08:29:32.339000+00:00",
    "content": "Europe is so screwed."
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-18T08:26:45.632000+00:00",
    "content": "that's a good tip as well. I was listening to the huge file 😄"
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-18T08:23:59.616000+00:00",
    "content": "I use either aisle seat to be able to get up every once in a while or window for more sleeping (but more difficult to get out to move legs (thrombosis risk, etc.). you need to walk if it's 20h non stop.\n\ndrink only water, bring own water bottle to stay hydrated.\nbring noise cancellation headphone and eyemask and or hoodie to be able to sleep.\n\nsleep as much as you can honestly. also skip airplane food and bring own precooked to eat when you want and not when they serve it. can inform flight attendants to not serve you food."
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-18T08:18:00.019000+00:00",
    "content": "Malaysia I would say it’s similar, but still good to do abit of spare cash here and there!"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-18T08:17:34.692000+00:00",
    "content": "Ok, cool, thank you. This is super helpful!"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-18T08:16:57.353000+00:00",
    "content": "For food and drinks at hawker 😆"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-18T08:16:33.361000+00:00",
    "content": "I’ll probably just change a hundred sgd for spare"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-18T08:16:05.209000+00:00",
    "content": "But still good to keep some cash with you for street foods"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-18T08:15:49.822000+00:00",
    "content": "Can tap and get around public transporations easy as well"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-18T08:15:32.418000+00:00",
    "content": "Visa/master card with overseas payment is relatively easy. If you have it connected to your Apple Pay google pay you can access most restaurants and convenience store."
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-18T08:14:39.532000+00:00",
    "content": "Quick questions for the locals among us: @undefined and @undefined - is cash needed in Singapore or paying by card / phone is available everywhere there. Shoud I take cash to buy the street food there or they will accept electronic payments. I have never been to this part of the world, an particularly in Singapore and Malaysia that is why I am asking for advice 🙂"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-18T05:23:24.609000+00:00",
    "content": "Fanged Noumena\nAnthology of writings by Nick Land\nhttps://libgen.li/ads.php?md5=212c5da83d6b4d884e5bd1154d50fc76"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-18T01:19:30.169000+00:00",
    "content": "Anyone at Token2049 today/tomm let’s hang"
  },
  {
    "userName": "aneesh.mov",
    "timestamp": "2024-09-18T00:59:45.479000+00:00",
    "content": "Would’ve loved to have been there but won’t be there till the 20th"
  },
  {
    "userName": "babybelugaa",
    "timestamp": "2024-09-17T21:38:05.971000+00:00",
    "content": "- Amusing ourselves to death - Neil postman \n- The Blank Slate - Steve Pinker\n-  thinking in bets - Annie duke"
  },
  {
    "userName": "alta_81554",
    "timestamp": "2024-09-17T19:58:16.877000+00:00",
    "content": "SO real, I feel this is going to be us in the bus"
  },
  {
    "userName": "alta_81554",
    "timestamp": "2024-09-17T19:58:05.557000+00:00",
    "content": "https://tenor.com/view/bus-partying-on-the-bus-bus-driver-happy-gif-15366413"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-17T19:50:32.092000+00:00",
    "content": "it's getting real!"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-17T19:47:52.947000+00:00",
    "content": "Looking forward to seeing everyone in a few days!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-17T19:40:55.903000+00:00",
    "content": "This is already my fav thread!\n\nhow about we make an open community wall - where we put in recommendations on books/videos/podcasts/artists/authors/concepts/ideas.\n\nwould be it's worth its weight in <:bitcoin:1282286965794017280>"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-17T19:25:41.799000+00:00",
    "content": "The Dao of Bitcoin: Towards a Cosmology of Energy Money\n- by Scott Dedels\nprovides a lot to reflect on"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-17T18:49:01.828000+00:00",
    "content": "\"Human Flourishing\" seems to be a code phrase/signal from a lot of cool people and projects. Sort of like the higher IQ version of  \"beef tallow\", not that there is anything wrong with beef tallow."
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-17T18:42:51.049000+00:00",
    "content": "California High-Speed rail might just be a mega bill for the taxpayers."
  },
  {
    "userName": "reza_yes",
    "timestamp": "2024-09-17T18:38:23.100000+00:00",
    "content": "Europa: The Last Battle (your eyes will never be the same again, in a positive eye opening way)"
  },
  {
    "userName": "babybelugaa",
    "timestamp": "2024-09-17T18:33:11.179000+00:00",
    "content": "Lffgggggggg"
  },
  {
    "userName": "sambhav012",
    "timestamp": "2024-09-17T16:40:52.353000+00:00",
    "content": "I also have Fiat Standard and Broken Money on my list"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-17T16:29:23.867000+00:00",
    "content": "Hello Olly, do you mind adding the authors, UAE: a modern history is hard to find (could be my browser BRAVE) without an author. Thank you 🙏"
  },
  {
    "userName": "sambhav012",
    "timestamp": "2024-09-17T15:25:25.224000+00:00",
    "content": "Check out Number 9!"
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-17T15:01:48.297000+00:00",
    "content": "Noted, thank you 😅"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-17T12:47:00.249000+00:00",
    "content": "We met at the Gym in Dubai with Sav"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-17T12:46:46.462000+00:00",
    "content": "YO RICH. That's crazy. See you at the Network School brother"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-17T11:38:38.707000+00:00",
    "content": "I saw this one on Balaji's book table (during our onboarding zoom call):\nSuperabundance: The Story of Population Growth, Innovation, and Human Flourishing on an Infinitely Bountiful Planet\n- straight to my reading list"
  },
  {
    "userName": "cameleon_75612",
    "timestamp": "2024-09-17T10:54:14.310000+00:00",
    "content": "all I can say is don’t sit in aisle near the bathroom😂, my rookie error on long haul night flight to ldn and the constant line up was horrific 😭"
  },
  {
    "userName": "milimaxian",
    "timestamp": "2024-09-17T09:55:30.541000+00:00",
    "content": "Rawdogging the full flight in meditation for the coming months"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-17T09:06:11.053000+00:00",
    "content": "Can probably do it with different models, I used Gemini 1.5 Flash for this one on my own service (https://nano-gpt.com/) so feel free to use anything else, but just to demonstrate how cheap it can be this question charged me $0.03.\n\nIf we add in 10x that in terms of books it would get a fair bit more expensive, say $0.30 every time you ask a question."
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-17T09:03:26.906000+00:00",
    "content": "So pasting in the entire Network State book is ~170k tokens, leaves room for 10x that.\n\nI asked for key learnings of this book chapter by chapter and got this:"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-17T09:01:13.077000+00:00",
    "content": "Let me try. Some of the models we run take huge amounts of input, so it might work even without too much extra hassle. Will try with the network state book real quick."
  },
  {
    "userName": "carlb",
    "timestamp": "2024-09-17T08:58:52.742000+00:00",
    "content": "is it possible to create LLMs (or prompts, RAG, or something else) that contain the essence of all these books and resources? would be cool to be able to ask questions and get synthesized answers from a wide array of knowledge"
  },
  {
    "userName": "superolly_",
    "timestamp": "2024-09-17T08:37:25.848000+00:00",
    "content": "I have a few on-brand books with me which I’m happy to share around:\n\n- Seeing like a state - James Scott\n- Death and life of great American cities - Jane Jacobs\n- From third world to first - Lee Kuan Yew\n- UAE: a modern history - Mohammad Morsy Abdullah\n- Understanding media - Marshall McLuhan"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-17T07:34:14.585000+00:00",
    "content": "--------------------------------------\n\nIslands in the Net by Bruce Sterling\n\nhttps://libgen.li/edition.php?id=141878199"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-17T07:30:44.107000+00:00",
    "content": "https://libgen.li/edition.php?id=146866069"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-17T07:29:42.705000+00:00",
    "content": "https://www.amazon.com/Softwar-Projection-National-Strategic-Significance/dp/B0BW358F37"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-17T07:18:31.119000+00:00",
    "content": "aww so glad you liked it! very interesting book btw"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-17T06:26:04.047000+00:00",
    "content": "Sorry, that list got a bit longer than I thought 😅  They're all super interesting books though, so you might fly through them."
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-17T06:25:37.144000+00:00",
    "content": "Longevity:\n\n- Don't Die by Bryan Johnson\n- Zeroism by Bryan Johnson as well actually\n- Outlive by Peter Attia\n- Ageless by Andrew Steele is broader\n- Lifespan by David Sinclair\n- Hacking Darwin by Jamie Metzl (more about genetic engineering)\n\nNetwork States:\n\n- The Network State by Balaji\n- Sovereign Individual by James Dale Davidson and William Rees-Mogg\n- What's our problem by Tim Urban (slightly different take. Identifies largely the same issues as Balaji, but very different and frankly less practical conclusions)\n- Snow crash by Neal Stephenson. Fiction, but a really interesting exploration of the field (and just super fun).\n\nCrypto:\n\nI have a slightly different take here mostly because I'm not a Bitcoin maximalist and think many of these books are far too simplistic. So take all of them with a grain of salt.\n\n- The Bitcoin Standard by Saifedean Ammous. Lays out the reasoning for wanting decentralized money well.\n- Read, Write Own by Chris Dixon\n- Snow Crash works for this category too\n\nAI related:\n- Daemon by Daniel Suarez (fiction)\n- Superintelligence by Nick Bostrom is the classic here, though getting outdated\n- Our Final Invention by James Barrat\n- The Coming Wave by Mustafa Suleyman\n\nSingapore bonus:\n- Third World to First by Lee Kuan Yew, about how Singapore was developed. Also relevant for Network States."
  },
  {
    "userName": "carlb",
    "timestamp": "2024-09-17T05:48:27.087000+00:00",
    "content": "its a great read! it describes the evolution of the internet, the protocols, corporate networks vs protocol networks, speculators vs builders, and lots more. \n\ncheck out the intro to see if it resonates:\nhttps://a16zcrypto.com/posts/article/read-write-own-intro/"
  },
  {
    "userName": "americana76",
    "timestamp": "2024-09-17T04:36:41.755000+00:00",
    "content": "@caesarinvictus"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-17T03:08:51.906000+00:00",
    "content": "Curious if anyone has read \"Read, Write, Own\" and recommends it"
  },
  {
    "userName": "sambhav012",
    "timestamp": "2024-09-17T03:08:01.140000+00:00",
    "content": "Have been thinking about creating a thread of recommended resources too! Currently reading The Bitcoin Standard"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-17T03:07:02.255000+00:00",
    "content": "On the Don't Die side, I'm interested in reading Peter Attia's Outlive!"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-17T03:07:01.951000+00:00",
    "content": "Reading List (+Book Clubs Options)"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-17T03:04:26.900000+00:00",
    "content": "Go ahead and start a list if you're interested. Others have also expressed enthusiasm so you can all collaborate — https://discord.com/channels/900827411917201418/1278081837780041749/1279756593860448256, https://discord.com/channels/900827411917201418/1278081837780041749/1279030737550704711."
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-17T02:45:20.680000+00:00",
    "content": "Do we have a read/watch list for NS apart from the work of Balaji and Bryan Johnson?\n\nIf not, should we make one? Ideally with options to read / watch / listen. \n\nI would imagine the list would include things like \n1. \"Where is My Flying Car?\" \n2.  \"The Sovereign Individual\"\n3.  \"A Jewish State\"\n4. \"The Gray Lady Winked\""
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-17T02:26:19.358000+00:00",
    "content": "I hear that is what Bryan Johnson suggests for longevity 🤣"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-17T01:32:39.985000+00:00",
    "content": "This was so funny, I saw it randomly on X yesterday and never would guess one of the members here are in NS. You should have recorded the dad jokes, those are so funny! 😆"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-17T01:19:56.111000+00:00",
    "content": "Bring electrolytes, have some first aid kit with you just in case. Drink lots of water, bottled one. I usually fast on flights with small snacks like nuts which help me to get jet lag better. Also bring smth warm, is usually cold on planes at least for me lol. Download some netflix movies or podcasts beforehand and safe flight!"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-16T23:52:51.351000+00:00",
    "content": "idem"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-16T21:21:33.501000+00:00",
    "content": "Oh this is super nice, much better than what I did.\n\nAnd there’s a switch for offline listening!\n\nThanks for the tip."
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-16T21:11:52.236000+00:00",
    "content": "I just listened to The Network State on Audius.co where is broken down into chapters and nicely narrated. I'd read it before but listening to it was a great immersion."
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-16T21:02:22.254000+00:00",
    "content": "Hi! We have a Signal group for the girls in the cohort to stay connected. DM me your Signal account/number if you want to join, and I’ll add you!"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-16T21:01:47.295000+00:00",
    "content": "FYI the download is an mp3. For convenient listening, I got the file to my phone via bluetooth, the. downloaded the pocketcast app, and uploaded the file to pocketcast. This saves your spot, lets you change the speed, and lets you get the +-30s buttons."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-16T20:59:00.713000+00:00",
    "content": "Great way to load the concepts in cache.\n\nBy the way, The Network State audible is available at thenetworkstate.com and downloadable for free (right click > download file) 🔉"
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-16T20:02:46.852000+00:00",
    "content": "I am going to try to get trashed at my birthday party the day before so I can be dehydrated and survive in my window seat without constantly being interrupted by other people who need to go 😅"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-16T19:58:00.011000+00:00",
    "content": "On the read/watch note — you can get PDFs and audibles of The Network State and Don’t Die!"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-16T19:39:59.428000+00:00",
    "content": "I am also open to hearing ideas. \n\nI would say, splurge on an Aisle seat. Bring things to read and watch. Bring an eyemask. Wear comfortable clothes."
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-16T18:04:43.332000+00:00",
    "content": "On this note… does anybody have any tips for surviving a 20+ hour flight in economy? 🙈😭 I’m terrified"
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-16T16:58:44.074000+00:00",
    "content": "Finally urgent descending world logistics wrapped up and ready for 3 months (minimum) ascending world adventure. Will land in SGN on Friday 16:00ish. What is everyone up to for the weekend? Wondering if I should go to Forest City already to decompress or stay in SGN."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-16T16:35:35.525000+00:00",
    "content": "oh absolutely, many more, for sure! see you soon!"
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-16T15:12:01.682000+00:00",
    "content": "Jealous! Wish I could but I only get in the 23rd. Hope for many more of these 🙂"
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-16T15:10:57.505000+00:00",
    "content": "This is perfect, thank you!"
  },
  {
    "userName": "pathetaon",
    "timestamp": "2024-09-16T13:07:56.811000+00:00",
    "content": "If anyone will be in Tokyo the 18th through 21st I'd be happy to meet you, shoot me a DM 🎌"
  },
  {
    "userName": "blackmajic5000",
    "timestamp": "2024-09-16T12:40:16.922000+00:00",
    "content": "yes please, I'm very new to it"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-16T09:36:24.892000+00:00",
    "content": "Love this space! I don't consider myself an artist but I got the chance to exhibit my paintings and photography once, selling most of them. It's something I want to get back into! \nI'm currently using Midjourney as a digital technique and I create my version of book covers of whatever i'm reading just for fun"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-16T08:48:01.926000+00:00",
    "content": "Join us?"
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-16T07:50:30.884000+00:00",
    "content": ""
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-16T07:50:11.949000+00:00",
    "content": "Just arrived in Sing! Was on a flight with 300 degens, influencers, whales, sharks all in Web3 / crypto. We flew from Dubai on Qatar Airlines all paid for by Redacted. I was the MC of the flight telling dad jokes on the PA for 9 hours to passengers trapped in a metal tube hurtling through the sky. There was no escape 🤣"
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-16T07:47:33.022000+00:00",
    "content": "https://x.com/Kaizergaming88/status/1835431499606495300?t=OVjmXTRYJ1xJmyY19USBcw&s=19"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-16T06:54:53.569000+00:00",
    "content": "Okay thanks everyone for the patience I made a cast about this; https://warpcast.com/beecurious/0x611e0c01"
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-16T06:51:36.180000+00:00",
    "content": "maxwell is good too"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-16T06:33:27.208000+00:00",
    "content": "I would definitely choose local, not touristic place. Let's do something authentic."
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-16T06:16:29.061000+00:00",
    "content": "some adventure i like to take my overseas friends in the cooler evenings are renting bikes that you can find on the street through the apps. and just riding around Marina Bay and Gardens by the bay."
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-16T06:14:39.882000+00:00",
    "content": "can consider this \"Chinatown Complex Market & Food Centre\" if you want local experience that is also not too far - https://maps.app.goo.gl/iP9AKtCiq3Bp3rGz8"
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-16T06:11:23.295000+00:00",
    "content": "Hm, Lau Pa Sat is mainly catered for tourist so locals usually dont go there. But the location is convenient as its near suntec."
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-16T06:10:10.898000+00:00",
    "content": "Im local! what do you guys want to go for?"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-16T05:42:03.967000+00:00",
    "content": "Can't find you there, can you send me your username or just add me here https://warpcast.com/beecurious"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-16T05:18:35.841000+00:00",
    "content": "I'd love to learn as well. I built something for Farcaster but I have no idea how you kind of \"get into it\", how you start getting some followers and engage with others."
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-16T05:17:07.006000+00:00",
    "content": "Would love to learn as well, and I love TEA!!!"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-16T05:10:36.900000+00:00",
    "content": "I miss Singaporean Chicken Rice!!!Count me in! <:pepeinkz:925090146951495790>"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-16T04:50:15.477000+00:00",
    "content": "Bumping up this thread - for 22nd Sept Dinner & City Exploration\n\nhttps://discord.com/channels/900827411917201418/1280943175028047903/1282633959012040746"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-16T04:39:25.391000+00:00",
    "content": "Haha true"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-16T04:33:56.446000+00:00",
    "content": "Perhaps we can have two different POAP under the same contract. So the tool can push different metadata and picture as per user request.\n\nIf you know someone who can champion the realistic PFP please refer them to this thread <:pepeinkz:925090146951495790>"
  },
  {
    "userName": "x8.design",
    "timestamp": "2024-09-16T04:18:04.838000+00:00",
    "content": "Yes please 🙏🏼"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-16T03:37:12.097000+00:00",
    "content": "That's thoughtful. Thanks for sharing your approach, Calvin."
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-16T03:21:42.007000+00:00",
    "content": "New to farcaster, would love to learn. I’m generally not very active on social media and would curious to experiment with creating content on farcaster regularly during NS."
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-16T03:19:16.510000+00:00",
    "content": "This has been working decently well for me so far:\n\n“I’m going to Singapore for a 3 month program that provides residency, co-working, daily fitness classes, and nightly classes on emerging tech.”\n\nI often mention that it is designed mostly for people who can work remotely.\n\nMy general approach is to get them thinking in the right direction, and then explain more in depth and accurately based on what they’re interested in / what I want to emphasize.\n\nI will usually allude to their being an idealogical underpinning, and intro the Network State concept with something like:\n\n“It’s an experimental idea for a new way to form governments. It starts with bringing people together based on shared ideas, instead of being born near each other. Theoretically, those people could pool resources to acquire land and maybe even gain diplomatic recognition at some point”"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-16T03:14:57.166000+00:00",
    "content": "Would love to learn from a power user"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-16T02:40:18.323000+00:00",
    "content": "Yes I would love to do more!"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-16T02:10:02.032000+00:00",
    "content": "I was asked by the admins to register at the conference online and than they have issued a ticket for me. Talk directly to the guys."
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-16T01:47:48.949000+00:00",
    "content": "Haha when I tried to explain it to my parents I failed too lol. Very hard to explain what blockchain is and I don’t work from Bitcoin haha 😆"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-16T01:46:31.817000+00:00",
    "content": "Sorry if this question was answered before. For us who are coming and attending the conference, where do we get the pass? On the venue that day or email?"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-16T01:45:08.146000+00:00",
    "content": "How many people here are new to Farcaster? If anyone needs some guide on using it let me know happy to help. I’m a heavy user and this May I sold ‘Farcastea’ to the Farcaster community in Farcon. It came as community idea and brought to reality. This was the first tea on chain to sold. We used frames to sell it as well 😊"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-16T01:39:40.195000+00:00",
    "content": "Oh I would love to participate but I’m not there. Would you be able to do again in NS when it starts ? Please please"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-16T01:27:07.055000+00:00",
    "content": "Hello 👋 thanks for starting an art thread ✨️ 💖 it's a nice change from logistics conversations. I went to art school before I became an accountant for artists. Nowadays I get my art design fix on Canva, but I would love to create AI art as I'm fascinated by using AI as a medium if I can train my own creative LLM. In meantime, I will be inspired by your posts and look forward to art exhibition outings when we are at NS \n🙂"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-16T01:17:47.989000+00:00",
    "content": "@undefined thank you for opening this thread! I myself don't create art (except maybe for some writing from time to time) but I love art especially in the form of movies (founded Virtual Cinema Club with my friends in Europe) and architecture / urban design. Also my daughter Zuzanna is an artist creating digital characters for games and virtual worlds (Instagram: @shirrudraws)"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-15T22:39:43.178000+00:00",
    "content": ""
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-15T20:34:27.947000+00:00",
    "content": "super interested on the self dry needling workshop!"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-15T20:16:50.164000+00:00",
    "content": "https://www.singaporeartmuseum.sg/art-events/exhibitions/olafur-eliasson"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-15T20:08:27.354000+00:00",
    "content": "Imagination Station | ART"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-15T19:22:27.437000+00:00",
    "content": "@undefined if you're putting more time into this tool, making the pfps realistic similar to the Network State Conference speaker images will broaden the appeal (especially for non-crypto enthusiasts) while still being instantly recognizable as optimistic, solarpunk, and \"Network School\" style. \n\nPerhaps you could have \"realistic\", \"pixelated\", and other style options if you don't want to limit it to just one aesthetic."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-15T19:16:45.973000+00:00",
    "content": "Ah you went for \"NS punks\" aesthetic. Can people upload their own pictures for the pfp?"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-15T18:22:00.015000+00:00",
    "content": "If we are making NFT then we probably can't use real identity. Otherwise it is basically equivalent to doxxing yourself on chain"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-15T18:20:13.879000+00:00",
    "content": "I am totally down to make it feel like a game character creation process haha"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-15T18:17:08.052000+00:00",
    "content": "should totally be doable"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-15T18:16:43.360000+00:00",
    "content": "yeah that is not really very different from lazy mint"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-15T17:32:13.831000+00:00",
    "content": "Ideally I would like the users to select their pfp via UI, the built image would be pushed to IPFS with metadata. \n\nI always found it challenging when the CID keeps changing with each upload. Thats why I have done it centralized in the past (and Pinata)"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-15T17:27:16.224000+00:00",
    "content": "Should be fun"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-15T17:23:51.123000+00:00",
    "content": "There are more straightforward programmatic way to do it but these are kinda like the low code stack haha"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-15T17:23:34.772000+00:00",
    "content": "Oh and I dislike Pinata with a passion, I stopped their service like 5 months ago haha"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-15T17:21:10.449000+00:00",
    "content": "Def gotta pick your brain when we meet up, I haven't done dynamic minting before"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-15T17:05:03.092000+00:00",
    "content": "- Pinata or NFT.Storage: For storing images and metadata on IPFS.\n- HashLips Art Engine: To generate images and metadata for generative NFT collections.\n- OpenSea/Rarible: For lazy minting and selling NFTs without coding.\n- Thirdweb/Remix: For deploying custom smart contracts if desired."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-15T17:01:36.820000+00:00",
    "content": "Oh yes yes"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-15T16:41:44.508000+00:00",
    "content": "I experimented around with solar punk backgrounds and coded UI buttons to swap between traits. Will def add more art and spice it with personalized traits.  @undefined @undefined \n\nI added a folder as a UI for now as a gag, if anyone have any UI inspirations or direction let me know.\n\n@undefined do you have an idea on how to push the metadata and art to IPFS ?"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-15T12:15:03.346000+00:00",
    "content": "So just a heads up, people on X and elsewhere can fake that they’re also attending network school to try to get info. Just remember you can always verify in discord if someone is a member/has the role using @(theirusernamehere)"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-15T06:38:51.179000+00:00",
    "content": "🇵🇱 Polish is my native language; speaking also a bit of 🇷🇺 Russian and 🇮🇹 Italian (but only on restaurants' menu 😅 )"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-15T05:37:28.521000+00:00",
    "content": "https://warpcast.com/agnieszkagorska"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-15T04:41:28.971000+00:00",
    "content": "This weekend in Baku for Azerbaijan GP. Who are you rooting for in today's race?"
  },
  {
    "userName": "cameleon_75612",
    "timestamp": "2024-09-14T22:21:18.962000+00:00",
    "content": "damn wish I could make, really wana learn more in this area"
  },
  {
    "userName": "x8.design",
    "timestamp": "2024-09-14T17:24:55.477000+00:00",
    "content": "All my languages come under a single flag 😇🇮🇳"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-14T14:13:35.203000+00:00",
    "content": "Im hosting a small meetup for my AI film making community tomorrow in Singapore, if youre around please try to come - https://www.eventbrite.com/e/ai-filmmaking-meetup-singapore-curious-refuge-community-meetup-tickets-1013822820347"
  },
  {
    "userName": "iamshefalimanojinc",
    "timestamp": "2024-09-14T13:47:24.905000+00:00",
    "content": "Hi there! Thank you for organizing. I arrive 9/20 at 9:00AM, can meet you all later!"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-14T11:33:17.091000+00:00",
    "content": "Sounds good, I'll give it a spin."
  },
  {
    "userName": "x8.design",
    "timestamp": "2024-09-14T11:33:04.353000+00:00",
    "content": "🙏🏼💃🏻💕"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-14T11:15:37.160000+00:00",
    "content": "We use primarily Nano which I'm guessing you don't have, BTC and such is also possible but only via swap which makes minimum deposits a bit higher in practice."
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-14T11:14:32.800000+00:00",
    "content": "If you want to try out other models (paid ones) let me know, will gladly add some funds to your account to try with"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-14T11:14:03.466000+00:00",
    "content": "Yep then probably the free model! Great to hear even that one worked okay, that's definitely not a top model 😅"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-14T11:12:50.755000+00:00",
    "content": "I just hummed straight in without signing up"
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-14T10:21:18.833000+00:00",
    "content": "things i would love to offer: leading or co-leading a mobility group, teaching people how to do dry needling (Western acupuncture) on themselves, sharing the foundations and concepts of the dance popping (robot, waving, tutting, animation, boogaloo)\n\nthings i wish someone else would offer: some combination of somatics/experiential anatomy/qigong/functional range conditioning/knees over toes/human garage group, some combination of ultimate frisbee/dodgeball/kickball/pickleball/tennis/basketball/volleyball/football league, 10k steps club, weekly fasting group, a collaborative short form video/AI/motion meme making collective, cooking/dinner party club, other styles of dance lessons club, art club, copywriting club, self defense/grappling/striking club"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-14T08:34:30.355000+00:00",
    "content": "You and I are totally on the same page. My planning process for anything nowadays is a structured conversation with the highest intelligence AI I have access to, and the results are summarized and saved as a starting point for later planning.\n\nIt vastly improves the planning process."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-14T06:48:42.875000+00:00",
    "content": "There are existing tools quite popular among popup city scene, https://www.sociallayer.im/ is used by many like Vitalia"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-14T05:45:58.749000+00:00",
    "content": "Thanks! Did you use the free model? We usually recommend ChatGPT-4o, though we also have o1-preview and o1-mini nowadays for those that want to experiment with it."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-14T04:41:18.391000+00:00",
    "content": "I had started this thread for now to gather ideas for workshops and events we could host ourselves, as well as to brainstorm those we'd like others to organize. Not just for learning opportunities, but also fun activities that bring us together. https://discord.com/channels/900827411917201418/1282905830332694559"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-14T04:40:43.615000+00:00",
    "content": "As the NS community could scale fast in the coming time, how about an intuitive app that could bring the community together for collaborations, conversations, etc both online and offline, with a little profile on each member? Could try AI tools to test out prototypes."
  },
  {
    "userName": "sambhav012",
    "timestamp": "2024-09-14T04:17:00.663000+00:00",
    "content": "Pondering on a basic idea - in the spirit of keeping things simple, and keeping in mind data privacy, how about creating a collaboration group on discord with threads for different proposed projects / brainstorming ideas / seeking guidance and people can go through and self volunteer..."
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-14T03:42:23.193000+00:00",
    "content": "Also agree to give this a KISS and the most basic starting point is the best. \n\nI think once we are all on site and had our initial kickoff we can start having something up and running in 1-2 days max."
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-14T03:25:05.290000+00:00",
    "content": "I’m also part of another 1k+ people online community for over a decade and they built now custom feature on top to do this type of queries: member fills out their profiles, then llm is used to suggest who to connect with. I know the dev quite well so can ask about his approach and learnings. Main issue currently is the UX here right now: there is no actual search field. People get suggested based on what I enter in my profile.\nTechnically this would change the corpus and need to revectorize a document for retrieval via llm. When you upload this to an external service it gets quite tricky to understand what is going on plus difficult to attach new features to the person entity (all our onchain proofs of burn, learn, weekly progress reports require a mix of relational db and vectorized data for the retrieval."
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-14T03:10:52.654000+00:00",
    "content": "I would like us to come up with an AI assisted decision framework that looks at pros and cons (!!!) of an approach. ChatGPT 1o seems best. \nVersion control prompt and response to be able for later generations to understand thought process on why something exists now the way it is.\n\nFor data analysis I’d prefer a self hosted open source llm. Can run on consumer hardware (beefy Mac). \n\nFor the tooling I’d also be interested to see what experience people have had. When we tried to run a DAO in 2021 we failed as engineering overhead to setup open source versions was too large. But now OS tools improved and we have ChatGPT."
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-14T03:10:48.544000+00:00",
    "content": "Ya thats fair, self owned/controlled is best so we can manage access better"
  },
  {
    "userName": "x8.design",
    "timestamp": "2024-09-14T03:06:34.646000+00:00",
    "content": "lol make a Google sheet , keep it open for a week and one editor can put it all together into airtable"
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-14T03:04:17.478000+00:00",
    "content": "Having an agent on such data is really tricky imho from a privacy perspective. \n\nRather see if we can use own hardware  to use an open source model on our own."
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-14T02:56:28.409000+00:00",
    "content": "I like this one as a general default incl. saving the prompt in git to be able to iterate on it. \nNew chargpt o1 model is probably a crazy good fit."
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-13T23:15:54.631000+00:00",
    "content": "Thanks for all the very valid  security and privacy concerns. \n\nIt would also look bad if we criticize governments for data leaks and then have our own data leak. \n\nA few ideas\n1.) If we opt in and give our own info, then we know what we are signing up for. \n2.) We wait for the NS core team to see if it's part of the NS app. \n3.) We create something a little more complex where people pop up when we search for key words. As opposed to one list with all the info."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-13T22:57:30.532000+00:00",
    "content": ""
  },
  {
    "userName": "cameleon_75612",
    "timestamp": "2024-09-13T22:57:01.302000+00:00",
    "content": "im arriving at midnight too, guess there will be a few of us at the airport"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-13T22:55:25.876000+00:00",
    "content": "There seems to be a set of software that every colive needs. Off the top of my head: Communications platform (discord), polling platform (discord), knowledge base/wiki, scheduling platform, announcements channel, Attendee directory."
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-13T22:49:31.242000+00:00",
    "content": "The concern is that someone can just download all the data and leak it if all data is given to all attendees. But if data about other attendees is not given, then we miss out on potential for collaboration based on interests and skills"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-13T22:48:06.409000+00:00",
    "content": "if privacy is a real concern, which I totally understand, running a cloud infrastructure server would make sense? \n\nspin up a 5 dollars a month digital ocean / vultr / Hetzner and install the necessary packages to run any web service for full control and privacy?\n\nJust a thought"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-13T22:48:00.450000+00:00",
    "content": "I feel that at this time we have an opportunity to experiment with new tools that did not exist at this time last year. Foremost among them, for me, is using AI at the planning stage (rather than just at the implementation stage)."
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-13T22:42:53.809000+00:00",
    "content": "As a possible alternative or future version, could upload the data and create a gpt agent on it, then give everyone the private link to the openai gpt. Or a open source version with llama. This way people can just prompt “list people with X related skills/interests” \n\nOf course the link could be leaked but as long as its not sensitive info."
  },
  {
    "userName": "alta_81554",
    "timestamp": "2024-09-13T22:41:51.549000+00:00",
    "content": "Mee"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-13T22:41:33.574000+00:00",
    "content": "My preference would be for an iterative process of careful planning, which uses AI as a copilot to the organization."
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-13T22:40:21.876000+00:00",
    "content": "But it raises a larger question about how this organization will operate. Do we simply self organize around the tools we prefer, and bid for others in the community to use our system? Do the people organizing the curriculum suggest which tools to use? or do we discover this through an iterative process of careful planning?"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-13T22:39:06.499000+00:00",
    "content": "I believe @undefined was one of the people collecting info through a process. So I would suspect that since he is evidently facilitating this experience, he may already have some plans on how to handle the info collection process"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-13T22:37:40.357000+00:00",
    "content": "At Vitalia, another colive, several people tackled the problem of collecting information from people with forms using different technical solutions. The main challenge was getting everyone to fill out the forms."
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-13T22:15:03.239000+00:00",
    "content": "I love it, excited to explore that option. Not personally familiar with WP tooling but it’s used for so many things, happy to get familiar with it.\n\nZapier has a cool internal tool, I think called P2, which is like a WP-based discussion forum. Will try to link to it later!"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-13T21:47:42.633000+00:00",
    "content": "Yes, Airtable sounds the fastest and easiest and schoolers could add their own details optionally, to suit their personal privacy needs. But for 150 editors I think we'd need the Enterprise plan, and Airtable doesn't disclose its pricing. \nLike @undefined I'm wary of creating a honeypot. \n\nBy using a combination of the open-source WordPress CMS and free plugins, we could create a fully functional, private, searchable database of skills and contact details for 150 users without any cost. A WordPress solution may not be as user-friendly or feature-rich as platforms like Airtable, but we have tech-savvy users and a NS administrator can he helped to set up  the system.\n\nJust an idea."
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-13T21:31:07.174000+00:00",
    "content": "I'd love to escape the monthly subscription SaaS model. Love pay per use model. Nice work! I asked it a tough question and it took some time to think and give a well rounded answer without cliches. Nice"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-13T20:59:15.813000+00:00",
    "content": "I've been thinking about the user limit... Ideally, each person could be responsible for their own row in a table and edit it whenever they like without an \"admin\" managing it. I was thinking about Google Sheets, but I think even that has something like a 100 person collaborator limit. I think the options are to find something that doesn't have this limit, deal with having an admin for v1, or do something custom.\n\nI'm biased toward whatever can be shipped most easily and that can validate whether this is actually useful, so if there isn't some other perfect existing tool I would default toward just starting with an Airtable."
  },
  {
    "userName": "blackmajic5000",
    "timestamp": "2024-09-13T19:34:16.510000+00:00",
    "content": "Cursor has become my go to for programming"
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-13T19:20:23.625000+00:00",
    "content": "And I just was reading your intro as well. Definitely looking forward to talk how to transfer types of data into privacy focused tokenized data solutions."
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-13T19:12:57.933000+00:00",
    "content": "Airtable is a good start imho to have something that works early and can be wrapped with supabase to build actual tooling on top.  Limitation is user count/price. \n\nhttps://supabase.com/docs/guides/database/extensions/wrappers/airtable\n\nThere are also open source airtable clones which would need to be deployed. \n\nI think we’ll extend the farcaster connection idea a lot. More like a network school OS seems feasible to work on."
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-13T19:01:21.532000+00:00",
    "content": "Hello Hui, apologies for the late response. Currently getting everything ready for my departure to Malaysia. \n\nI think that personal data is literally just personal for now and for now can live on private computer unit in a home network. \n\nIf you decide to make it available to e.g. train an AI it can be potentially solved to be used how you described. \n\nData I am interested in are entities like people, locations, network, time, topic clustering through named entity recognition, health data, nutrition, exercise. \n\nCollection through web2 apps mainly and scripts running locally on your machines."
  },
  {
    "userName": "iamshefalimanojinc",
    "timestamp": "2024-09-13T18:58:34.980000+00:00",
    "content": "Thank you for organizing! Would love to attend."
  },
  {
    "userName": "0xtito",
    "timestamp": "2024-09-13T15:48:33.237000+00:00",
    "content": "I predominantly use AI for programming tasks. Particularly, for initializing some task I have. Its great at giving me a starting point I can work from. My co-founder and I also heavily use AI for an internal tool we are building. Particularly in an agentic system like OpenHands.\n\npreplexity is just my go to for all general news. Grok is pretty great when it comes to real time events and its image generation"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-13T14:03:37.268000+00:00",
    "content": "Yes! I coincidentally\nmentioned something similar to the team in the onboarding form: a database with all participants that you can query per skill (key words) and be able to book a time slot to consult with a person that can offer that skill. This could be part of the internal NS app and should have solid security. It wouldn’t be very nice to get the list of users leaked for example. I’m happy to help with the product discovery and UX part."
  },
  {
    "userName": "_estherr22",
    "timestamp": "2024-09-13T12:21:00.392000+00:00",
    "content": "Ah so cool! Enjoy 😁"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-13T11:35:37.718000+00:00",
    "content": "Aye!"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-13T11:31:39.870000+00:00",
    "content": "Hello to all F1 fans among us. Here I have opened a thread: https://discord.com/channels/900827411917201418/1283804320264884349"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-13T11:23:54.294000+00:00",
    "content": "Opening a thread. Let's gather all F1 fans attending the NS 🙂 Greetings from Baku, where I am attending the Azerbaijan GP this weekend!"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-13T11:23:48.651000+00:00",
    "content": "NS Fans of F1"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-13T06:40:48.843000+00:00",
    "content": "I built NanoGPT (https://nano-gpt.com/) so mostly use that, haha. The models I mostly use on there are Claude 3.5 Sonnet, ChatGPT, Gemini and Flux though, so will vote those as well!"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-13T05:39:44.884000+00:00",
    "content": "https://farviz.xyz/\nFixed the database tables and indexes.\nQueries are insanely fast now \nAlso added usernames from the warpcast usernames thread"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-13T04:41:33.434000+00:00",
    "content": "and it is great at coding!"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-13T04:40:17.909000+00:00",
    "content": "We should totally think about forward approach 🔥  we are here to invent the future!"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-13T03:34:51.127000+00:00",
    "content": "Not sure how many people will show up on the day from my end (I hosted on Nomadlist and at the moment 7 people RSVPed). Probably not a good idea to invite someone you’ve already knew. My intention is to keep it small (less than 10 people) so we can talk to each other and get to know each other better."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-13T03:30:18.464000+00:00",
    "content": "I use minimax in addition for text to video, Leonardo for image, video, Suno for music"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-13T03:11:42.489000+00:00",
    "content": "we might as well build something for 150 people that will work for 150,000 🙂"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-13T03:09:55.898000+00:00",
    "content": "Venice.ai has good privacy infrastructure, and doesn't save users' text or prompts on its servers, saving conversation history on our own devices"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-13T03:09:55.312000+00:00",
    "content": "What AI tools do you use regularly? Reply in thread with the use-cases that yo..."
  },
  {
    "userName": "oferrotem",
    "timestamp": "2024-09-13T02:49:47.743000+00:00",
    "content": "In that case, may I invite a couple of friends?"
  },
  {
    "userName": "oferrotem",
    "timestamp": "2024-09-13T02:47:56.226000+00:00",
    "content": "If anyone's arriving earlier, on September 20th I'm attending a meetup my friend (who also used to work at Collider), Daniel, is organizing. You're all welcome to join and have some durians 🤠\nhttps://lu.ma/wtbl7csc"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-13T02:30:54.313000+00:00",
    "content": "It’s my digital nomad meet-up so there will be other people from outside NS 😊"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-13T02:22:58.092000+00:00",
    "content": "We can create a form from the www.deform.cc. We'll set up the questions and send the form to the 150 people. Once they respond, we’ll have all the data collected in one place."
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-13T02:19:07.157000+00:00",
    "content": "I wonder if a uniquely useful version of this system could exist today because of the current generation of AI tools.\n\nYesterday's standard might be to create an Airtable, with a database for people (tagged with skills and interests) and a database for projects. If one of us had a project idea, we could scan the people table to find potential collaborators. If one of us was looking for a project to work on, we could scan the project table.\n\nNow though, I wonder if you could let people combine free-form writing and box-ticking to input whatever they think is relevant for their bio and/or project descriptions. Then, instead of scrolling through a spreadsheet when you have a project idea, perhaps you could share the project with the system and have the system propose collaborators.\n\nHonestly, with 150 people, \"yesterday's standard\" is probably good enough. But fun to think about for a future project!"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-13T02:09:43.730000+00:00",
    "content": "I would love to come, but we arrive on midnight that day so hope to see you on the NS conference instead ❤️"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-13T01:57:56.021000+00:00",
    "content": "Idea\n\nCould we create a simple database of skills and experience individuals have in the network school?\n\nThen we could \n1.) Find people to collaborate with based on skills and experience.\n2.) See what people are searching for the most.  That would help us see the skills and experience that are most in demand.  Then we would know what we should learn and who we need in bring into our community. \n\nLots of impressive bios in reception but remembering who is who in Discord is challenging. \n\nWin and help win."
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-13T01:46:19.730000+00:00",
    "content": "@undefined 👆🏻"
  },
  {
    "userName": "oferrotem",
    "timestamp": "2024-09-13T01:05:52.453000+00:00",
    "content": "I'd love to get the location📍"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-13T00:57:09.038000+00:00",
    "content": ""
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-13T00:27:40.020000+00:00",
    "content": "<#1279850448815132702> see here"
  },
  {
    "userName": "oldkiraicoal",
    "timestamp": "2024-09-13T00:13:15.233000+00:00",
    "content": "This is so cool! Count me in!"
  },
  {
    "userName": "vitorangonese",
    "timestamp": "2024-09-12T23:39:55.394000+00:00",
    "content": "I’ve never been so jealous, hahaha. I’ll be leaving my city at 7am on Thursday and will land in Singapore at 5pm.. Saturday 5pm.. hahahah"
  },
  {
    "userName": "oferrotem",
    "timestamp": "2024-09-12T23:07:56.656000+00:00",
    "content": "BTW, I'm arriving in the 20th, after my 2-hour flight which crosses 1 time zone 😄👌"
  },
  {
    "userName": "oferrotem",
    "timestamp": "2024-09-12T23:06:48.752000+00:00",
    "content": "Yeah, happy to join 🤠\nKeep me posted!\nCould you share that event's details?"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-12T20:23:43.519000+00:00",
    "content": "Anyone else going to be in Singapore on the 21st and want to do something? Sightseeing? A pre network-state-conference event? \n\nI know @undefined is organizing a digital nomad event in the AM. Would work well to meet there. Hang out, do something after that. \n\nBy the afternoon/evening I will probably be done for the day, after my 17-hour flight which crosses 12 time zones 🤣"
  },
  {
    "userName": "maxcandor",
    "timestamp": "2024-09-12T19:01:51.876000+00:00",
    "content": "New OpenAI model just dropped"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-12T16:53:42.861000+00:00",
    "content": "lets work on unsolved problems 🙂"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-12T16:52:54.902000+00:00",
    "content": "nice, good index, once the data in postgres is backfiled I plan to add more tables, currently its just messages."
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T16:52:15.573000+00:00",
    "content": "It's working well now:\nhttps://x.com/randombishop/status/1834267530698858872"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T16:51:28.947000+00:00",
    "content": "I think Dune pricing is a lot more reasonable. Also as long as the the query is not too big, free plan usually is enough"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T16:51:23.519000+00:00",
    "content": "It was kind of a subtle one to notice"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T16:51:05.970000+00:00",
    "content": "I found the solution but I am curious if you will figure it out, challenge open 🙂"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T16:50:36.047000+00:00",
    "content": "Don't know about Neynar, but I sometimes use the Dune dataset as part of my free Dune plan.\nI also built my own dataset on Big Query (see doc here: https://github.com/randombishop/fc_docs/blob/main/dataset.md)"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-12T16:49:50.681000+00:00",
    "content": "that's what the problem is with d3, its hit and miss. I had to sit a couple of days to get it right\nI can check out in a couple of hours"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-12T16:48:09.391000+00:00",
    "content": "looks good, do they have any limits, neynar was like 50$ for 2500 queries, that's why had to index our own db"
  },
  {
    "userName": "sambhav012",
    "timestamp": "2024-09-12T16:37:39.814000+00:00",
    "content": "@sambhav"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T15:13:48.410000+00:00",
    "content": "Will give the solution to the challenge in a few days on twitter"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T15:07:22.751000+00:00",
    "content": "dang super cool"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T15:06:57.424000+00:00",
    "content": "Not the only method to render them but it's a popular one"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T15:06:29.057000+00:00",
    "content": "I didn't know that this kind of graph is actually using physical simulation"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T15:06:24.945000+00:00",
    "content": "I don't think any current AI could have solved it"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T15:06:09.881000+00:00",
    "content": "Not going to post it here if someone wants a challenge"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T15:06:02.148000+00:00",
    "content": "dang Claude doing any better?"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T15:05:50.542000+00:00",
    "content": "Actually found a solution that solved 80% of it, still spinning a bit but not as fast"
  },
  {
    "userName": "alta_81554",
    "timestamp": "2024-09-12T15:05:33.116000+00:00",
    "content": "I am SO down!!"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T15:05:18.718000+00:00",
    "content": "Lol @undefined already tried ChatGPT recommendations and none of them worked, I think he's not doing physics, just shooting darts in the dark"
  },
  {
    "userName": "fisheatschips",
    "timestamp": "2024-09-12T15:00:01.882000+00:00",
    "content": "Whao, the conference is literally on the F1 Track at turn 17\n\nYou can see the full schedule in local time here https://www.formula1.com/en/latest/article/formula-1-singapore-airlines-singapore-grand-prix-2024-timetable.6yPgmO35hfJKpBxBytr2GX\n\nThis is so awesome, the conference finishes at 8pm and that's the start time of the race, It would be great if we could access somewhere after the conference to watch the race from, perhaps on the higher floors.\n\nAlso fyi for attendees I am quite sure traffic/transport/foot traffic will be heavily disrupted around the venue.  If there's any guidance from the Organizers on access to and from the venue that might be helpful."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:40:56.850000+00:00",
    "content": "I am not sure if ChatGPT is just bullshiting but might worth a try:\n\nThe constant spinning in a D3 force simulation is typically caused by an imbalance in the forces applied to the nodes in the graph. In your case, the radial force may be causing this behavior, as it constantly pulls the nodes toward a specific point. Here are some suggestions to avoid the spinning:\n\n1. **Reduce the strength of the radial force:**\n   The radial force might be too strong, so you can try reducing its impact or even removing it temporarily to see if it stops the spinning.\n\n   ```js\n   .force('radial', d3.forceRadial(50, SIMULATION_WIDTH / 2, SIMULATION_HEIGHT / 2).strength(0.05));\n   ```\n\n   You can experiment with different `strength` values to find the right balance.\n\n2. **Add a force to dampen the motion (force simulation velocity decay):**\n   D3 simulations have a `velocityDecay` parameter that can help slow down the motion over time, reducing or stopping spinning.\n\n   ```js\n   this.simulation = d3.forceSimulation()\n       .velocityDecay(0.9)  // Adjust this number (0.9 is a typical value for damping)\n       .force('link', d3.forceLink().id((d: any) => (d.id)).distance(100))\n       .force('charge', d3.forceManyBody().strength(-300))\n       .force('center', d3.forceCenter(SIMULATION_WIDTH / 2, SIMULATION_HEIGHT / 2))\n       .force('radial', d3.forceRadial(50, SIMULATION_WIDTH / 2, SIMULATION_HEIGHT / 2));\n   ```\n\n   A higher `velocityDecay` value (closer to 1) slows down the motion more quickly.\n\n3. **Ensure there are no excessive charges or imbalances:**\n   Sometimes, an overly strong charge force can create erratic motion. You might want to experiment with the charge strength to find the right balance between stability and attraction.\n\n   ```js\n   .force('charge', d3.forceManyBody().strength(-100));\n   ```\n\n   Reducing the charge strength should help stabilize the layout.\n\nTry these adjustments, and they should help to stop or reduce the spinning behavior of your graph."
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T14:35:13.575000+00:00",
    "content": "Also, unrelated @undefined , I found that using d3 directly instead of the lib I was using renders the graph and animation much better. So I switched to native d3.\nBut I am having this issue now:\nhttps://x.com/randombishop/status/1834233624851255801"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T14:34:15.667000+00:00",
    "content": "No idea"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:34:00.588000+00:00",
    "content": "Wait can you already create pre-trained GPT? Or is that false advertisement"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:33:33.404000+00:00",
    "content": "🤣 dang"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T14:33:11.904000+00:00",
    "content": "There's even a chatgpt to help you with your queries here: https://chatgpt.com/g/g-lKnQHXJKS-dune-x-farcaster-gpt"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T14:32:57.503000+00:00",
    "content": "Yes"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:32:29.342000+00:00",
    "content": "https://docs.dune.com/data-catalog/community/farcaster/links"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:32:27.398000+00:00",
    "content": "Ah this could actually work. I see it has a few things we need"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:32:01.830000+00:00",
    "content": "Are you referring to this one"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:31:58.111000+00:00",
    "content": "https://docs.dune.com/data-catalog/community/farcaster/overview"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:30:58.774000+00:00",
    "content": "They need to thank God that Neymar is still not on Farcaster"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:30:45.125000+00:00",
    "content": "Like did they even try to google"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T14:30:21.484000+00:00",
    "content": "I know 😂"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T14:30:07.728000+00:00",
    "content": "BTW Neynar is such a SEO disaster company name. It is too close to Neymar"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-12T14:29:21.778000+00:00",
    "content": "@undefined & @undefined check out the neynar dune dataset, could be an option too?"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-12T13:57:21.681000+00:00",
    "content": "ah I see, thanks for the explanation! good point. 🌞"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T13:50:33.789000+00:00",
    "content": "I presume that the need is to stay private from the guys, which is totally reasonable. IIRC there are ways to start private channels in Discord which allows you to only invite select members to join. I think it would just require some permission from the admin"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-12T13:38:38.312000+00:00",
    "content": "I would love that, and I dont use Meta products. Any chance of keeping the communication chats here?"
  },
  {
    "userName": "iamshefalimanojinc",
    "timestamp": "2024-09-12T13:01:07.874000+00:00",
    "content": "A few of us would love to start a girls group chat — Send me a DM  If you’d like to be included 🤍 I may do it on Signal, since many of us don’t use discord frequently."
  },
  {
    "userName": "krisxin",
    "timestamp": "2024-09-12T09:04:26.432000+00:00",
    "content": "sounds great"
  },
  {
    "userName": "krisxin",
    "timestamp": "2024-09-12T08:42:53.703000+00:00",
    "content": "@krisx"
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-12T08:05:05.948000+00:00",
    "content": "I could be interested, built a discord bot to summarize courses' pdfs and provide students with summaries fit for learning purposes"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-12T06:43:14.888000+00:00",
    "content": "In case anyone who is interested in working with Farcaster data more easily, we might be able to get some shared group DB working with @undefined, so we don't have to rebuild the same wheel. Just gauging interest right now"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-12T04:53:28.288000+00:00",
    "content": "Good direction, I will make it with UI in mind"
  },
  {
    "userName": "blackmajic5000",
    "timestamp": "2024-09-12T04:19:46.389000+00:00",
    "content": "@ blackmajic5000 Same as discord"
  },
  {
    "userName": "blackmajic5000",
    "timestamp": "2024-09-12T04:18:52.116000+00:00",
    "content": "DMed"
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-12T03:00:46.827000+00:00",
    "content": "If you need help, lmk. I’d be happy to “earn” via ops help"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-12T02:59:57.442000+00:00",
    "content": "You read our minds @undefined. We're working on a guide to compile information for common queries. Coming soon!"
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-12T02:47:19.120000+00:00",
    "content": "I imagine you would be getting a lot less DMs/emails etc to respond to if there was one place with all FAQs consolidated! Help us help you"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-12T00:17:17.817000+00:00",
    "content": "@beecurious"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-11T23:20:08.478000+00:00",
    "content": ""
  },
  {
    "userName": "fisheatschips",
    "timestamp": "2024-09-11T23:05:44.423000+00:00",
    "content": "@undefined"
  },
  {
    "userName": "oldkiraicoal",
    "timestamp": "2024-09-11T21:35:55.832000+00:00",
    "content": ""
  },
  {
    "userName": "oldkiraicoal",
    "timestamp": "2024-09-11T21:35:36.551000+00:00",
    "content": "I'm having this same issue that someone else was, except their solution was to use Safari and I'm on an Android"
  },
  {
    "userName": "oldkiraicoal",
    "timestamp": "2024-09-11T21:33:34.903000+00:00",
    "content": "@heyzeus"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T21:24:52.475000+00:00",
    "content": "No problemo 👍"
  },
  {
    "userName": "oldkiraicoal",
    "timestamp": "2024-09-11T21:16:50.619000+00:00",
    "content": "This sounds my speed. Local street food in a foreign place with new friends? Count me in"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-11T20:21:18.098000+00:00",
    "content": "@ calvinlegassick"
  },
  {
    "userName": "cameleon_75612",
    "timestamp": "2024-09-11T19:41:21.376000+00:00",
    "content": "I have just always used my phone and a rode microphone so I’ll bring those but would love to learn what everyone else uses"
  },
  {
    "userName": "paarug",
    "timestamp": "2024-09-11T19:39:33.746000+00:00",
    "content": "I would love to host the BJJ classes. I am super passionate about it and would love to introduce everyone to the sport - an added skill while everyone burns calories 😄\n\nWould also love to help everyone learn more about the entire solana ecosystem over the past 3 years if there is enough interest!"
  },
  {
    "userName": "x8.design",
    "timestamp": "2024-09-11T18:44:35.250000+00:00",
    "content": "@rudrakanya"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-11T18:43:58.607000+00:00",
    "content": "@undefined @undefined let's start with threads (like this one) in <#1278081837780041749> for hackathon ideas. For the projects that gain traction, we'll figure out a way to support long form discussion."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-11T18:10:37.019000+00:00",
    "content": "@everyone we request folks to not do multichannel pings for support (i.e. simultaneously messaging in public Discord, DMing on Discord, sending Whatsapp, and reaching out via email for the exact same question). \n\nPlease ask your questions publicly in Network School Discord if it is obviously public. You can also ask privately (by DMing @undefined or @undefined) if it's something personal or you aren't sure the question should be public. \n\nDiscord is our primary communications platform. Although we may share certain details via email so please add admit@ns.com and support@ns.com to your primary inbox so our emails don't go to the spam folder.\n\n**My goal is to get to everyone's queries ASAP. If I haven't addressed your question in 24 hours, DM me @undefined.**"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-11T17:58:13.641000+00:00",
    "content": "Hey All, looking for members to join me in a hackathon.\n\nBelow is the problem we having a crack at. DM if this resonates.\n\n\"Develop a Gen AI powered tool to make a teaching assistant to teach a student using the Socratic teaching method. The Socratic method is where the assistant asks probing questions and leads the student to the answer instead of revealing the answer.\""
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-11T17:56:44.531000+00:00",
    "content": "yep"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-11T17:37:07.839000+00:00",
    "content": "If you folks make an announcement channel, it might help to make the media engagement stuff very clear, as I imagine a lot of folks might read through the contract fast and miss that bit. If it gets posted in one of these chat channels it’ll just get lost in the noise."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-11T17:34:44.536000+00:00",
    "content": "We should just completely ignore media corporations. \n\nLike Balaji shared earlier with a reference to Lulu's post, there is no need for PR anymore. Instead we build up our own followings and go direct."
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-11T17:33:16.979000+00:00",
    "content": "Best not to respond at all, if you read the contract they sent out, they don’t want any contact with legacy media. There’s one line in there about it easy to miss."
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-11T17:17:47.519000+00:00",
    "content": "Yep, just ignored it as Balaji mentioned haha"
  },
  {
    "userName": "alta_81554",
    "timestamp": "2024-09-11T17:01:50.974000+00:00",
    "content": "I haven't posted anything in my social media yet, as I was waiting to learn more about what we can share and/or not (in the contract) to keep things low key. I wonder if it's best to not respond at all or say \"I don't know\"?"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-11T16:44:47.987000+00:00",
    "content": "Any of yall getting these dms as well? Haha"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-11T16:43:31.568000+00:00",
    "content": "I have gear that I can bring from Singapore. Shure Mics + Sony A7siii \n\nLights as well. Depends how crazy we wanna go :)) \n\nWon’t bring these on the 23rd tho, will likely pick it up on one of the first few weekends"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-11T16:40:07.234000+00:00",
    "content": "@undefined @undefined it would be great to have a simple tool that all Network Schoolers can use to create an artistic pfp with a solarpunk background. Similar to the speaker list images Balaji shared above. The vibe is futuristic and positive."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T16:19:13.385000+00:00",
    "content": "👀 man is cooking"
  },
  {
    "userName": "memester.lens",
    "timestamp": "2024-09-11T16:01:34.586000+00:00",
    "content": "@memester"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-11T15:51:21.123000+00:00",
    "content": "Would be amazing to put together some therepeutic practices for renewal, letting go the remnants of older selves and societies, truly make new beginings with a new self and state"
  },
  {
    "userName": "dhairya.chheda",
    "timestamp": "2024-09-11T15:39:03.923000+00:00",
    "content": "@dhairyachheda.eth"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T15:12:48.273000+00:00",
    "content": "Thanks for pointing me to replit, pretty cool technology, it feels like a mini GCP/AWS but 10x easier to use. Definitely a great educational and collaboration tool, I guess we'll be using that at NS?\nAnyways, quick update:\n1) I open sourced my frontend here: https://github.com/randombishop/fc_front\n2) Also created a public replit here with run and deploy configured and working : https://replit.com/@nabilabdellaoui/fcfront \nPlease let me know what you had in mind next 🫡"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-11T15:01:05.172000+00:00",
    "content": "HackMD looks cool!"
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-11T14:59:06.447000+00:00",
    "content": "[notion](https://www.notion.so/)"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-11T14:53:40.253000+00:00",
    "content": "you could do it with AI, but I will give it another go this weekend with a different approach."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T14:35:07.891000+00:00",
    "content": "For those of you who are social scientists and organizer in heart, this might be an interesting read: https://docs.google.com/document/d/1H91uI7CzFV7LUT8M9OIk2P33dVgZSrFeZSiaL7Cnyk8/mobilebasic"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T14:25:26.005000+00:00",
    "content": "Sure,  sounds like a good idea 👍"
  },
  {
    "userName": "__ysh",
    "timestamp": "2024-09-11T14:19:51.537000+00:00",
    "content": "@ Ysh"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T14:11:57.196000+00:00",
    "content": "Do you feel something like <#1281499249988735018> would be a good fit for your need?"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T14:09:25.558000+00:00",
    "content": "Same here, don't have any community organization skills. I'll let @undefined & @undefined figure out what works best..."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T13:47:59.290000+00:00",
    "content": "Ah I am not an expert in Discord but do you think format like <#1281499249988735018> would be a good fit? Basically we can start a permanent forum post for each hack project with good engagement from the community.\n\nWondering what the admin team thinks @undefined @undefined"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T13:46:17.673000+00:00",
    "content": "HackMD is a popular choice for Ethereum Foundation as well!"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-11T13:43:54.585000+00:00",
    "content": "@ rrominarr"
  },
  {
    "userName": "carlb",
    "timestamp": "2024-09-11T13:27:54.775000+00:00",
    "content": "would be cool if it were possible to query the NS NFT and find content created by us"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-11T13:24:22.414000+00:00",
    "content": "for small teams, I really recommend https://hackmd.io/ I used it for years at a previous project I was involved in and it's very useful for technical people and easy for nontech people to use"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-11T13:22:38.898000+00:00",
    "content": "from what I understand the NS admin team is preparing a wiki so I am curious to see how that is going to look like and what functionalities it will bring; hopefully everyone will be able to add info on the projects they are working on there"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-11T12:53:51.822000+00:00",
    "content": "I'd like to host introductory workshops on Bitcoin Layer 2's like Stacks smart contract layer for Bitcoin, if anyone wants to learn Clarity coding or No Code Clarity. I'm on the Stacks Link council, was at Bitcoin Builders Conference, and hosted Stacks Australia events, so have all the resources to hand.  It's a very exciting space right now, with Nakamoto upgrade - a lot of NFT art, DeFi and DAO projects, that'll use sBTC, a trustless peg to BTC."
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-11T12:47:40.720000+00:00",
    "content": "I am trying to squeeze my podcasting gear into my biggest suitcase today 😄"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-11T12:47:35.127000+00:00",
    "content": "Podcasting studio"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-11T12:45:21.569000+00:00",
    "content": "How about using a WordPress private blog? It would allow multiple users to create and share text, images and video content."
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-11T12:45:20.797000+00:00",
    "content": "Structured collaboration platform"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T12:37:46.058000+00:00",
    "content": "@undefined It's exciting that we already have a couple of prototypes for this project already 🚀  Could we create a dedicated channel for it? We could pin the main links there and make subthreads..."
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T12:07:35.558000+00:00",
    "content": "Also just open sourced the front end repo if anyone is interested:\nhttps://github.com/randombishop/fc_front"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T12:07:29.587000+00:00",
    "content": "😉 We have one \"set up physical devices\" as volunteering item on the onboarding form. Feel like we are cooking."
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-11T12:02:12.999000+00:00",
    "content": "I’m curious how many podcast hosts there are in our group. Would it be possible to set up a dedicated creative studio for podcast recordings? I assume there will be several hosts in this cohort, and if we could pool our equipment together and have a fixed space for recording high-quality content, it would be a fantastic resource for everyone!"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-11T11:58:31.384000+00:00",
    "content": "thanks, used d3 for visualization"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T11:57:55.156000+00:00",
    "content": "@undefined Cool, will post about it here from now on...\nHere's the video:"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T11:55:53.126000+00:00",
    "content": "Very nice, been working on the same idea too, which lib did you use for graph rendering?"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T11:44:33.693000+00:00",
    "content": "As our Discord continues to grow and more amazing content and project ideas come up, I’m thinking about how we can best organize and collaborate on long-term documents and projects. \n\nWhile Discord is fantastic for discussions, tools like Notion or Google Workspace could help with more structured collaboration. However, these can get expensive with a large group (about 150 people) as it is charged per person per month. \n\nDoes anyone know of free or more affordable options that work well for document collaboration? Or perhaps there’s a way we could set something up that fits our needs?"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-11T11:40:15.586000+00:00",
    "content": "Yeah I'll request a list from @undefined @undefined of farcaster usernames of everyone"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T11:38:09.753000+00:00",
    "content": "I think there are now more people in that group chat than in the thread now: https://warpcast.com/~/group/N21PFzmwJ9FBTVdaBpPV4Q\n\nBut @undefined and @undefined should soon have the complete list from the onboarding form"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-11T11:37:45.326000+00:00",
    "content": "@ emideluxe"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T11:37:22.126000+00:00",
    "content": "Ah you can use this convenience tool for that: https://github.com/odysseus0/farcaster-follow-cli"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-11T11:35:21.959000+00:00",
    "content": "Sure, will add all the ns v1 handles from here https://discord.com/channels/900827411917201418/1281929383019544598 once the data is prefilled"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-11T11:33:26.717000+00:00",
    "content": "cool! can you please add my handle too? it's emideluxe"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T11:21:50.027000+00:00",
    "content": "Another great shot by @undefined  https://discord.com/channels/900827411917201418/1278081837780041749/1283367875817635861"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T10:44:43.129000+00:00",
    "content": "Definitely not an hacker on this area, but feel like if we are aiming for this kind of consistent style, using the GenAI stack ComfyUI + Flux might be good to do the \"headshot photo -> desired style\" at scale?"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-11T10:05:45.417000+00:00",
    "content": "Hey @undefined, managed to build a Farcaster Vizualizer https://farviz.xyz with the specs that you suggested.\nWas new to farcaster development so it was a great deep dive. Here is how we achieved it:\n\nFirst, we tried with hubble endpoints[1], but the issue was clear each user was causing us 4 api calls[2], to get to the followers from usernames, also the time machine functionality was not possible due to the latest data hubble api provides.\nThen we ran our own hub snapshot and used it to backfill a postgres database(still backfilling 400k/800k Farcaster id’s) [3]\nThe data is still backfilling so currently some of the users would fetch empty results.\nThe frontend is written in react and we are using d3 for visualization as a graph. backend is written in node which for now just queries the postgres db\n\nWe can optimize the queries further to reduce the query time for large queries, also let us know if we could add any other functionality to it. Also now since we have all the data in postgres feeding from hubble, we can do a lot of things with this\n@undefined and I worked on this so anyone who wants to know more or contribute, let us know\n\n[1] https://docs.farcaster.xyz/hubble/hubble#hosted-instances\n[2] https://docs.farcaster.xyz/reference/hubble/httpapi/links\n[3] https://github.com/farcasterxyz/hub-monorepo/tree/main/packages/shuttle\n\n\nUpdate:\nAdded new columns for data, queries are insanely fast now\nupdated usernames available in thread\nfixed a few bugs"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-11T09:37:49.081000+00:00",
    "content": "Could be fun to gather around 30/60 or 90 day hackathons around shared goals like fitness, writing, skill development, inner healing/transformation, etc."
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-11T07:31:14.640000+00:00",
    "content": "Thanks for doing this!"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-11T07:30:46.908000+00:00",
    "content": "This is fireeeeee @undefined !"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-11T06:42:15.174000+00:00",
    "content": "Sounds good, will give it another go"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T05:23:47.084000+00:00",
    "content": "@undefined we have a thread here in case you missed it 🫶 graph looks so sick"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-11T05:20:46.200000+00:00",
    "content": "we have enough devs here that can handle Linux! I can help as well!"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-11T04:03:34.986000+00:00",
    "content": "I volunteer myself to help you do this."
  },
  {
    "userName": "hugofaz",
    "timestamp": "2024-09-11T03:51:52.834000+00:00",
    "content": "@ hugofaz on FC just like everywhere 🙂"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T03:31:03.074000+00:00",
    "content": "@undefined In the meantime, here is a video of the network of 26 users I have on my list so far, it's evolved very quickly into a dense spider web 🕸️"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T03:12:57.964000+00:00",
    "content": "Sure, never used Replit before, I'll look into it and see if i can put it there.\nI can also open source the front end, it's a simple react app deployed as a github page so that's pretty straight forward for collaboration too. Let me do some clean up and replit exploration and I'll get back to you about this tomorrow...\nAnd big thanks for the feedback 🙏"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-11T03:03:10.578000+00:00",
    "content": "This is just for fun but is kind of cool. @undefined did the backgrounds here. Solarpunk is friendly/forested/green, while still being cool, with a distinct cloud component (in the visible sense of wispy clouds). As distinct from cyberpunk."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-11T03:02:24.851000+00:00",
    "content": ""
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-11T03:02:18.704000+00:00",
    "content": "I like the idea of Network School PFPs. But maybe we could do something in the solarpunk-ish style of the school and conference? See for example ns.com/conference and the headshots there."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-11T03:01:28.568000+00:00",
    "content": "@undefined pretty cool. Could you put this on replit? Then the deployment can be forked as well as the code, if that's possible."
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-11T02:24:33.207000+00:00",
    "content": "https://warpcast.com/nicovrg"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-11T02:09:09.547000+00:00",
    "content": "I am using https://github.com/vasturiano/react-force-graph"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-11T01:19:50.551000+00:00",
    "content": "I would love to move to Linux but need help. 🙂"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-11T00:00:43.645000+00:00",
    "content": "what lib do you use for the 3d graph?"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-11T00:00:36.437000+00:00",
    "content": "man that looks great"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-10T23:54:51.752000+00:00",
    "content": "how do we join the warpcast group?"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-10T22:50:58.188000+00:00",
    "content": ""
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-10T19:44:38.750000+00:00",
    "content": "everything is still WIP, just wanted to kick start this project"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-10T19:43:01.069000+00:00",
    "content": "@undefined created one that looks like your current pfp <:pepeinkz:925090146951495790>"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-10T19:42:20.996000+00:00",
    "content": "Here's something real quick. I thought we could do something minimalist with a little bit of personality to stands out from the crowd. \n\n**Here's an Idea (which I def need help with):**\nAs a POAP we can get everyone to pick their own traits to make it very personable, just like a character screen from video games. I can do the bit where you select the traits and cycle through all the looks, but I haven't done that on chain yet... \n\nIf there anyone who can champion that let me   <:pepepray:1003559428009771018>"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-10T19:40:42.516000+00:00",
    "content": "Great feedback @undefined. We'll keep the \"git diff\" idea in mind."
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-10T19:17:32.009000+00:00",
    "content": "Next I'll try adding the time travel slider and displaying some features on avatar click... Stay tuned for next release!"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-10T19:16:37.714000+00:00",
    "content": "Yes, each link is represented by a line (just made a little change so you can see 2 different lines when 2 users follow each other) The clusters of users more connected to each other tend to group together"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-10T19:09:28.323000+00:00",
    "content": "I assume the proximity of each icon indicates the number of connections in common?"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-10T18:50:35.520000+00:00",
    "content": "I signed the contract today, super stoked!\n\nI want to share an idea for the sake of discussion & getting gears turning. I'm not proposing a practical suggestion that would ultimately create work for the admin team.\n\n💡  There's a clause that references the NS's ability to update the agreement. It would be cool if updates had a git-like history. Specifically, it would be helpful to see a \"git diff\" when the contract changes. That is, it would be helpful to view the specific portions of the agreement that have changed and how.\n\nI'm not sure it would provide much value for this specific agreement. However, I share it as an idea because the opaqueness of the legal system and the tendency for laws+contracts to grow (and never shrink), is often cited as a root cause for societal decay. Since we're interested in considering new ways to \"do society\", I wanted to put the provocation out there.\n\nAs NS and other aspiring Network States create contracts and agreements with their citizens, what is the opportunity to avoid the trappings of legal & contractual bloat from the earliest days?"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-10T18:36:00.184000+00:00",
    "content": "You can try it out here:\nhttps://app.datascience.art/#/network/random/group/1"
  },
  {
    "userName": "randombishop",
    "timestamp": "2024-09-10T18:34:40.804000+00:00",
    "content": "I started playing with this idea in my Farcaster Data Analytics app, here is a screenshot of the NS admits listed in the warpcast group:"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-10T17:15:46.122000+00:00",
    "content": "Sounds cool. I think sometimes mainstream current culture prioritizes written word over spoken word too much. of course, podcasting, YouTube, etc has balanced that out."
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-10T17:02:32.107000+00:00",
    "content": "it would be very cool/useful to have a 3d printer studio for prototyping in future network school versions"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-10T16:17:55.573000+00:00",
    "content": "(That is a 3D model of myself on the Bitcoin bench I designed)"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-10T16:17:09.165000+00:00",
    "content": "Less than 2 weeks left… let’s goooo!!"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-10T16:00:53.251000+00:00",
    "content": "Yes I’m there 🙂"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-10T15:56:47.951000+00:00",
    "content": "Do we need to buy our tickets from his site?"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-10T15:56:17.149000+00:00",
    "content": "BJJ!"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-10T15:55:05.789000+00:00",
    "content": "Down to learn whether we do ourselves or we attend a gym together 🙂 I’ll bring my equipment too"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-10T15:16:55.196000+00:00",
    "content": "Also: you've actually been to Burning Man! Woaahh! 🔥"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-10T15:15:29.475000+00:00",
    "content": "I've participated in a few sittings, both as a 'human book' and a reader - and it's astounding how deeply you can know a person in that 30-mins"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-10T15:14:03.651000+00:00",
    "content": "I meant the same!"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-10T15:10:24.935000+00:00",
    "content": "I just participated in hosting a human library at Burning Man! I'm curious to know what the term \"human library\" means to you.\n\nIn our context, people were \"human books\" with titles (\"Immigrant\", \"Son of a Scammer\", \"Rockstar\"). People could \"check out\" a human book, which meant they could have a 5 - 30 minute conversation with the person. Any questions about the title/topic were on-the-table. Broadly, the goal was for people to feel like they could ask questions and learn— without worrying about offending someone by asking a question \"the wrong way\" or feeling embarrassed about being ignorant on a social/cultural topic."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-10T13:22:35.067000+00:00",
    "content": "Would be cool to have a _human library_ at NS"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-10T13:13:59.208000+00:00",
    "content": "I would love to learn more about \n\n- crypto/web3 investments\n- software development with ai (Replit/custor/v0 etc)\n- network states\n- emerging technologies & futurism"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-10T13:07:55.898000+00:00",
    "content": "Conducted a workshop this afternoon for the students and faculty of Development Management Institute, Patna, India on \"Essentials of AI\" - glad to do this at NS - in collab with fellow AI powerusers of which am sure there wud be many"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-10T13:06:01.636000+00:00",
    "content": ""
  },
  {
    "userName": "hui_nirvana",
    "timestamp": "2024-09-10T12:47:21.499000+00:00",
    "content": "Hello!\n\nI’m really intrigued by Telebrain! I see personal data as a kind of property that could be managed using smart contracts, almost like tokens. This could pave the way for data crowdfunding and data DAOs, making it possible for contributions to AI model training to be recognized and rewarded retrospectively. I’m thinking this could be achieved through TEE privacy chains or MPC wallets.\n\nI'm interested in the types of data you plan to feed into Telebrain and how people might collect it. What do you think?"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-10T10:34:58.162000+00:00",
    "content": "Hi @undefined read this: https://www.getflack.com/p/go-direct-the-manifesto\n\nBasically, you should just completely ignore media corporations as if they are scammers/spammers, which they are.\n\nThere is no need for PR anymore in the modern era as you don’t need to bottleneck your communication through a media corporation.\n\nInstead we can just build up our own followings on social media and go direct. I’ve discussed this for years; see also Lulu’s post above."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-10T10:31:40.205000+00:00",
    "content": "Yes. You shouldn’t talk to media corporations. Just ignore them when they reach out. But if you follow tech twitter you already know this 🙂"
  },
  {
    "userName": "shar6647",
    "timestamp": "2024-09-10T10:02:50.795000+00:00",
    "content": "Things I'm interested in seeing (and have seen talked about in other channels):\n- Replit or Cursor workshops\n- Distribution strategies and best practices\n\nAreas where I can offer help:\n- Finance workshops (pro forma, cap table modeling)\n- Startup workshops (customer discovery, problem identification, market sizing)\n\nThanks for starting the thread @undefined ! Let's encourage people to team up, organize, and conduct workshops in their areas of expertise. We should make the most of having so many talented individuals together, creating opportunities for peer-to-peer learning and skill-sharing.​​​​​​​​​​​​​​​​"
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-10T09:11:15.966000+00:00",
    "content": "Anyone else happen to also be going on this plane from Dubai to Singapore on the 15th?\n\n300 degens, influencers, whales, etc taking over a plane so I'm flying from Bali to Dubai just to go to Singapore 😁\n\nhttps://x.com/redactedcoin/status/1833227087731429772"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-10T08:26:48.159000+00:00",
    "content": "If anyone is interested in content creation / photography, I can do video editing and neon photography workshops"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-10T06:08:59.556000+00:00",
    "content": "Love to do a study group to deep dive on interesting ideas from thinkers relevant to network state effort"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-10T06:02:51.835000+00:00",
    "content": "And to seasteading!"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-10T06:00:40.329000+00:00",
    "content": "Venice origins has interesting parallels to the desire for network states today. It’s inspiring to learn more about the origins of different City States in the past. “History doesn’t repeat itself, but it often rhymes.” \n\nhttps://x.com/brianroemmele/status/1832947011152495039?s=46&t=lUWbDwaWDLCMO0ybi31srQ"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-10T05:26:14.985000+00:00",
    "content": "https://github.com/jonobr1/force-directed-graph\n\nSharing this amazing repo shared with me by @undefined"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-10T05:24:02.431000+00:00",
    "content": "Absolutely! I am wondering how these identities would be linked"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-10T05:09:31+00:00",
    "content": "Would love to have you involved. Added you."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-10T04:57:47.237000+00:00",
    "content": "I saw some people were into 'ecstatic dance' in the cohort, that could be an interesting event too"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-10T04:54:17.405000+00:00",
    "content": "This is amazing! Would love to assist in any way bro. Would love to be a part of it!"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-10T04:50:59.640000+00:00",
    "content": "I plan to offer this either weekly or biweekly depending on interest, the title is a work in progress:\n\n**Creative Flow**\nWe'll engage in creative writing, speaking, and group activities that help you tap into creative flow anytime you need it. Creativity is a muscle, and with practice, you can strengthen it. We'll also explore specific techniques for overcoming writer's block or as I call it: ideas block. Creativity is a vital force for any endeavor, and regular exercise is just as important for the mind as it is for the body."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-10T03:46:18.720000+00:00",
    "content": "Yes this should be a required skill for all of us"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-10T03:41:01.571000+00:00",
    "content": "@undefined I would be very interested in this!"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-10T03:40:38.370000+00:00",
    "content": "If people want a crypto accounting workshop, I can help. Not as fun as yoddha's ideas but good life skills haha 😅"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-10T03:35:23.762000+00:00",
    "content": "I use Stacks, the Bitcoin layer for smart contracts, and we run Stacks Australia a Bitcoin Builders community. Stacks lets  us trustlessly use our BTC in DeFi and dapps and, with its Proof of Transfer consensus and current Nakamoto upgrade, has 100% Bitcoin finality. Also, I stack my STX to earn BTC rewards. (different to staking)"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-10T03:29:45.715000+00:00",
    "content": "Things I would love to experience (if anyone can help) : Improv Theater, BJJ, Capoeira, Writing Hackathon, Watsu/Water Therapy, Standup Comedy. Could help in Writing, Meditation, Capoeira (with some help)."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-10T03:29:45.189000+00:00",
    "content": "List of Workshops/Events"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-10T03:26:34.887000+00:00",
    "content": "How about starting a list of fun workshops/experiences/events we'd love to explore during our time here? Once we have some ideas, we can check if anyone in our cohort wants to help organize or lead these sessions."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-10T03:24:45.042000+00:00",
    "content": "I found Zora to be very easy to create and minf NFT's"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-10T01:51:51.745000+00:00",
    "content": "@undefined or @undefined sorry to ping you, was thinking do you guys need help on moderation of NS channel on warpcast , or already using automod?"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-09T22:04:08.718000+00:00",
    "content": "Yeah, I agree. They will most likely start focusing on whether or not we have some percentage that they consider to be acceptable of every possible racial, gender, sexual identity. Calling us tech bros or whatever lame stuff they normally do."
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-09T19:53:57.241000+00:00",
    "content": "For me mostly Nano, also BCH sometimes and XMR."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-09T19:51:59.072000+00:00",
    "content": ""
  },
  {
    "userName": "carla_paloma",
    "timestamp": "2024-09-09T19:10:17.989000+00:00",
    "content": "you prob already know this site https://kumu.io  +  https://jonobr1.com/force-directed-graph/ it goes up to 10K nodes"
  },
  {
    "userName": "americana76",
    "timestamp": "2024-09-09T19:08:53.354000+00:00",
    "content": "The journo mind cannot comprehend dark talent. In fact they will deliberately construe your talent as dark (evil, bad)"
  },
  {
    "userName": "americana76",
    "timestamp": "2024-09-09T19:04:37.862000+00:00",
    "content": "Simply put: do *not* talk to journos."
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-09T17:52:55.702000+00:00",
    "content": "Once we are all on the Network School app, we could probably also track events attended, not just the official ones but clubs that people start, workshops, outings, etc. all facilitated by the app \n\nThis would be a stronger indicator of connections developed overtime."
  },
  {
    "userName": "lovethyneighbornotthyingroup",
    "timestamp": "2024-09-09T16:06:58.578000+00:00",
    "content": "I’m sure it wouldn’t be a problem to find a private space considering we’ll be at a “ghost city”! Very excited to meditate and cowork with y’all"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-09T15:43:51.185000+00:00",
    "content": "Joined"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-09T14:51:32.687000+00:00",
    "content": "Wow! This would be super useful.\n\nIf we are encoding the directed edge as \"follow the other person\", then I start to be worried that the tool to allow people to easily follow all other classmates would actually reduce the signal of the graph.\n\nIf we are encoding it as some kind of strength of interaction, then such tool won't be as bad. However, for that we need to get people to interact with each other on Farcaster more often. Right now the highest signal data and interaction are actually all on Discord T_T\n\nIt is certainly doable to do a second type of social graph on Discord of course."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-09T14:51:26.972000+00:00",
    "content": "It would look like this. Every profile"
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-09T14:20:07.967000+00:00",
    "content": "Joined!"
  },
  {
    "userName": "nurti",
    "timestamp": "2024-09-09T14:04:10.693000+00:00",
    "content": "Let’s roll 🤙🏻🤙🏻🤙🏻"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-09T13:52:49.987000+00:00",
    "content": "Here is the code to join: COMM-EBBAC4\n\nIn case you guys want to give it a try, here is my ref link : Get a free WHOOP 4.0 and one month free when you join with my link: https://join.whoop.com/D870F0"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-09T13:50:55.662000+00:00",
    "content": "Anyone using Whoop here? I just started to use it earlier this year, but haven’t been consistent with my exercises.\n\nSince we will co-live and burn together for the next couple of months, I created NS team on Whoop!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-09T13:19:58.253000+00:00",
    "content": "Haha! I put the exact same msg on the logistics channel just rn! 😄"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-09T13:18:48.716000+00:00",
    "content": "@undefined @undefined I wonder would it be possible for us to have a dedicated place to do group meditation?"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-09T13:16:53.402000+00:00",
    "content": "Agreed. But if there is some suggestions like keeping the details of the location secret, we should at least know about it and have clear guidelines. If this is at all possible to keep it confidential. In my opinion, not really with such a scale of the cohort."
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-09T13:09:21.548000+00:00",
    "content": "Two journalists from traditional media approached me for an interview about my experience at Network School, but I declined. I’m already a media brand myself, so I don't need their platform. In fact, traditional corporate PR teams are becoming less relevant since many of us have more followers than their brands. We can handle media exposure on our own, in a decentralized way."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-09T13:01:07.310000+00:00",
    "content": "Also, around Dec is when AI is likely to level-up in amazing ways. Wud be interesting to discuss on the evolution of this 'exocortex' layer and what it means for us, as humans."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-09T12:58:58.421000+00:00",
    "content": "In an interview, Ilya Sutskever talked about how talking to advanced AI will be similar to interacting with the best meditation teacher you ever had.\n\nIn my case, I never had a teacher per se. Or folks to talk about these topics. Just books.\n\nTbh, am so delighted to find that's about to change."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-09T12:54:17.558000+00:00",
    "content": "On clear days, would be nice to meditate at the beach - to the sound of waves. But yes, a quiet room meant for meditation would be amazing!"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-09T12:00:37.906000+00:00",
    "content": "We should check with admins  if such a space could be made available to us for daily group meditation sessions"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-09T11:58:26.469000+00:00",
    "content": "Thank you, yes. I will do that. This can work for people who are interested in taking part in the Network School. But what about people who are just asking questions with the intention to write some articles / blog posts, cover the topic in their social media? Maybe we could direct them to someone in your team who is handling PR / media relations?"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-09T11:53:22.553000+00:00",
    "content": "I think you can just tell people to apply at ns.com/apply, and say we will be setting up more nodes around the world (which we will). Also, we'll be announcing a new rolling application soon."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-09T11:52:23.352000+00:00",
    "content": "It would look like this. Every profile photo would give you info when hovered over, and would be clickable. You could use networkx or a similar Python library for graph layout. You should also be able to download the adjacency matrix of connections (who follows who among those N usernames) and also see the visualization of their connectivity over time, by moving a slider. There might be some upper limit like N=1000 after which it would be hard to render, but that'll be empirical.\n\nWhy this is helpful: we can use it to visualize the community connectivity over time."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-09T11:50:27.120000+00:00",
    "content": "The most useful thing you could build in Farcaster would be a site where you can paste in a list of N usernames and then get an in-browser, clickable rendering of the Farcaster social network for those N people. @undefined @undefined"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-09T10:24:09.288000+00:00",
    "content": "Beautifully said!"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-09T10:17:06.287000+00:00",
    "content": "I read quite a few people mention BJJ, so we could have plenty of help there. Would be great to find some capoeiristas as well."
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-09T09:53:34.380000+00:00",
    "content": "I got my mnemonic and I made my account when we had the orientation (so I think I count as new)\n\nHere's how :\nOpen Warpcast app\nClick your profile icon\nSelect the cog (settings icon)\nClick advanced\nClick reveal recovery phrase \nThe recovery phrase is your mnemonic"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-09T09:33:07.412000+00:00",
    "content": "This is maxwell food market - super cool. I brought folks from FWB dao to here before. Not too far from Tanjong Pagar train station. (about 2 station from cityhall - suntec city)"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-09T09:31:59.929000+00:00",
    "content": "https://maps.apple.com/place?q=Maxwell%20Food%20Centre&ll=1.280301%2C103.844737&auid=12918456125035179626&lsp=9902&address=1%20Kadayanallur%20St%2C%20Singapore%20069184"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-09T09:29:26.015000+00:00",
    "content": "We should go explore some hawker (singapore street food culture)!"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-09T09:29:09.023000+00:00",
    "content": "local here haha"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-09T09:08:11.697000+00:00",
    "content": "If Forest City were to serve as a blueprint for setting up habitations in other parts of the world (and planets eventually), I wonder if we should have a dedicated Futures Club - for discussions & experiments around the latest in each of the emerging technologies. \n\nWould be real cool to have one right from V1!"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-09T08:49:28.665000+00:00",
    "content": "Ah one question I had when looking into the Python SDK is that the only Auth it provides is Mnemonics, which they seem to no longer provide for new users. Did you find a way around it?"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-09T08:48:40.087000+00:00",
    "content": "I added a function called get_conversation_partcipants to the farcaster python sdk by A16Z \nWaiting for permission to actually make a PR in their repo \nWhile I wait - I've forked it so others can install the SDK from my repo and have the new function \nhttps://github.com/reido2012/farcaster-py/tree/get-conversation-participants\n\nDoing the JS / Chrome extension way is cool but I think most people will end up doing it manually at this point 😂"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-09T08:34:20.859000+00:00",
    "content": "I would love to go for some street food. Explore it a bit. More local vibe and opportunities to interact with the locals too. Also more dynamic after a looong day of seating at the conference 😉 What do you think?"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-09T08:15:06.530000+00:00",
    "content": "A question to @undefined and the admin team about the policy for communication about the NS to the outside public. \n\nEspecially details like location, schedules and plans. \n\nPeople are reaching out and asking for more info. \n\nI heard before from you that we should keep the location details secret. Is that open for public already? How should we answer those questions?\n\nI would love to see some advice from you. I understand we want more publicity to attract future cohorts and partners. What would be the guidelines for public communication?\n\nThank you 😊"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-09T08:07:59.891000+00:00",
    "content": "I'm down for Muay Thai, used to train when I was young! never tried BJJ, but down for that too!"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-09T08:03:24.561000+00:00",
    "content": "I love Capoeira and want to try BJJ as well. I used to live in Brazil for a bit, but too bad didn't get the chance to try any!"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-09T07:50:54.445000+00:00",
    "content": "quantum entanglement 🤣"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-09T07:37:44.489000+00:00",
    "content": "haha I just wrote something similar in my weekly newsletter. Together we’ll definitely ignite our energy level and conscious minds."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-09T07:24:03.331000+00:00",
    "content": "+1"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-09T06:35:56.832000+00:00",
    "content": "Something really cool would be if Bryan Johnson made the app for his Don’t die on chain and where we can earn with crypto the more we workout. Similar to the step idea"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-09T06:20:01.559000+00:00",
    "content": "Since we're going to be using Farcaster/Warpcast a fair bit I've been messing around with it and built this: https://warpcast.com/nanogpt/0x050b5c6d. Essentially a way to use AI within Warpcast to generate text and images (Twitter has Grok, we should have something cool too). If anyone wants to try it out and get some more experience with Warpcast in the process let me know, I'll send you some Nano.\n\nFor those in here that don't know how to code and wonder how hard this stuff is - this took about a day and relied mostly just on help from AIs (Claude 3.5 Sonnet and Gemini Pro in this case) and a lot of trial and error throughout the day. It's built in Python. Programming can be pretty fun and easy."
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-09T05:18:14.604000+00:00",
    "content": "totally agree"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-09T05:12:34.122000+00:00",
    "content": "We'll have different workout slots so folks can pick one that works best for their schedule.\n\nAt a high level, the daily loop will follow this pattern:\n\n> Wake up and workout \n> Collect Blueprint meals and get coffee\n> Work and meetings \n> Lectures and other community events \n\nThe ns.com app, which we're putting together, will have a detailed schedule for the NS community."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-09T04:26:48.136000+00:00",
    "content": "Attended a guided session by thai monks yesterday sorrounded by a lot of people, looking forward to such sessions at NS. The monks were talking about how when people meditate together, it changes the consciounness of the participants of the group as well as the planet."
  },
  {
    "userName": "hui_nirvana",
    "timestamp": "2024-09-09T04:14:59.255000+00:00",
    "content": "Do Not Die, Solar Punk, Luna Punk, Sovereign Individual and Accelerationism are most Network State Commandments. \n\nActually, several network states that have been listed by Balaji on the Network State Dashboard don't have clear one commandment acturally."
  },
  {
    "userName": "donovansung",
    "timestamp": "2024-09-09T03:53:38.288000+00:00",
    "content": "We definitely welcome folks to come to Singapore early to attend the Don't Die Summit on Sept 19! We're hosting the Network State Conference in Singapore on Sept 22, and Bryan Johnson will also be there, in addition to the launch kickoff of the Network School on Sept 23 in Forest City. See you all there!"
  },
  {
    "userName": "pathetaon",
    "timestamp": "2024-09-09T03:31:17.791000+00:00",
    "content": "I'd love to especially muy thai"
  },
  {
    "userName": "americana76",
    "timestamp": "2024-09-09T03:01:37.527000+00:00",
    "content": "@undefined word. DM'd you guys"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-09T02:56:53.455000+00:00",
    "content": "@undefined few of us in here interested in mma related stuff"
  },
  {
    "userName": "cameleon_75612",
    "timestamp": "2024-09-09T02:11:51.619000+00:00",
    "content": "would love to, been trying to get back into boxing and have done kickboxing before (but i know its not same as muay thai) and I am no expert at all but would love to train if anyone else is doing it"
  },
  {
    "userName": "americana76",
    "timestamp": "2024-09-09T01:52:28.680000+00:00",
    "content": "If someone else in this group would like to train bjj, muay thai, mma, please let me know. deciding which (if any) equipment I need to bring, but would like to conserve space in luggage if no one else can train with me. I promise Im not great at any of them so would love to get a group together to learn from the best in our group 🫡"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-09T01:31:50.113000+00:00",
    "content": "GM @undefined Do we have a rough schedule of what a day looks like? Noted for exercise + group lessons + all hands etc. I'm looking more at the timing, like maybe our exercise will start 8am etc. \nI'm starting to schedule some zooms and calls, and wanted to make sure the activities doesn't overlaps."
  },
  {
    "userName": "mzzy27",
    "timestamp": "2024-09-09T01:14:38.106000+00:00",
    "content": "If anyone is able to run some replit tutorials that would be amazing!"
  },
  {
    "userName": "shasan",
    "timestamp": "2024-09-09T00:26:54.153000+00:00",
    "content": "some members had also shared their preferences in this thread previously for reference https://discord.com/channels/900827411917201418/1279118131867947020/1279118900151324766"
  },
  {
    "userName": "shasan",
    "timestamp": "2024-09-08T23:56:43.530000+00:00",
    "content": "Badminton, Table Tennis"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-08T20:40:26.353000+00:00",
    "content": "Would also like to train muay thai/boxing while there"
  },
  {
    "userName": "defijangle",
    "timestamp": "2024-09-08T20:09:36.842000+00:00",
    "content": "+1 to martial arts. Specifically Muay thai/kickboxing/western boxing are what I enjoy"
  },
  {
    "userName": "_estherr22",
    "timestamp": "2024-09-08T19:28:31.105000+00:00",
    "content": "Maybe padel as well, if there is a court and more people are into it"
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-08T19:04:25.286000+00:00",
    "content": "i hope we learn stuff like this: https://fxtwitter.com/brian_armstrong/status/1832846994710368299"
  },
  {
    "userName": "faza.git",
    "timestamp": "2024-09-08T18:09:26.757000+00:00",
    "content": "@fazam"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-08T17:45:19.521000+00:00",
    "content": "We had a thread going for martial arts too, and some of us were interested in bjj as well as exploring new forms. Wanted to also ask if there was anyone into capoeira?"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-08T17:11:47.657000+00:00",
    "content": "2 weeks to go. \n\nMy practice has become irregular lately. Starting today, going back to build a daily rhythm - twice a day.\n\nThe momentum will help practise at School."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-08T16:58:43.967000+00:00",
    "content": "Cricket"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-08T16:55:34.457000+00:00",
    "content": "ping-pong!"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T16:36:40.272000+00:00",
    "content": "https://store.steampowered.com/app/3161930/Duck_Norris_Tales/"
  },
  {
    "userName": "calvinlegassick",
    "timestamp": "2024-09-08T16:36:02.442000+00:00",
    "content": "Is anyone else considering attending the Don’t Die Summit in Singapore on the 19th? It’s so close to the Network State conference, just need to fly out a few days earlier.\n\nIf anyone is attending and has figured out lodging (or is interested in figuring it out together!) let me know! Hoping to book my flight + lodging in the next 24 hours."
  },
  {
    "userName": "donovansung",
    "timestamp": "2024-09-08T16:30:13.680000+00:00",
    "content": "@undefined, same as Discord"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-08T16:28:36.770000+00:00",
    "content": "Not sure how many people are into CrossFit in this cohort. I'd like to propose doing 2-3 WODs together every week (depending on the gym/outdoor facilities). React with emoji if you'd like to join me haha! I'm happy to organize some sessions outside our gym routine."
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-08T16:28:36.198000+00:00",
    "content": "What sports would you like to play at Network School? ⛳Reply in chat if you h..."
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T16:26:48.216000+00:00",
    "content": "I am currently working on a 2d platformer"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-08T16:06:56.196000+00:00",
    "content": "What kind of games do you develop and what’s your choice of programming language?"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-08T16:05:35.270000+00:00",
    "content": ""
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T16:04:58.730000+00:00",
    "content": "no switched from Unity to Game maker last year"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T15:10:53.563000+00:00",
    "content": "Thank you so much for helping us with all these logistics 👑 please let me know if there is anything I can help with!"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-08T14:55:31.027000+00:00",
    "content": "We haven't sent them yet. We'll post on Discord when we send the agreement to ensure no one misses the email."
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-08T14:52:17.463000+00:00",
    "content": "solid spice 👌"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T14:51:18.209000+00:00",
    "content": "Also memorizing things is actually overvalued as you can almost always find it through LLM with a vague sense of what you are looking for"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T14:50:40.622000+00:00",
    "content": "I actually have a spicy take: the best spaced repetition is to let what your projects need from you to do the spacing. It is the most effective spacing."
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-08T14:47:59.904000+00:00",
    "content": "https://x.com/byrnemluke/status/1832548298470912362"
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-08T14:46:15.438000+00:00",
    "content": "i agree but a kind of spaced repetition thing to have more stuff in muscle memory so that when you scan LLM output you grok it ever more quickly seems cool \n\n...but at the same time i agree with you 🙂"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T14:42:57.524000+00:00",
    "content": "I am not sure if it is still the best one, but previously a product that fits this definition is Codeacademy. Though I would recommend people to just dive in with whatever they wanna build. With LLM you basically have a very patient  FAANG level engineer mentoring you"
  },
  {
    "userName": "otis5d",
    "timestamp": "2024-09-08T14:40:04.864000+00:00",
    "content": "that's a good idea"
  },
  {
    "userName": "ersib3",
    "timestamp": "2024-09-08T13:58:32.541000+00:00",
    "content": "Have the double commit forms/contracts gone out yet?  I’m asking because I haven’t received anything"
  },
  {
    "userName": "ersib3",
    "timestamp": "2024-09-08T13:58:03.989000+00:00",
    "content": "This would be such a killer product"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-08T13:52:13.422000+00:00",
    "content": "Do you use unreal engine?"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T13:13:56.983000+00:00",
    "content": "I am currently using AI to help me with coding, it is doing a lot of heavy lifting when it comes to basic understanding and getting it off the ground. It really helps with some of the mundane tasks  so it can improve your efficiency by a lot"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T12:27:46.147000+00:00",
    "content": "Ai is a really good and very \"patient\" teacher. It does well for understanding code structure and identifying surface level issues."
  },
  {
    "userName": "donovansung",
    "timestamp": "2024-09-08T12:16:49.857000+00:00",
    "content": "Amazing story! Glad you could make it to the orientation 🙂"
  },
  {
    "userName": "fakedavinxi",
    "timestamp": "2024-09-08T12:08:22.415000+00:00",
    "content": "Replit has a much appreciated intro to python (and some coding in general) for the basics. You can then look into a Replit + Cursor setup like already mentioned \n\nhttps://replit.com/learn/100-days-of-python"
  },
  {
    "userName": "nurti",
    "timestamp": "2024-09-08T08:58:59.309000+00:00",
    "content": "try to copy and paste to safari or your default browser, it worked for me"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T07:32:57.063000+00:00",
    "content": "Ah ask ChatGPT first. You can check with me"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T07:32:43.111000+00:00",
    "content": "Just ask me questions there when you run into any"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T07:32:35.194000+00:00",
    "content": "<#1281934561223250000> give the remaining to do a shot"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-08T07:31:34.925000+00:00",
    "content": "Alright!"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T07:28:03.454000+00:00",
    "content": "there are plenty of things to build here for NS"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T07:28:02.962000+00:00",
    "content": "I can mentor you"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T07:28:02.473000+00:00",
    "content": "🤣 just build with me bro"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T07:27:23.006000+00:00",
    "content": "kinda not recommended. probably will turn you into a worse coder than Duolingo does to you as a language user"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T07:26:46.458000+00:00",
    "content": "yes it is called codeacademy"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-08T07:25:32.425000+00:00",
    "content": "https://x.com/Hamptonism/status/1832670857304445021?t=kgq3gF6jcGVtBDvRMVOyWA&s=19\n\n\nDoes this exist? If not, who's interested in building this?"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T06:57:11.660000+00:00",
    "content": "I am so excited"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T06:54:04.265000+00:00",
    "content": "Can def generate it to make each POAP look different. Its gonna be awesome"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T06:53:09.831000+00:00",
    "content": "Sounds like an awesome idea. Count me in 💯"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T06:40:23.154000+00:00",
    "content": "me can't design"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T06:40:22.606000+00:00",
    "content": "So happy to have good artists onboard"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T06:40:05.060000+00:00",
    "content": "we did a bunch of POAP stuff for 1729 back in the old days. Feel like we might do something similar this time for all the participation tracking"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T06:39:35.106000+00:00",
    "content": "I feel like we can do one for NS admit and another one for people who actually physically arrived"
  },
  {
    "userName": "nurti",
    "timestamp": "2024-09-08T06:34:45.025000+00:00",
    "content": "Thanks it worked on safari"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T06:32:43.107000+00:00",
    "content": "Try to open inside Safari browser. Also you need to be logged in Warpcast already."
  },
  {
    "userName": "nurti",
    "timestamp": "2024-09-08T06:32:13.770000+00:00",
    "content": ""
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T06:31:40.421000+00:00",
    "content": "Did you try this:\n\n>  If you are on Mobile, remember to copy the link https://warpcast.com/~/group/N21PFzmwJ9FBTVdaBpPV4Q and visit the website outside of Discord."
  },
  {
    "userName": "nurti",
    "timestamp": "2024-09-08T06:31:07.924000+00:00",
    "content": "Is it or group chat link is not working? Can you help? @undefined thanks"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T06:29:22.899000+00:00",
    "content": "OMG this is awesome"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T06:16:37.792000+00:00",
    "content": "A sample of my work"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-08T06:12:41.698000+00:00",
    "content": "I can help with art and writing a basic contract (unless someone else wants to expand the NFT in the future)"
  },
  {
    "userName": "cameleon_75612",
    "timestamp": "2024-09-08T06:10:23.776000+00:00",
    "content": "would love to help on this too!"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-08T06:07:55.788000+00:00",
    "content": "Count me in, I’d be happy to help too! even my knowledge in robotics is very minimal, last time I work in robotics was building an arm that peels papaya back in my uni day lol (which is ages ago)"
  },
  {
    "userName": "franspeter",
    "timestamp": "2024-09-08T05:53:59.212000+00:00",
    "content": "If we adopt a common diplomacy protocol ... \n\n...**we could explode in total size. **(community of communities)\n\nHow? One important agreement would be that of joining acknowledgement lists.\n\nOne new society could be acknowledged, and based on rules, other societies may follow automatically or manually but quickly.\n\n**How quick we get to this picture of The Network State is really up to us, isn't it?**"
  },
  {
    "userName": "franspeter",
    "timestamp": "2024-09-08T05:41:51.749000+00:00",
    "content": "Sorry it's early morning and my brain is pumping ideas.\nLet me turn this into a thread. Please jump in if you like.\n\n**DIPLOMACY PROTOCOL** \nFor standardised quick communication between communities based on **acknowledgement**.\n\nHere's how it works:\n\n**STEP 1. Acknowledgement**\n\nEach community keeps a list of other communities it ***acknowledges***.\n\nA world map currently is essentially from the perspective of a citizen of a country. e.g. Europeans put Europe in the centre.\n\nSo each community will have their own world map, on which flags from other acknowledged communities could be displayed.\n\nA basic protocol of acknowledgement could include\n**- 1 url at which census data can be fetched**\n\n(Probably no need for blockchain, because in the end it's all on the basis of trust and acknowledgement.)\n\nExample summary data:\n\n```\nNetwork School Forest City\n153\nns.com\n```\n1st line, the full name\n2nd line the registered population count\n3rd line a website\n\nCould extend this with real estate footprint (m²), or turn it into a key value map, with a few required properties and then more and more optional but standardised properties.\n\n**Step 2. Agreements**\n\nAfter acknowledgement, there are many agreements you can imagine. \n\ne.g. It's easy to imagine a trade agreement if the communities are professional guilds. \n\n**Step 3. Information Technology**\n\nUsing a standardised protocol, you can now implement that protocol as an API (rpc).\n\n***This can formalise and streamline processes; 100x it in speed compared to the current bureaucracies.***\n\ne.g. A formal request for a meeting between representatives.\n\ne.g. A formal request for AID.\n\nEvery agreement, would have a standard list of functions to call.\n\n---\n\n**If we begin with the end in mind, we can build in a straight line towards it. **\n\n(If we do not, how long would it take to get there?)\n\n`Request for Comments`"
  },
  {
    "userName": "franspeter",
    "timestamp": "2024-09-08T05:41:51.007000+00:00",
    "content": "Diplomacy Protocol"
  },
  {
    "userName": "franspeter",
    "timestamp": "2024-09-08T05:03:29.518000+00:00",
    "content": "A diplomacy protocol. That'd be interesting... 🤔\n\nWith a standard progression...\n1. Acknowledge first —> 2. Agreements (an over time standardised list of template agreements)\n\nWith a standardised format, so we can build APIs to interact between communities programmatically.\n\nWe could craft an RFC / proposal together"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-08T04:40:06.279000+00:00",
    "content": "Yes it happens on the mobile discord for me cause it open within in-app 😂"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T04:36:56.342000+00:00",
    "content": "I didn't even test it there. thanks for the explanation!"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T04:36:42.291000+00:00",
    "content": "mobile has all these complication"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T04:36:36.055000+00:00",
    "content": "ah when using in mobile right"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-08T04:32:45.637000+00:00",
    "content": "I click the link within discord and it couldn’t load too. So I copy and paste it in browser"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-08T04:32:15.356000+00:00",
    "content": "Don’t click the link inside discord. You need to copy the link and paste it in browser and click open the app"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T04:17:10.957000+00:00",
    "content": "Ah it should looks like this. Did you have Warpcast signed in?"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-08T04:17:00.061000+00:00",
    "content": "The \"group chat\" link wasn't working for"
  },
  {
    "userName": "franspeter",
    "timestamp": "2024-09-08T03:06:30.165000+00:00",
    "content": "Love this. Let’s make it happen. \n\nBegin with the end in mind… many communities, with diplomacy to connect them for mutual benefit."
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-08T02:36:14.202000+00:00",
    "content": "3.00 AM CET\n\nEurope, Poland, Masurian Lakes District\n\nJeziorak Lake\n\nLittle sailing boat with a crew of 10 of my girlfriends \n\nMy yearly ritual: sailing weekend with ladies only onboard\n \nI am lying in my sleeping cabin (forepeak / v-berth) \n\nIn total darkness \n\nJoining the Network School Orientation call with @undefined \nand the NS community \n\nQuite a surreal experience \n\nI love what is coming 🔥"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T02:10:10.310000+00:00",
    "content": "how does the ns passport works?"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:10:35.957000+00:00",
    "content": "first time it happens to me, fucking web2 😂"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-08T01:10:11.815000+00:00",
    "content": "Great! 😄"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:10:05.465000+00:00",
    "content": "thanks!"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:10:03.904000+00:00",
    "content": "it worked"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:09:50.862000+00:00",
    "content": "i created an account, now its pending host approval or smth"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-08T01:07:39.771000+00:00",
    "content": "I'm assuming that they need \"registered zoom accounts\" for this link because they need to validate that your email is \"registered\" - so you have to sign in using the email you registered."
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-08T01:07:03.628000+00:00",
    "content": "Try to sign up with a normal zoom account - its free."
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:06:59.201000+00:00",
    "content": "i never needed it to join zoom calls"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:06:45.252000+00:00",
    "content": "i dont have a zoom account"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-08T01:06:36.339000+00:00",
    "content": "Do you have a education zoom account previously?"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:05:53.756000+00:00",
    "content": "when i click the zoom link from the email received after registering, i see this"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-08T01:04:53.310000+00:00",
    "content": "I'm using the zoom client"
  },
  {
    "userName": "lanif0904",
    "timestamp": "2024-09-08T01:04:40.096000+00:00",
    "content": "Nico - did you register using the link Balaji shared? If you registered, you'll get another link in another email. Which steps are you stuck at ?"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:04:17.886000+00:00",
    "content": "did you joined from your browser?"
  },
  {
    "userName": "franspeter",
    "timestamp": "2024-09-08T01:04:00.571000+00:00",
    "content": "Didn’t need that"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:03:45.965000+00:00",
    "content": "i can't join, it says that i need a zoom commercial account, anyone else has this problem?"
  },
  {
    "userName": "franspeter",
    "timestamp": "2024-09-08T01:03:26.707000+00:00",
    "content": "Good to see some faces!!"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-08T01:02:49.752000+00:00",
    "content": "OK folks, we are getting started now. with the second orientation: \n https://zoom.us/meeting/register/tJUrdu-trDotG9CzTJtN0OXWFNqpY9Ofymya"
  },
  {
    "userName": "americana76",
    "timestamp": "2024-09-08T01:02:43.641000+00:00",
    "content": "https://zoom.us/meeting/register/tJUrdu-trDotG9CzTJtN0OXWFNqpY9Ofymya"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:02:26.979000+00:00",
    "content": "its 5am here, rip"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:02:20.304000+00:00",
    "content": "i stayed awake for nothing 😭"
  },
  {
    "userName": "nicovrg",
    "timestamp": "2024-09-08T01:00:57.640000+00:00",
    "content": ""
  },
  {
    "userName": "oldkiraicoal",
    "timestamp": "2024-09-08T00:33:37.270000+00:00",
    "content": "The \"group chat\" link wasn't working for me... Sounds cool tho"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-08T00:01:49.220000+00:00",
    "content": "Group link not working for me"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-08T00:01:06.111000+00:00",
    "content": "@ph0t0nic"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-07T23:58:19.670000+00:00",
    "content": "@everyone OK, for those in North or South American time zones, we are holding a second Network School Remote Orientation in one hour. Here is the Zoom.\n\n https://zoom.us/meeting/register/tJUrdu-trDotG9CzTJtN0OXWFNqpY9Ofymya\n\n(Note: you don’t need to attend this if you went to the orientation 15 hours ago.)"
  },
  {
    "userName": "aneesh.mov",
    "timestamp": "2024-09-07T23:52:02.640000+00:00",
    "content": "What a time to be alive"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-07T23:03:19.641000+00:00",
    "content": "What is Bookmarked Club please?"
  },
  {
    "userName": "v_for_vincent",
    "timestamp": "2024-09-07T18:50:19.854000+00:00",
    "content": "I'd love to help out on this! I had worked on the Hololens firmware team at Microsoft before so I'm pretty familiar with hardware labs. Also have worked with various chinese PCB/PCBA factories before for a startup project so have contacts there as well."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T18:50:19.470000+00:00",
    "content": "We definitely gotta be one of the first startup cities in Asia to get humanoids joining us, help us build V2/V3 facilities ig."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-07T18:34:27.736000+00:00",
    "content": "Good suggestion. This may be a v2 / v3 item.\n\nBut don't block on us for ideas that the community is excited about. E.g. you can start Bookmarked Club and build it out with others that are interested."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T18:13:52.666000+00:00",
    "content": "Gonna sleep for now"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T18:13:48.867000+00:00",
    "content": "Remaining todo to make it easy to use for non-dev: rewrite the whole thing in JS and package it into a chrome extension. Simply intercept the networking call to get the Auth token and the Farcaster ID of your classmates."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T18:10:05.191000+00:00",
    "content": "For y'all developers, you can use this [script](https://github.com/odysseus0/farcaster-follow-cli) to easily follow all your classmates in the group chat.\n\nIf you haven't joined, join the [group chat](https://warpcast.com/~/group/N21PFzmwJ9FBTVdaBpPV4Q) right now. If you are on Mobile, remember to copy the link https://warpcast.com/~/group/N21PFzmwJ9FBTVdaBpPV4Q and visit the website outside of Discord. Remember that you need to have already logged in Warpcast. Thanks to @undefined for pointing it out\n\nWe still need to make it easy to use for non-developers. The idea is to package the whole thing into a chrome extension. We can discuss here: <#1281934561223250000>"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T18:09:48.197000+00:00",
    "content": "For y'all developers, you can use this [script](https://github.com/odysseus0/farcaster-follow-cli) to easily follow all your classmates in the group chat.\n\nIf you haven't joined, join the [group chat](https://warpcast.com/~/group/N21PFzmwJ9FBTVdaBpPV4Q) right now."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T18:08:37.448000+00:00",
    "content": "okay fuck it I am going to do it the hacky way."
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-07T15:51:37.568000+00:00",
    "content": "What would we build?"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T15:38:31.472000+00:00",
    "content": "https://neynar.com/ for backend. It is basically an RPC for you who are familiar with blockchain development.\n\nNeynar -> RPC\nFarcaster Hub -> Node"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T15:37:14.900000+00:00",
    "content": "https://frog.fm/ for frame frontend"
  },
  {
    "userName": "defijangle",
    "timestamp": "2024-09-07T15:22:25.609000+00:00",
    "content": "@jangle"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T14:01:55.281000+00:00",
    "content": "All the updated SDK is branded as frame SDK"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T14:01:45.371000+00:00",
    "content": "Okay just realized that the latest approach is to use frame"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T13:20:49.080000+00:00",
    "content": "Anyone who knows the best way to do auth now that they removed mnemonic code (recovery phrase)?\n\nThe A16Z SDK still uses recovery phrase as the only Auth option"
  },
  {
    "userName": "shasan",
    "timestamp": "2024-09-07T12:39:40.938000+00:00",
    "content": "@ shasan"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T12:35:09.439000+00:00",
    "content": "Example:\n\nhttps://www.bookmarked.club/people"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T12:33:58.105000+00:00",
    "content": "@undefined feature request: \n\nForum for community to share knowledge resources with eachother"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-07T12:33:52.376000+00:00",
    "content": "I'd love to see that too! NS's very own version of Boston Dynamics! <:ape:882505132141604885>"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T12:20:01.053000+00:00",
    "content": "My two core focus areas at the School would be:\n\n1. AI x Coding\n2. AI x Creativity \n\nBe upskilling in both to:\n\n1. Scale my education-focused communities\n2. Scale my fashion apparel ecom stores\n\nI learn best with a buncha friends - look forward to teaming/learning/ building with folks with similarl interests!"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-07T12:17:26.087000+00:00",
    "content": "https://x.com/macastel3/status/1788527419034616157?s=46\n\nI would love to have robotic factories like this in v3/v4 of the Network School. We have the space for them…"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T12:14:59.276000+00:00",
    "content": ""
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T12:12:34.169000+00:00",
    "content": "8ish"
  },
  {
    "userName": "blackmajic5000",
    "timestamp": "2024-09-07T12:02:15.291000+00:00",
    "content": "Looking forward to this, anyone know when then conference ends?"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:59:18.318000+00:00",
    "content": "I am gonna grab dinner very quick"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:59:05.802000+00:00",
    "content": "This might help"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:59:03.743000+00:00",
    "content": "Oh https://warpcast.notion.site/Farcaster-Actions-6e1ac0cab0604962b01c826e497c85d3"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:55:59.524000+00:00",
    "content": "actually do you think it would be better for UX if we build it as a chrome extension? So that people who don't code won't be daunted by running a script"
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-07T11:54:26.841000+00:00",
    "content": ""
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-07T11:54:17.611000+00:00",
    "content": "If anyone likes cars/supercars as well, the Gumball 3000 will parade in Singapore on the 21st"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:53:29.271000+00:00",
    "content": "I'll do the PR for fun anyways - If you complete it before me it's fine"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:53:03.638000+00:00",
    "content": "Okay don't worry"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:52:58.472000+00:00",
    "content": "Oh dear"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:44:51.226000+00:00",
    "content": "🤣haha unfortunately with nvim you can't just use MSFT server for remote collaboration for free"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:42:04.376000+00:00",
    "content": "I use nvim 😂  never used VS Code"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:41:49.308000+00:00",
    "content": "I see. Is the VS Code one online too?"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:40:29.950000+00:00",
    "content": "Okay let's actually stick with VS Code 🤣 the starter plan only allows 1 collaborator"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:38:15.171000+00:00",
    "content": "Never tried Repl.it shared workspace. We can try that."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:37:55.089000+00:00",
    "content": "Could do VS Code one as well"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:37:49.127000+00:00",
    "content": "Wanna do a Repl.it shared workspace?"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:37:00.965000+00:00",
    "content": "Cool. I don't mind whipping this up real quick."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:36:28.243000+00:00",
    "content": "Ah let's do Python. I can go with what the group likes to use"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:36:02.300000+00:00",
    "content": "I can do it in Python if you're doing it in JS"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T11:35:47.050000+00:00",
    "content": "@undefined You could probably make a PR to farcaster-py or whichever SDK you're using \n\nfarcaster-py doesn't have a get_conversations function"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-07T11:35:21.341000+00:00",
    "content": "Haha trying that out"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:28:39.513000+00:00",
    "content": "You can do it now with help of LLM! Trust me"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-07T11:25:19.672000+00:00",
    "content": "Very cool. I hope to learn more technical skills and soon help you!"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:24:43.928000+00:00",
    "content": ""
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:24:43.750000+00:00",
    "content": "This is the one"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:24:25.217000+00:00",
    "content": "Okay no worry folks I reverse engineered"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T11:22:39.639000+00:00",
    "content": "Sure, am in! Let's do this!"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:22:14.953000+00:00",
    "content": "Just found that you can do NFT permissioning in Warpcast group"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:22:01.290000+00:00",
    "content": "Hack Project No.1: Issue community NFT for onchain identity management"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:20:16.059000+00:00",
    "content": "Okay none of these packages seem to have added retrieving user list from a group chat. If someone is interested in reverse engineering that go for it"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:18:29.227000+00:00",
    "content": "Awesome move. Shall we start a team Notion to better organize stuff"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:17:51.485000+00:00",
    "content": "https://github.com/a16z/farcaster-py"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:17:37.716000+00:00",
    "content": "https://github.com/standard-crypto/farcaster-js"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T11:14:03.245000+00:00",
    "content": "@undefined team up on film making bounty!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T11:13:26.758000+00:00",
    "content": "Y'all, this space is to put up projects and ideas you would build on at NS. \n\nGoal: to team up like-minded Schoolers 🙌 🚀"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T11:13:21.128000+00:00",
    "content": "Ideaboard | What are you building @NS?"
  },
  {
    "userName": "kldel",
    "timestamp": "2024-09-07T11:12:04.071000+00:00",
    "content": "@zahara"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:10:42.345000+00:00",
    "content": "Okay gonna post relevant stuff here"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T11:10:16.588000+00:00",
    "content": "Hack Project No.0: Let's build a script to allow folks to one-click follow everyone in the community"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-07T11:09:34.174000+00:00",
    "content": "I'll do another orientation in 14 hours or so for people in the Americas. You should expect to get a Docusign soon with a \"double opt in\" with the NS Contract. Great questions everyone and I look forward to seeing you."
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-07T11:09:21.305000+00:00",
    "content": "Appreciate the orientation @undefined and team! <:pepeinkz:925090146951495790>"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-07T11:09:08.074000+00:00",
    "content": "Thank you for this orientation @undefined @undefined NS Team :)) It was really helpful"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-07T11:09:01.221000+00:00",
    "content": "Thanks everyone! Please ask any further questions to @undefined. @undefined @undefined @undefined and I are also in the chat. We'll have some new flags to distinguish \"NS Core\" from \"NS Community\"."
  },
  {
    "userName": "donovansung",
    "timestamp": "2024-09-07T11:08:42.821000+00:00",
    "content": "Thanks everyone for attending today! Looking forward to meeting you all soon"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-07T11:08:33.648000+00:00",
    "content": "I would definitely join."
  },
  {
    "userName": "kira_47935",
    "timestamp": "2024-09-07T11:06:17.359000+00:00",
    "content": "https://warpcast.com/kirina"
  },
  {
    "userName": "paarug",
    "timestamp": "2024-09-07T11:05:53.423000+00:00",
    "content": "would love to volunteer for hosting jiu jitsu workshops and contribute to the “burning”!"
  },
  {
    "userName": "cdtr_1",
    "timestamp": "2024-09-07T11:05:38.869000+00:00",
    "content": "@cdtr"
  },
  {
    "userName": "vitorangonese",
    "timestamp": "2024-09-07T11:05:05.015000+00:00",
    "content": "@ vitorangonese"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T11:04:56.646000+00:00",
    "content": "https://warpcast.com/haider"
  },
  {
    "userName": "gautham",
    "timestamp": "2024-09-07T11:04:46.171000+00:00",
    "content": "https://warpcast.com/gautham"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-07T11:04:46.036000+00:00",
    "content": "@0htrap1"
  },
  {
    "userName": "shar6647",
    "timestamp": "2024-09-07T11:03:49.079000+00:00",
    "content": "@smorez"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-07T11:03:26.815000+00:00",
    "content": "@undefined"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-07T11:02:29.994000+00:00",
    "content": "Same here!"
  },
  {
    "userName": "gautham",
    "timestamp": "2024-09-07T11:02:01.109000+00:00",
    "content": "Need to go to devcon for few days, hope that’s okay"
  },
  {
    "userName": "mzzy27",
    "timestamp": "2024-09-07T11:01:53.187000+00:00",
    "content": "On earn, what are the best ways to earn while at NS so we can reinvest back into the community? i.e. not just bounties but bringing partners/businesses/investors?"
  },
  {
    "userName": "nurti",
    "timestamp": "2024-09-07T11:01:17.997000+00:00",
    "content": "https://warpcast.com/nurtinba"
  },
  {
    "userName": "dexhunt3r",
    "timestamp": "2024-09-07T11:01:02.671000+00:00",
    "content": "https://warpcast.com/dexhunter"
  },
  {
    "userName": "dimitri.vallein",
    "timestamp": "2024-09-07T11:00:30.189000+00:00",
    "content": "@valone"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-07T10:57:52.584000+00:00",
    "content": "@electrafrost"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-07T10:57:38.425000+00:00",
    "content": "@camellia"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-07T10:53:25.301000+00:00",
    "content": "@BENNN"
  },
  {
    "userName": "octomos",
    "timestamp": "2024-09-07T10:52:45.597000+00:00",
    "content": "@mosnassar"
  },
  {
    "userName": "octoqueenz",
    "timestamp": "2024-09-07T10:52:14.584000+00:00",
    "content": "@biohacker"
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T10:51:32.834000+00:00",
    "content": "@omarreid"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-07T10:51:15.201000+00:00",
    "content": "@milandereede"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-07T10:50:18.855000+00:00",
    "content": "@undefined"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T10:50:09.705000+00:00",
    "content": "@odysseustz"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-07T10:49:42.008000+00:00",
    "content": "Place to aggregate the Warpcast handles. Let's only reply with handle so that it is easier to turn them into a CSV to automate things.\n\nThis might be an easier way to do this. Let's also just join this [Warpcast group chat](https://warpcast.com/~/group/N21PFzmwJ9FBTVdaBpPV4Q)! Remember that you need to have already created an account and signed in. If you have any issue let's discuss it here <#1282136729536696322> \n\nI will also try to write a script so you can one click follow everyone without having to manually clicking through all of them🤣\n\nJust started another [thread](https://discord.com/channels/900827411917201418/1278081837780041749/1281934561223250000) if any of you wanna play with Farcaster API with me"
  },
  {
    "userName": "richrob.88",
    "timestamp": "2024-09-07T10:40:32.555000+00:00",
    "content": "Any support for families, with some helpers we could engage to watch our 8 year-old while we work?\n\nOr are there activities planned for kids?"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-07T10:32:11.385000+00:00",
    "content": "For sure. I suggested this in the Blueprint Discord as well - would be a great proof for Bryan Johnson."
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-07T10:31:45.237000+00:00",
    "content": "2 a week — 1 by Balaji, 1 by a guest lecturer"
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-07T10:31:38.107000+00:00",
    "content": "can we have some more details on the biotech side of things? What was the plan? Would be highly interested in measuring some metrics at the beginning and the end of the 3 months\n\n- Could be a very interesting way to showcase the health benefits with actual metrics for future netizens"
  },
  {
    "userName": "sambhav012",
    "timestamp": "2024-09-07T10:28:27.322000+00:00",
    "content": "Thanks for sharing the daily loop!\nWanted to check - biweekly lectures means - 2 lectures a week or a lecture in 2 weeks?\nAlso would love to know more about the problem of the day if you could share!"
  },
  {
    "userName": "velvetdoctor",
    "timestamp": "2024-09-07T10:28:07.967000+00:00",
    "content": "Typically around what time do the speakers come/talks held? Because, I don't want to miss the talks but at the same time if I don't have much work to do after breakfast, I would like to go out and visit places in Malaysia. 🙂"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-07T10:27:20.049000+00:00",
    "content": "Will there be coding workshops and hackathons?"
  },
  {
    "userName": "byornoste",
    "timestamp": "2024-09-07T10:26:46.304000+00:00",
    "content": "Will we be able to help with carpenting of v2?"
  },
  {
    "userName": "saviour1001",
    "timestamp": "2024-09-07T10:26:18.002000+00:00",
    "content": "how does the immigration process look like everytime you enter from Singapore via road"
  },
  {
    "userName": "hazelhu",
    "timestamp": "2024-09-07T10:26:04.011000+00:00",
    "content": "For those who have to arrive late (in October), is that possible to join the event/lecture online first?"
  },
  {
    "userName": "milimaxian",
    "timestamp": "2024-09-07T10:26:01.297000+00:00",
    "content": "Looking to buy tickets to get home for christmas - any important dates to consider at the end?"
  },
  {
    "userName": "milimaxian",
    "timestamp": "2024-09-07T10:26:00.895000+00:00",
    "content": "Any plans for final week(s)?"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-07T10:25:44.249000+00:00",
    "content": "How does it work with the workouts? Is it everyone together same time at 6 AM? Or do you sort of pick time slots?"
  },
  {
    "userName": "emideluxe",
    "timestamp": "2024-09-07T10:25:17.557000+00:00",
    "content": "@undefined and I have experience in teaching in the international school system which is essentially a skill based system - I think a lot of these techniques can be applied to the network school"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-07T10:17:34.739000+00:00",
    "content": "All good 👍"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-07T10:17:29.988000+00:00",
    "content": "All good"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-07T10:17:27.044000+00:00",
    "content": "yes"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-07T10:06:33.797000+00:00",
    "content": "Let me know here if any issues. And let's get started with the orientation!"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-07T10:05:52.158000+00:00",
    "content": "OK folks, we are getting started now! Please put your questions below. I'll go through them after I finish speaking and giving the orientation/overview. Please have one thread per question (you should be able to create threads). If you have any technical difficulties please message @undefined @undefined @undefined."
  },
  {
    "userName": "milimaxian",
    "timestamp": "2024-09-07T10:05:45.245000+00:00",
    "content": "\"Host has joined. We've let them know you're here\""
  },
  {
    "userName": "oreid52",
    "timestamp": "2024-09-07T10:05:26.312000+00:00",
    "content": "Yup"
  },
  {
    "userName": "phuaky",
    "timestamp": "2024-09-07T10:02:07.942000+00:00",
    "content": "Yep"
  },
  {
    "userName": "cameleon_75612",
    "timestamp": "2024-09-07T10:01:56.609000+00:00",
    "content": "yep"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-07T10:01:51.022000+00:00",
    "content": "Yup 🙂"
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-07T10:01:43.466000+00:00",
    "content": "Others also \"waiting for the host to start the meeting\"?"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-07T09:20:30.600000+00:00",
    "content": "Looking forward to seeing you all in 40 mins. You can download Zoom/update it and register here. See you in 40 mins:\nhttps://zoom.us/meeting/register/tJEod-6prjstHNbihNdEEejWix6F0G5OyFjP"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T09:04:13.239000+00:00",
    "content": "Ah! Food Street? I love those."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T09:03:45.685000+00:00",
    "content": "My local friend recommended this for Japanese:\n\nhttps://g.co/kgs/F5Bce2i"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-07T08:53:35.475000+00:00",
    "content": "Fadr"
  },
  {
    "userName": "defijangle",
    "timestamp": "2024-09-07T08:30:43.970000+00:00",
    "content": "Does anyone here know a good AI tool to remix sounds into a song of a certain music style? I have a 30 second sound bite (monologue) I want to sample in the style of a certain genre (lofi hip hop)\n\nIs there a tool that exists for this?"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-07T03:24:50.629000+00:00",
    "content": "Great question for a thread 🤔. I'm open to and ready for whatever may unfold as it's a social experiment. We'll be actively learning and participating in building the Network School vision.\n\nIn my own time, I'll finish writing a whitepaper for a decentralised professional association and education framework for public accountants. The Network School environment will be perfectly conducive to this focus, and I'm grateful for the opportunity.\n\nI also hope to learn Python and Clarity (Stacks smart contracts).\n\nAnd I'll document my daily reflections in a journal. ✍️\n\nInterested to hear what others' intentions are."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-07T03:07:48.846000+00:00",
    "content": "Anyone experimenting with gamedev using ai tools?"
  },
  {
    "userName": "oldkiraicoal",
    "timestamp": "2024-09-07T01:35:25.111000+00:00",
    "content": "An incubator/school for dark Talent, a community based on building communities (pseudo countries even) and decentralizing power. Focused on Web3, AI, Blockchain, and bringing together forward thinking builders from around the world. I feel a kinship to anyone who has been similarly stirred by Balaji's flag and articulation of the future. In my honest opinion, the Network School is a space-time crystal seed factory."
  },
  {
    "userName": "aneesh.mov",
    "timestamp": "2024-09-07T00:48:17.854000+00:00",
    "content": "I know there’s still a lot that’s up in the air about The Network School and how it’ll function in reality, but what are some of your goals for the three month period? Just curious to see how people are approaching this."
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-06T22:14:40.841000+00:00",
    "content": "I've had a fair amount of exposure to DAO legal and tax issues, as an accountant in this space (Australian international), for my own companies, and while on the establishment committee of LawFiDAO in Australia with some lawyers. Not a lot has changed since 2022, but we're seeing people using platforms/services like Otonomos for their projects. I'd be keen to review the current landscape with you. 🙂"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-06T19:05:29.635000+00:00",
    "content": "We've seen many \"feature requests\" fly by in different Discord channels. To gauge interest for different requests, we're starting a dedicated forum in <#1281499249988735018> where Network Schoolers can:\n\n1) React to indicate preferences 🙋‍♂️\n\n2) Reply with comments and questions 💬"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T18:59:28.047000+00:00",
    "content": "I have never tried GitHub Pilot - wish to."
  },
  {
    "userName": "blackmajic5000",
    "timestamp": "2024-09-06T18:24:28.397000+00:00",
    "content": "My job has just pretty much reviewing PRs from cursor and debugging hallucinations"
  },
  {
    "userName": "blackmajic5000",
    "timestamp": "2024-09-06T18:23:56.224000+00:00",
    "content": "Gotta try replit still, cursor especially with the new composer mode has been insane"
  },
  {
    "userName": "jabberwocken",
    "timestamp": "2024-09-06T18:10:29.337000+00:00",
    "content": "I'm in the middle of a 100 days of Code course on Udemy, but there's no AI involved. Still, for $12, it's been good to get familiar with some of the toolsets, etc. Even if you don't go all the way through it, it's good as a resource. https://www.udemy.com/course/100-days-of-code/?couponCode=OF83024C"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T18:09:25.636000+00:00",
    "content": "https://www.deeplearning.ai/short-courses/ai-python-for-beginners/\n\nThis one is amazing!"
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-06T17:55:46.886000+00:00",
    "content": "Ah, there are two sessions so perhaps you can attend one of them. We will have Q&A, but the audience is large enough that people will type rather than speak (otherwise no one can hear)."
  },
  {
    "userName": "balajis",
    "timestamp": "2024-09-06T17:53:53.847000+00:00",
    "content": "@everyone Hi everyone, Balaji here. You should have received calendar invites for the Network School Remote Orientation. You only need to attend one of these events; there are two of them to acommodate people in different time zones. \n\n1) The first is for the Asia/Europe Time Zone in about 16 hours: \nhttps://zoom.us/meeting/register/tJEod-6prjstHNbihNdEEejWix6F0G5OyFjP \n\n2) The second is for the Americas Time Zone in about 31 hours: \nhttps://zoom.us/meeting/register/tJUrdu-trDotG9CzTJtN0OXWFNqpY9Ofymya \n\n3) Here is also a Docsend that explains what we're doing (you should have received this by email as well):\nhttps://docsend.com/view/iikpzun3cqushndw\n\nTLDR: the Network School is about frontier, not fancy. We focused on making it affordable for the dark talent, and getting a place where we could scale the community and edit the physical buildings. While I personally think the island weather is quite pleasant, and I'm spending a lot of time there, it's not meant to be a luxury resort. Instead, the Network School is a place to build yourself up, not a place to spend lots of money. If that works for you, we're excited to have you there! If not, we will happily refund anyone as we have thousands of people on the waitlist, so just DM @undefined. You can also wait for Network School v2 or v3, that's totally fine.\n\n4) OK! I'll speak more about this on the Zooms and answer any questions. Again, looking forward to seeing you!"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-06T17:48:55.945000+00:00",
    "content": "I saw the invite for the remote orientation. Very exciting! Network School sounds like what I want it to be. \n\nAt the current scheduled time, I am supposed to be at an event in El Salvador (close to Bitcoin beach) celebrating the third year of BTC being an official currency here. \n\nhttps://www.bitcoinbeach.com/news/3rd-anniversary-of-bitcoin-country\n\nWill the call be something where us students also talk or just listen to info? Will there be a recording I could listen to later on?"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-06T17:42:07.502000+00:00",
    "content": "Nice, put it on my calendar"
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-06T17:40:32.066000+00:00",
    "content": "A lot of hotels might not let us check in until the afternoon. I will also be sleepy though"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-06T17:30:08.639000+00:00",
    "content": "ah I feel the answer always depends on what do you wanna build"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-06T16:36:44.493000+00:00",
    "content": "I have a bit of background n experience with c++. Which language do you think I should focus n learn for this?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-06T16:35:07.432000+00:00",
    "content": "It’ll be great to share some tutorials for absolute beginners here, people who have never got into coding even. So they can come up to speed."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-06T16:07:10.617000+00:00",
    "content": "All images generated inside twitter using grok"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-06T16:05:58.924000+00:00",
    "content": "Made this in a few hours today - https://x.com/r_k_luthra/status/1832087009466470838"
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-06T15:03:21.567000+00:00",
    "content": "We can go to Lau Pa Sat, heard it's a popular hawker spot, might be a bit crowded during this weekend tho, but it's not too far away"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-06T14:41:57.002000+00:00",
    "content": "also more practical one: https://bytebytego.com/"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-06T14:41:09.645000+00:00",
    "content": "If you really want a book, this is the one: https://dataintensive.net/"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-06T14:38:55.571000+00:00",
    "content": "I would recommend think in concrete. Try to build something and design the system. Ask the LLM to supervise the design process, give feedback, help analyze the design..."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-06T14:38:06.827000+00:00",
    "content": "it is not like Google staff engineer level answer, but far more than enough when just getting started"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-06T14:37:44.830000+00:00",
    "content": "🤣 trust me, you can also ask ChatGPT/Claude the system/architecture questions"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T14:15:17.297000+00:00",
    "content": "I still think I need a systems thinking or big picture tutorial on software building.\n\nEventually I will make one myself...but if y'all have any suggestion, do share"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T14:14:15.004000+00:00",
    "content": "Planning to go down Cursor + Replit rabbithole this weekend"
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-06T14:13:37.978000+00:00",
    "content": "I still got to try Cursor, had so much on my plate lately"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T14:13:16.837000+00:00",
    "content": "Can ask around, have a bunch of friends/alumni in SG"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T14:12:28.746000+00:00",
    "content": "Warm-up ahead of the Deep-dive at School"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T14:12:26.435000+00:00",
    "content": "AI x Coding"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-06T10:51:44.647000+00:00",
    "content": "Feel free anyone to post there"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-06T10:51:34.674000+00:00",
    "content": "In the meantime, I made a channel on warpcast about Dark channel today and will start to post there https://warpcast.com/~/channel/darktalent"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-06T10:49:57.003000+00:00",
    "content": "I was checking for the domain and looks like someone already own the darktalent.xyz, not sure if anyone from here owns it or another person."
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-06T10:20:04.811000+00:00",
    "content": "This is the approach I would recommend. Most books are not really written any better than what ChatGPT can fill you in on the fly. It is also more fun to just build whatever you are interested in"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T07:08:32.381000+00:00",
    "content": "Sure! Shall put up a thread for AI x Coding to deeper discussions."
  },
  {
    "userName": "senatus.",
    "timestamp": "2024-09-06T06:16:15.046000+00:00",
    "content": "My two cents, not sure how helpful - I learnt Python by literally just trying and making it up as I went along. Essentially had something I wanted to build, started trying to build it with help of ChatGPT/Claude and such, if I didn't understand something asked the LLMs to explain what I was doing wrong or why they were doing something different, and then just kept iterating on that. Built quite a few cool things, never took a course or used a book on it.\n\nYour mileage may vary though, I probably lack a lot of the basics and I wouldn't vouch for my code for huge projects for example."
  },
  {
    "userName": "velvetdoctor",
    "timestamp": "2024-09-06T06:13:58.550000+00:00",
    "content": "Thanks @undefined! I have recently started Python for beginners using AI course from Andrew Ng. I learnt some basics of Python before but didn’t continue on that path. Which other courses did you do to learn programming from basics to the level where you are? Could you please recommend which ones you felt are the best?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-06T04:48:52.196000+00:00",
    "content": "I started a thread for AI film making for anyone whose interested in the space to share insights, ideas - https://discord.com/channels/900827411917201418/1280536627365544057"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-06T04:23:30.561000+00:00",
    "content": "Super excited for this! \n\nCursor earlier and yesterday's drop by Replit just made it all the easier, but nonetheless, critical to learn all the basic steps.\n\nI recently built a software completely using ai (code and then packing it into an executable) but then wasn't too sure about its security.\n\n(Am not a programmer. Have learnt all the basics from LLMs and Andrew Ng courses -  with lot of gaps in my knowledge still)\n\nWould absolutely love a Coding 101 going all the way to Coding Mastery 🔥✨🚀"
  },
  {
    "userName": "velvetdoctor",
    "timestamp": "2024-09-06T03:23:25.834000+00:00",
    "content": "Any tutorials on how to learn coding faster using AI tools and how to use them to develop AI x Crypto dapps could be very interesting to people I guess (if there is someone who can teach on those lines). Just my two cents 🙂"
  },
  {
    "userName": "yashluna",
    "timestamp": "2024-09-05T22:22:57.716000+00:00",
    "content": "We'll publish a detailed syllabus. At a high level, there will be five kinds of content:\n\na) Tutorials for power users, like a Q4 2024 toolchain for creating AI movies\nb) Tutorials for programmers, like how to set up Llama3 or Solana locally\nc) Talks by Balaji on updated versions of the Network State\nd) Talks by guest lecturers of the same quality as the Network State Conference and Podcast speakers\ne) All hands talks each week where community members can present their work and/or ask for community help"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T21:24:03.982000+00:00",
    "content": "@undefined can we get more detail on the 'Learn' curriculum - something in the lines of a 'syllabus'?"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-05T17:48:45.460000+00:00",
    "content": "On a side note, I wrote a short fiction story after reading The Network State book haha https://open.substack.com/pub/chiwijournal/p/zeatuna-enter-the-dark-age?r=1ae94&utm_medium=ios"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-05T17:29:32.076000+00:00",
    "content": "There have been some recently interesting exchanges going on about the court case between Prospera and Honduras government. The entire thread, including the original post, are very informative. It also sets an important historical case we should pay attention to if we care about the future of Forrest city and Network State effort there.\n\nhttps://x.com/slatestarcodex/status/1831405516326891549"
  },
  {
    "userName": "alta_81554",
    "timestamp": "2024-09-05T15:53:39.621000+00:00",
    "content": "I was living in south east asia for most of 2024 and if i can recommend something is to buy waterproof shoes, ur life will be easier 😄 💃"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-05T13:16:15.190000+00:00",
    "content": "Wind Breaker is good. I'd say a hoodie or jacket just for indoors :)) We generally like it super cold indoors"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-05T13:09:32.827000+00:00",
    "content": "Im working on some alternative historical videos for India"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-05T13:08:02.104000+00:00",
    "content": "sure"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T13:06:35.413000+00:00",
    "content": "Like a travel brochure  dropped from the future"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T13:06:06.186000+00:00",
    "content": "Future of Travel, a short dream-vision"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T13:05:49.823000+00:00",
    "content": "Am already workin on smth...wanna join in?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-05T13:05:37.631000+00:00",
    "content": "Any ideas?"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T13:05:17.006000+00:00",
    "content": "💯"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-05T12:59:38.182000+00:00",
    "content": "How about some content collaboration?"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-05T12:33:30.811000+00:00",
    "content": "I wonder if any locals in the group can tell us a good dinner spot"
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-05T12:08:55.972000+00:00",
    "content": "I'll arrive at 11 am at the airport, might drop by if I'm not too sleepy"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T11:44:23.304000+00:00",
    "content": "friends in SG suggesting Wind Cheater as a must have"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-05T11:43:53.289000+00:00",
    "content": "You are right! totally"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-05T11:23:44.754000+00:00",
    "content": "Yes, it’s here https://maps.app.goo.gl/J62AfjUqZheRkWhN9?g_st=com.google.maps.preview.copy"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T10:44:36.419000+00:00",
    "content": "wud be fun!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T10:44:31+00:00",
    "content": "we'll figure, i guess the city wud be abuzz with the F1"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-05T10:33:42.359000+00:00",
    "content": "See the F1 Circuit, it is a street race. We will probably need to avoid that area that is dedicated for this event and explore other parts of the city center."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T10:30:12.588000+00:00",
    "content": "I've been to SG once and tbh, the Conf location is just perfect for night exploration"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-05T09:41:21.993000+00:00",
    "content": "Excited to explore the city in the evening with you!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T09:37:29.171000+00:00",
    "content": "thanks - this does look like a lot of rain!"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-05T08:45:03.443000+00:00",
    "content": ""
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-05T08:43:10.531000+00:00",
    "content": "For sure we need to be prepared for a lot of rain, right?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-05T08:35:02.771000+00:00",
    "content": "Or am I doing something wrong, I mean the cinematic quality of midjourney images"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-05T08:34:30.566000+00:00",
    "content": "I tried Flux, its nowhere near the quality of midjourney"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T08:28:59.747000+00:00",
    "content": "planning to"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T08:06:39.364000+00:00",
    "content": "I've been in Mumbai for the longest time. Tropical weather but there are those rare times when a light jacket helps. And this is forest city + island.\n\nI guess one or two light sweater"
  },
  {
    "userName": "odysseus0z",
    "timestamp": "2024-09-05T07:46:00.166000+00:00",
    "content": "🤣 it is tropical weather. It is always summer"
  },
  {
    "userName": "skinx",
    "timestamp": "2024-09-05T07:45:18.644000+00:00",
    "content": "A good light rainjacket will probably be a lot more useful"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T07:41:19.454000+00:00",
    "content": "Any need to carry warm clothing for Nov/Dec? Does it get cold in the island sometime?"
  },
  {
    "userName": "franspeter",
    "timestamp": "2024-09-05T07:22:03.145000+00:00",
    "content": "Thought about that one commandment theory as well...\n\nThe mentioned “In person civility” is already a commandment. We cannot have a society without courtesy; it’s the thing that stops us from killing each other. \n\nIf we’re to start anywhere, it might be just with that. That’s at least a society I would like to be part of. One that’s committed to treat friends and foes with courtesy, even when mutual respect is lacking."
  },
  {
    "userName": "berkeleywanner",
    "timestamp": "2024-09-05T05:43:39.712000+00:00",
    "content": "Could you let me know when you have a location picked out? I should be landing at 6AM that morning."
  },
  {
    "userName": "carlb",
    "timestamp": "2024-09-05T05:11:41.848000+00:00",
    "content": "will be at the conf and would be cool to meet up!"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-05T04:53:45.315000+00:00",
    "content": "Anyone figured out flux or Lora workflows?"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-05T04:48:52.071000+00:00",
    "content": "nice!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T04:24:40.288000+00:00",
    "content": "@undefined @undefined @undefined @undefined  @undefined \n\nCoordination space"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T04:23:06.136000+00:00",
    "content": "Invite yourselves, folks!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-05T04:23:05.299000+00:00",
    "content": "22nd Sept | Dinner + City Exploration"
  },
  {
    "userName": "dhairya.chheda",
    "timestamp": "2024-09-05T03:52:20.218000+00:00",
    "content": "dhairyachheda.eth"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-05T03:39:14.664000+00:00",
    "content": "Wow!"
  },
  {
    "userName": "nafi_42640",
    "timestamp": "2024-09-05T01:59:39.772000+00:00",
    "content": "Is anyone here on Warpcast?"
  },
  {
    "userName": "eliasmarshall",
    "timestamp": "2024-09-05T01:08:45.097000+00:00",
    "content": "Count me in for Soccer and Catan 🫡"
  },
  {
    "userName": "eliasmarshall",
    "timestamp": "2024-09-05T01:07:39.247000+00:00",
    "content": "I have a small youtube channel myself so if y'all have any beginner questions about youtube I can help with that 🙂\n\nI can also help with thumbnails and show you how to do basic editing if needed. \n\nAlso experienced in shortform."
  },
  {
    "userName": "eliasmarshall",
    "timestamp": "2024-09-05T01:03:25.943000+00:00",
    "content": "Whats up everyone, me and my team made a video called the entire story of norse mythology using midjourney images a few months ago. \n\nI'm a bit out of the game but we learned a LOT making it, ended up at around 60k views and I had 50 subs when we posted so not too bad 🙂 \n\nNow im looking to use some midjourney images as B roll for my finance channel, hoping to learn from all of you guys! \n\nhttps://www.youtube.com/watch?v=FUYmj4A30Vk&t=1019s"
  },
  {
    "userName": "eliasmarshall",
    "timestamp": "2024-09-05T00:59:48.771000+00:00",
    "content": "I am so down, gonna be arriving at 7AM and can't check in to my hotel until 3."
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-04T21:38:14.795000+00:00",
    "content": "F1 + a ton of conferences. Prices are wild lol."
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-04T21:37:55.562000+00:00",
    "content": "Add me to the list"
  },
  {
    "userName": "aneesh.mov",
    "timestamp": "2024-09-04T20:57:18.563000+00:00",
    "content": "Ahhh…so, it’s the F1 weekend eh. No wonder hotels were either sold out or super pricey"
  },
  {
    "userName": "aneesh.mov",
    "timestamp": "2024-09-04T20:49:10.718000+00:00",
    "content": "I’m in"
  },
  {
    "userName": "jabberwocken",
    "timestamp": "2024-09-04T20:40:13.344000+00:00",
    "content": "Would love to!"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-04T20:35:35.489000+00:00",
    "content": "Under one commandment theory, each network state should start by defining and measuring one commandment for eg Do Not Die.\nIt also continues to say that the second or 3rd generation of Network states would have 1,2,3 or more already proven commandments that are different and better from the current state. \nSo don't we end up with network states that have many common commandments that are popular, for example- Do Not Die might become a core value for every network state.\nMight not be an issue but just a thought"
  },
  {
    "userName": "htrap",
    "timestamp": "2024-09-04T20:24:54.524000+00:00",
    "content": "that makes sense"
  },
  {
    "userName": "lujansterlin",
    "timestamp": "2024-09-04T18:41:55.620000+00:00",
    "content": "I am in."
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-04T18:25:09.693000+00:00",
    "content": "@undefined count me in!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T17:30:51.700000+00:00",
    "content": "Those attending NS Conference: meet-up for dinner +  city exploration post conference?"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-04T17:06:28.607000+00:00",
    "content": "@undefined @undefined @undefined This will be an evening race. Will compete in my case with the city exploration - my first night in Singapore ever! BTW Spa is such a classic circuit @undefined. My firts time at GP ever. I loved it. Long time ago when the engines were much louder than today 😉"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-04T17:00:31.468000+00:00",
    "content": "Nope I mean watch online together 😂 I was in Spa before and I felt much better to watch on TV than in the circuit haha"
  },
  {
    "userName": "vitorangonese",
    "timestamp": "2024-09-04T16:37:11.924000+00:00",
    "content": "Hey, I’m in! Did you buy a ticket for any of the days?"
  },
  {
    "userName": "_estherr22",
    "timestamp": "2024-09-04T13:31:20.718000+00:00",
    "content": "Oeh yes! Both CrossFit (haven't done it in a while but loved it) and F1!"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-04T13:29:37.282000+00:00",
    "content": "I will not buy a ticket for Singapore GP unfortunately but happy to chat about it 💛For sure the whole city will be crazy for F1 that Sunday evening or rather throughout the weekend 🔥 And I am attending Baku GP a week before Singapore 🙌"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-04T13:07:54.102000+00:00",
    "content": "Amazing! Let’s train together haha"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-04T13:07:42.507000+00:00",
    "content": "Yay! We can watch the race together!"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T12:46:59.698000+00:00",
    "content": "CrossFit"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T12:46:53.041000+00:00",
    "content": "Me"
  },
  {
    "userName": "aagorska",
    "timestamp": "2024-09-04T12:45:58.127000+00:00",
    "content": "I will add: F1 fans?"
  },
  {
    "userName": "camelliayang",
    "timestamp": "2024-09-04T12:37:08.261000+00:00",
    "content": "Curious to know any CrossFit enthusiasts here? And Premier League fans?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T12:27:39.918000+00:00",
    "content": "https://x.com/onwardsproject/status/1831301188832129521?s=46&t=VlNxXQbhawT0n4bef95Bgw"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T12:22:37.758000+00:00",
    "content": "Lumas release today seems quite a big step"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T12:02:43.632000+00:00",
    "content": "Yes a community on x n farcaster would be awesome too"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T12:01:33.309000+00:00",
    "content": "yes, but one cant interact there. sharing x id was the first question in the form, i assumed wud be used to create an X community"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T11:56:36.236000+00:00",
    "content": "@undefined was maintaining a list"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T11:41:29.447000+00:00",
    "content": "Me too!"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-04T10:48:43.605000+00:00",
    "content": "for the CW tips"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-04T10:48:36.065000+00:00",
    "content": "https://www.youtube.com/watch?v=Vi5KQUZSKkM&t=998s"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-04T10:46:27.208000+00:00",
    "content": "i use midjourney + luma too, so far thats the best result. Base on what i try so far i think if you have a storyboard in mind it will be easier to create the video. https://www.youtube.com/@taoprompts this is the channel i check out for tips"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T10:39:23.376000+00:00",
    "content": "https://x.com/lumalabsai/status/1831027696870269188?s=46&t=VlNxXQbhawT0n4bef95Bgw"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T10:06:55.219000+00:00",
    "content": "Forum for the NS and NS Admits, I mean."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T10:06:25.492000+00:00",
    "content": "Hey all, do we have a forum on X?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T09:36:59.058000+00:00",
    "content": "Leonardos character reference is quite good too"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T09:36:22.557000+00:00",
    "content": "Yeah me too would love to explore diff techniques"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T09:36:04.140000+00:00",
    "content": "awesome! will try right away!"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T09:35:16.638000+00:00",
    "content": "On the discord bot you you use —CREF followed by the link of the image and —cw followed by a vale from 0 to 100. Depending upon how much weight you wanna give it"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T09:33:59.558000+00:00",
    "content": "When you upload an image in the mid journey website it gives the options of image reference, style reference or character reference."
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T09:28:24.823000+00:00",
    "content": "+1 \n\nwould love to learn different techniques!"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-04T09:13:22.435000+00:00",
    "content": "And I saw in the introduction we have people from different teachings and even yoga teacher 😄 might be good to explore different techniques for starters and for those that wants a specific meditation (for example vipassana) can have that session host when we have group."
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-04T09:11:02.309000+00:00",
    "content": "I think we will probably need to get the NS timetable and plan around it"
  },
  {
    "userName": "feides",
    "timestamp": "2024-09-04T09:10:42.861000+00:00",
    "content": "I usually do this https://youtu.be/dBHcL7DhEfE?si=lxD-yyHmgud-Ny__"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T09:09:47.769000+00:00",
    "content": "how long are we looking for our sessions to be?"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T09:09:12.118000+00:00",
    "content": "have done it few times at our club in mumbai. for vipassana in particular, guidance helps. i normally meditate to goenka recordings"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T09:07:02.045000+00:00",
    "content": "whats the command? share a sample prompt?"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-04T09:06:32.430000+00:00",
    "content": "https://x.com/electrik_dreams/status/1830121651276566944\n\ncheck this out folks!"
  },
  {
    "userName": "benchuchu.eth",
    "timestamp": "2024-09-04T08:28:10.902000+00:00",
    "content": "There will be quite a few of us doing this I think, looking forward to seeing everyones take"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T06:19:23.364000+00:00",
    "content": "I experienced a beautiful guided Vipassana meditation in Ubud yesterday. If some of you have the comfort to conduct it, it would great to try guided sessions too sometimes"
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-04T05:42:05.216000+00:00",
    "content": "Some reflections on drivers for crypto's legal victory (for now) against establishment witch-hunting, to draw parallels to what network state/network society movement may eventually need (not an exhaustive list):\n- Leadership, inspiration, and steel will by tech entrepreneur stalwarts (e.g. Brian Armstrong, Winklevoss brothers, etc).  TNS Parallel: In this parallel society movement we have the strength of Balaji, Bryan Johnson, maybe Vitalik, etc.\n- Use cases that go beyond technical papers to a burgeoning economy. TNS Parallel: Network society economy parallel to crypto economy.\n- Movement value proposition going mainstream --  BTC from an initial techie fringe BBS-board thing (pre-2013) to becoming a grass-roots one that even a cabbie in Cambodia can understand, recognize, and own. TNS Parallel: a thousand netizens -> to a million+ netizens.\n- Distributed political power, especially in young voters, as crypto vote has become a critical constitutiency in almost every voting district (at least in the US), with enough passionate voters to swing the election direction. TNS Parallel: If there is a sigificant number of voters, especially young voters (longer vote lifetime), legally present in almost every significant jurisdiction and constituency, who believe in network societies or are netizens too, then establishment politicians will think twice about accusing, banning, or calling \"threats to democracy.\""
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-04T05:12:16.254000+00:00",
    "content": "One of the lessons from crypto projects -- from XRP to ETH, for example -- is that the establishment would try to throw accusations years down the line that would have major impact on public perception and growth of the network, as well as major legal battle (in the case of XRP). Eventually victory for crypto/decentralization/network, but earlier legal planning may have prevented some of those headaches."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T05:05:59.909000+00:00",
    "content": "Tried Runwaymls extended video feature today - https://x.com/r_k_luthra/status/1831172353709285699?s=46&t=VlNxXQbhawT0n4bef95Bgw"
  },
  {
    "userName": "jim_nomad",
    "timestamp": "2024-09-04T05:01:13.958000+00:00",
    "content": "@undefined Good points, thanks for sharing, would love to connect and learn from you. I bring up this topic around legal and tax protection because it is likely to be something that will come up when times get tough -- as Balaji says, when the establishments fight back. There is a parallel to accusations on Bitcoin/crypto -- in that the establishment nation state institutions may hurl similar witch-hunt accusations around illegal this and illegal that. The network state/network society movement needs to be ready to defend itself -- parallel to how the crypto industry eventually found ways to defend itself, sometimes with legions of lawyers and lobbyists.\n\nI brought up global membership fees as one example, but yes, it doesn't need to be that. How DAOs are treated in terms of legal compliance would go a long way in terms of defending network state infrastructure legality. Is anyone here an expert on DAO legal and compliance matters?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T04:27:54.489000+00:00",
    "content": "Mid journey is better however Leonardo gives you some free credits everyday. Not sure if you can use consistent characters in the free option though."
  },
  {
    "userName": "jabberwocken",
    "timestamp": "2024-09-04T03:49:08.986000+00:00",
    "content": "Ah, ok - I'll have to check those both out. I've been using StableDiffusion locally to keep off of a centralized platform (and to keep it free), but consistent characters have been a real struggle"
  },
  {
    "userName": "photonic",
    "timestamp": "2024-09-04T03:37:57.868000+00:00",
    "content": "Count me in for Catan, I have a funny story about that game I’ll share when we play haha"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T03:33:36.587000+00:00",
    "content": "Yes, indeed what I was thinking as well, we could create books - not only delving into the concept of network states, other dimensions but also explore fictional narratives of how they could play out and impact our existence, and through ai both fiction and documentary style short/long form films can be made building on these ideas."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-04T03:30:09.556000+00:00",
    "content": "Actually making consistent characters is not complex anymore, I have used both Midjourney and Leonardo, where theres a feature to upload an image and select is as a 'character reference'. In midjourney you can also define its 'character weight'."
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-03T22:58:41.820000+00:00",
    "content": "thanks! this is super helpful"
  },
  {
    "userName": "lujansterlin",
    "timestamp": "2024-09-03T22:05:35.994000+00:00",
    "content": "Wrote this on my Substack, would love to discuss: I feel like the history of Network States is a topic that needs more intellectual and scholarly attention: \n\nhttps://substack.com/@sterlinlujan/p-148209257\n\nHere is a bit from the article: \n\n\"A network state can theoretically be recognized if it exists alongside other states, but that is not a prerequisite. Geographical constraints or political boundaries do not limit their formation. One critical understanding of network states is that they do not have to be coercive or mandatory, unlike nation-states. They can and should be voluntary. The historical root of the network state was philosophical and political, with no technological ingredient. That original idea is called “panarchy.”"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-03T21:47:37.163000+00:00",
    "content": "mhh good question! I believe the NS should achieve both immediate impact and long-term cultural significance, so there could be a dual strategy. On one hand, short, viral content –for spreading awareness quickly and engaging a broad audience (e.g. viral videos, social media campaigns, eye-catching infographics).\nOn the other hand, i think it's equally important to invest in creating enduring cultural artifacts that will stand the test of time. e.g. substantial works like books, films, and documentaries that delve into the philosophy, history, and aspirations of the NS. This could help establish the intellectual and cultural foundation of the community while also ensure that our ideas are taken seriously and studied by future generations.\nWhile network states can be created faster than physical territories, the culture we build must be robust and substantial 🙌"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-03T21:33:19.148000+00:00",
    "content": "here's a personal hack that worked like magic for me: i would normally max out at 5 mins and vipassana meant close to 9 hours of daily practise.\n\n3 months before going for the course, I & a friend became eachother's accountability partners.\n\nWe would message each other daily, (and honestly!), on our practise. Started with 5mins, slowly upped it in increments of 5 to eventually reach 30. And then higher. I guess this works the same way as gym reps - you just develop the right 'muscles' so to say and its no longer an ordeal.\n\nhope this helps!"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-03T21:26:41.491000+00:00",
    "content": "count me in! I recently started my meditation journey and reading many of your introductions inspired me to try Vipassana. I'll start a daily practice of the alignment until I meet you all 🤍"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-03T20:59:09.024000+00:00",
    "content": "We should have a Community on X too"
  },
  {
    "userName": "rrominarr",
    "timestamp": "2024-09-03T20:58:53.450000+00:00",
    "content": "loving the \"a day in the life\" idea! I'll be following this initiative !"
  },
  {
    "userName": "electrafrost.btc",
    "timestamp": "2024-09-03T20:49:38.290000+00:00",
    "content": "Great question I hope to solve too. Professional accountant here, working on a model for decentralised global professional association (will be open source and adaptable to other professions). Our strategy is to be inclusive of our professional bodies around the world, introducing a merger of qualified people rather than a merger of our bodies, to more effectively coordinate our profession to upskill, standardise and influence government and industry. However, we'd disintermediate the role and functions  of the International Federation of Accountants (IFAC) which is registered in NY, USA. \n\nI don't think our social-DAO revenue model should require membership fees, however there will be signup fees for the professional bodies and transaction fees generated from member CPE activity. I'm looking at jurisdictions to launch it from. Currently in a tax-exempt charity that I co-founded in Australia, as a research project. I'm building it on Bitcoin so maybe one day I'll do a Satoshi Nakamoto and let it run by itself with no central taxing point!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-03T17:44:50.061000+00:00",
    "content": "that's right. was in mumbai just a year back. this shoot happening in pune"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-03T17:00:01.551000+00:00",
    "content": "Youre in delhi right bro?"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-03T16:59:49.636000+00:00",
    "content": "I have not yet done a lot of consistent characters, but would share the workflow from what I know tomm"
  },
  {
    "userName": "jabberwocken",
    "timestamp": "2024-09-03T16:57:44.012000+00:00",
    "content": "How do you all get consistent characters? Do you train a LORA after the first set of generations, or use stills of a 3D model, or...? That's the part I've struggled most with, even for 2D storytelling: just getting the characters recognizably the same from image to image"
  },
  {
    "userName": "jabberwocken",
    "timestamp": "2024-09-03T16:57:29.768000+00:00",
    "content": "Nice!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-03T16:56:51.962000+00:00",
    "content": "Its a lot of fun!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-03T16:56:40.348000+00:00",
    "content": "One of the members make commerical films and is inviting some of us to watch an actual shoot next week!"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-03T16:55:55.777000+00:00",
    "content": "I run a community back home where we have a group dedicated to learning AI Filmmaking!"
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-03T16:55:00.821000+00:00",
    "content": "I have been part of an AI film making program at Curious Refuge, still going through it, has a detailed worksflow for AI film making. Still refining my workflow an dlearning more"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-03T16:53:37.064000+00:00",
    "content": "udio/suno for soundtracks"
  },
  {
    "userName": "electrikdreams",
    "timestamp": "2024-09-03T16:53:11.974000+00:00",
    "content": "yup. this is the flow i use as well."
  },
  {
    "userName": "rkluthra",
    "timestamp": "2024-09-03T15:48:11.414000+00:00",
    "content": "The workflow I know of consists of creating images through mid journey, you can use a setting specifically for anime style images too. Then run them through an ai image to video tool like luma, runwayml, etc. A higher level of automation is on the way, however, still to achieve a tighter control over the output I think this is the workflow that shall be used in the foreseeable future."
  },
  {
    "userName": "jabberwocken",
    "timestamp": "2024-09-03T15:31:30.097000+00:00",
    "content": "Love this, thank you for making the thread! I'd love to take a defined style (anime comes to mind) see how much of it could be automated entirely.\n \nIdea: Create customizable nodes that the AI can recognize and improve upon. \nEven in an anime like Nichijou, which has a lot of variety despite its short length and slice-of-life focus, there's quite a few repeated types of building blocks (camera angles, arrangements of characters, settings/background, characters themselves, etc.). I've struggled getting consistent results from AI, but I'm not using templatized nodes like I am describing here.  Composing episodes then becomes a storyboarding exercise, with AI transforming those storyboards into consistent results.\n\nDo you guys already do this, or know of a tool that does?"
  }
]
